/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
heals_media_sort_gen_: proc (heals_arg_info_p, heals_ior_args_p, r_code);

/* ******************************************************************************
   *								*
   *  Comments:							*
   *								*
   * 	 Evolved from heals_sorted_report_gen_ by A. R. Downing May 1977	 			*
   *	Last modified by RH Morrison  01/03/77				*
   *								*
   ****************************************************************************** */

/* FF */
/* ********	DECLARATIONS	******** */

/* ****	PROCEDURE ARGUMENTS   **** */

dcl  heals_arg_info_p ptr;
dcl  heals_ior_args_p ptr;
dcl  r_code fixed bin (35);

/* ****	EXTERNAL STATIC	**** */

dcl  error_table_$end_of_info ext static fixed bin (35);

/* ****	ENTRIES		**** */
dcl  sort_ entry ((*)char (*), char (*), (*)ptr, char (*), char (*), float bin (27),
     fixed bin (35));
dcl  clock_ entry returns (fixed bin (71));
dcl  get_pdir_ entry returns (char (168));
dcl  ioa_ entry options (variable);
dcl  ioa_$ioa_switch entry options (variable);
dcl  com_err_ entry options (variable);
dcl  date_time_ entry (fixed bin (71), char (*));
dcl  iox_$attach_ioname entry (char (*), ptr, char (*), fixed bin (35));
dcl  iox_$detach_iocb entry (ptr, fixed bin (35));
dcl  iox_$close entry (ptr, fixed bin (35));
dcl  iox_$open entry (ptr, fixed bin, bit (1) aligned, fixed bin (35));
dcl  iox_$read_record entry (ptr, ptr, fixed bin (21), fixed bin (21), fixed bin (35));

/* ****	POINTERS		**** */
dcl  flags_p ptr init (null);
dcl  work_p1 ptr init (null);

/*  Arguments  */
dcl  sortsw_p ptr init (null);
dcl  sort_data_p ptr init (null);
dcl  sort_desc_p (3) ptr init (null, null, null);
dcl  inbuf_p ptr init (null);
dcl  insw_p ptr init (null);
dcl  outsw_p ptr init (null);

/* Pointers declared in include files:
   ior_flags_p
   ior_prms_p
   ch_nfo_p
   heals_ior_avars_p
   ioerr_rec_p
   statp
   iocbp
   io_msgp
   */

/* ****	CHARACTER STRING VARIABLES    **** */
dcl  old_name char (4);
dcl  whoami char (24) int static init ("heals_media_sort_gen_");
dcl  inbuf char (inbuf_len) aligned;
dcl  rprt_from_time char (16);
dcl  rprt_to_time char (16);
dcl  old_date char (8);
dcl  date char (8);
dcl  time char (6);
dcl  date_time char (16);
dcl  ch_nr pic "99";
dcl  dev_nr pic "99";

/*  Arguments  */
dcl  version_date char (8) init ("12/15/76");

/* ****	ARITHMETIC VARIABLES    **** */
dcl  clock_time fixed bin (71);
dcl  line_cnt fixed bin;
dcl  max_line_cnt fixed bin;
dcl  page_nb fixed bin;

/*  Arguments  */
dcl  version_nb fixed bin init (1);
dcl  code fixed bin (35);
dcl  inrec_len fixed bin (21);
dcl  inbuf_len fixed bin (21) int static init (1024);
dcl  seq_in fixed bin int static init (4);

/* ****	BIT STRING VARIABLES    **** */
dcl  flags_word bit (36) aligned;
dcl  eof bit (1) aligned;

/*  Arguments  */
dcl  unused bit (1) aligned init ("0"b);

/* ****	BASED VARIABLES		**** */
dcl 1 arg_info like heals_arg_info aligned based (heals_arg_info_p);
dcl 1 flags aligned based (flags_p),
    (2 trace bit (1),
    2 db bit (1),
    2 hdrs bit (1),
    2 no_recs bit (1),
    2 fill bit (1)
     ) unal;

/* ****	SORT DECLARATIONS   **** */
dcl  sort_file_size float bin (27);
dcl  sort_out_file char (168);
dcl  sort_temp_dir char (168);
dcl  sort_user_out_sw char (32);
dcl  sortsw char (6) int static init ("sortsw");
dcl  sort_in_file (1) char (168);
dcl  user_keys_number int static init (3);
dcl 1 keys,
    2 version fixed bin init (1),
    2 number fixed bin,
    2 key_desc (user_keys_number),
      3 datatype char (8),
      3 size fixed bin (24),
      3 word_offset fixed bin (18),
      3 bit_offset fixed bin (6),
      3 desc char (3);

/* ****	MISC. DECLARATIONS		**** */

dcl (addr, addrel, before, fixed, null) builtin;
dcl  cleanup condition;

/* FF */
/* ****	INCLUDE FILES	**** */
%include heals_arg_info;
%include heals_io_report_args;
%include heals_ioerr_rec;
%include io_syserr_msg;
%include iom_stat;
/* ****	END OF DECLARATIONS   **** */
/* FF */
/* ********	PROCEDURE		******** */

/* ****	Procedure Initialization	**** */

	on cleanup call clean_up;

/*  Init returns.  */
	r_code = 0;
	arg_info.err_nb = 0;

/*  Init pointers.  */
	flags_p = addr (flags_word);
	insw_p = ioerr_log_sw_p;
	outsw_p = arg_info.report_iocbp;
	inbuf_p = addr (inbuf);
	ioerr_rec_p = addr (inbuf);
	io_msgp = addr (ioerr_rec.data);
	statp = addr (io_msg.status);

/* Init control flags.  */
	flags_word = "0"b;
	flags.hdrs = "1"b;
	flags.no_recs = ior_flags.no_recs;
	eof = "0"b;

/*  Init all else.  */

	code = 0;
	old_date = "";
	page_nb = 0;
	line_cnt = 0;
	max_line_cnt = max_line_cnt_a;
	call date_time_ (arg_info.from_time, rprt_from_time);
	call date_time_ (arg_info.to_time, rprt_to_time);

/*  Initialize for sort.  */
	sort_in_file = "-if "||before (get_pdir_ (), " ") ||">heals_ioerr_log";
	sort_out_file = "-of " || before (get_pdir_ (), " ") || ">heals_sort_log";
	sort_desc_p (1) = addr (keys);
	sort_desc_p (2) = null;
	sort_desc_p (3) = null;
	sort_file_size = 0;
	sort_temp_dir = "";
	sort_user_out_sw = "";

	keys.number = user_keys_number;

	key_desc.datatype (1) = "char";
	key_desc.size (1) = 8;
	key_desc.word_offset (1) = 0;
	key_desc.bit_offset (1) = 0;
	key_desc.desc (1) = "";

	key_desc.datatype (2) = "char";
	key_desc.size (2) = 7;
	key_desc.word_offset (2) = 8;
	key_desc.bit_offset (2) = 0;
	key_desc.desc (2) = "";


	key_desc.datatype (3) = "bit";
	key_desc.size (3) = 44;
	key_desc.word_offset (3) = 2;
	key_desc.bit_offset (3) = 0;
	key_desc.desc (3) = "";

/* ****	End Procedure Initialization    **** */

/*  Run information.  */
	clock_time = clock_ ();
	call date_time_ (clock_time, date_time);
	date = substr (date_time, 1, 8);
	time = substr (date_time, 11, 6);
	if flags.trace
	| ior_flags.trace
	then call ioa_ ("^a run info: date ^a, time ^a, version ^d of ^a.",
	  whoami, date, time, version_nb, version_date);

/*  Sort heals_ioerr_log for the media_error report.  */
	call sort_ (sort_in_file, sort_out_file, sort_desc_p,
	  sort_temp_dir, "", 0, code);
	if code ^= 0 then call proc_err (45);

/* ****	Write media__error report.   **** */

/*  Attach and open heals_sort_log file.  */
	if ^flags.no_recs
	then do;
	  call iox_$attach_ioname (sortsw, sortsw_p, "vfile_ " || before (
	    get_pdir_ (), " ") || ">heals_sort_log", code);
	  if code ^= 0 then call proc_err (22);
	  call iox_$open (sortsw_p, seq_in, unused, code);
	  if code ^= 0 then call proc_err (40);

/*  Read first record.  */
	  call iox_$read_record (sortsw_p, inbuf_p, inbuf_len, inrec_len, code);
	  if code ^= 0 then if code = error_table_$end_of_info
	    then flags.no_recs = "1"b;
	    else call proc_err (41);
	  old_name = dev_nm;			/* initialize from first record */
	end;

/* Record processing loop. */
media_report_line_loop:
	do while (^eof);
	  if flags.hdrs
	  then do; page_nb = page_nb + 1;
	    line_cnt = 5;
	    call ioa_$ioa_switch (outsw_p,
	      "^|MEDIA_IO_ERROR_REPORT:^x^a^xto^x^a^5xPAGE^x^2d^/",
	      rprt_from_time, rprt_to_time, page_nb);

	    call ioa_$ioa_switch (outsw_p,
	      "_____D_E_V_I_C_E_____^3xS_T_A_T_U_S__^2xTLY^4xTAPE_NO^1xDENS^xRING^1xTRK^4xS_Y_S_E_R_R_____L_O_G_
I-CC-DD NAME CM^3xMJ-SB-I^9xDISK_AD^2xCYL^xHEAD^1xSEC^4xTIME^3xNUMBER");

	    if flags.no_recs then eof = "1"b;
	  end;

/* Write date line. */
	  if ^eof
	  then do; if sort_date ^= old_date | flags.hdrs
	    then do; old_date = sort_date;
	      flags.hdrs = "0"b;
	      line_cnt = line_cnt +4;
	      call ioa_$ioa_switch (outsw_p, "^/^72(_^)^/DATE:^x^a^vxDATE:^x^a^/",
	        sort_date, 44, sort_date);
	    end;

	    ch_nr = fixed (ch_nb);
	    dev_nr = fixed (dev_nb);

/*  Write media_error report line.  */
	    if substr (dev_nm, 1, 3) ^= "tap" &
	    substr (dev_nm, 1, 3) ^= "dsk" then go to read_next_log_rec;
	    line_cnt = line_cnt + 1;

	    if rprt_flags.ioerr
	    then call ioa_$ioa_switch (outsw_p,
	      "^1d-^2a-^2a^x^4a^x^2.3b^3x^2.3b-^2.3b-^1a^2x^3d^4x^7a^1x^4a^3x^2a^2x^2a^4x^6a^x^6d",
	      iom_nb, ch_nr, dev_nr, dev_nm, dev_cmnd, maj_st, sub_st, ntrpt_nm, tally_nb,
	      tapno_diskad, dens_cyl, ring_head, tracks_sector,
	      log_time, seq_nb);

	    else if rprt_flags.diskerr
	    then do; call ioa_$ioa_switch (outsw_p,
	        "^1d-^2a-^2a^x^4a^x^2.3b^3x^2.3b-^2.3b-^1a^2x^3d^4x^7a^1x^4a^3x^2a^2x^2a^4x^6a^x^6d^/^18x^a",
	        iom_nb, ch_nr, dev_nr, dev_nm, dev_cmnd, maj_st, sub_st, ntrpt_nm, tally_nb,
	        tapno_diskad, dens_cyl, ring_head, tracks_sector,
	        log_time, seq_nb, ioerr_rec.msg);
	      line_cnt = line_cnt + 1;
	    end;

	    else if rprt_flags.disk_addr
	    then call ioa_$ioa_switch (outsw_p,
	      "^1d-^2a-^2a^x^4a^x^2.3b^19x^7a^1x^4a^3x^2a^2x^2a^4x^6a^x^6d",
	      iom_nb, ch_nr, dev_nr, dev_nm, dev_cmnd,
	      tapno_diskad, dens_cyl, ring_head, tracks_sector, log_time, seq_nb);

	    else if rprt_flags.ext_stat | rprt_flags.iom_rec
	    then call ioa_$ioa_switch (outsw_p,
	      "^1d-^2a-^2a^x^4a^x^2.3b^3x^38a^3x^6a^x^6d",
	      iom_nb, ch_nr, dev_nr, dev_nm, dev_cmnd, ioerr_rec.msg, log_time, seq_nb);

	    else if rprt_flags.msg
	    then call ioa_$ioa_switch (outsw_p, "^a", ioerr_rec.msg);

	    else if rprt_flags.bulk
	    then call ioa_$ioa_switch (outsw_p,
	      "^8x^50a^x^6a^x^6d",
	      ioerr_rec.msg, log_time, seq_nb);

/*  Read next heals_sort_log record.  */
read_next_log_rec:
	    call iox_$read_record (sortsw_p, inbuf_p, inbuf_len, inrec_len, code);
	    if code ^= 0
	    then if code = error_table_$end_of_info
	      then eof = "1"b;
	      else call proc_err (42);


/*  Date change.  */
	    if sort_date ^= old_date
	    then if line_cnt > max_line_cnt - 10
	      then flags.hdrs = "1"b;
	  end;

	  if line_cnt > max_line_cnt
	  then flags.hdrs = "1"b;
	end media_report_line_loop;

/*  End of file on heals_sort_log.  */
	if flags.no_recs
	then call ioa_$ioa_switch (outsw_p,
	  "^/^11xThere were no io_errors during the report period.");
	call ioa_$ioa_switch (outsw_p,
	  "^/END: MEDIA_IO_ERROR_REPORT");
	if ^flags.no_recs
	then do; call iox_$close (sortsw_p, code);
	  if code ^= 0 then call proc_err (43);
	  call iox_$detach_iocb (sortsw_p, code);
	  if code ^= 0 then call proc_err (27);
	end;
	return;

/* FF */
proc_err:	proc (proc_err_nb);
dcl  proc_err_nb fixed bin;
	  r_code = code;
	  arg_info.err_nb = proc_err_nb;
	  call com_err_ (code, whoami, "Procedure error number = ^d.", proc_err_nb);
	  call clean_up;
	  goto err_return;
	end proc_err;

clean_up:	proc;
	  if sortsw_p ^= null () then do;
	    call iox_$close (sortsw_p, code);
	    call iox_$detach_iocb (sortsw_p, code);
	  end;
	  return;
	end clean_up;

err_return: return;

        end heals_media_sort_gen_;
