/* ***********************************************************
   *                                                         *
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1981 *
   *                                                         *
   *                                                         *
   *********************************************************** */

gtss_ios_initialize_: proc;

/* Initialize disk file data base file control
   blocks structure to null pointers.

   Author: Dave Ward	03/04/80 (derived from gtss_ios_)
*/
	gtss_disk.fcb_ptr = null ();
	return;

dcl null builtin;

%include gtss_dfd_ext_;
     end						/* gtss_ios_initialize_ */;
