/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */

/* Modified '83 by Keith Loepere for (get set)_bce_command */

flagbox_mgr: proc;

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

dcl  addr			        builtin;
dcl  string		        builtin;

set: entry (turnon, turnoff);

dcl  turnon		        bit (36);
dcl  turnoff		        bit (36);

	fgbxp = addr (flagbox$);

	string (fgbx.flags) = string (fgbx.flags) & ^turnoff;
	string (fgbx.flags) = string (fgbx.flags) | turnon;
	return;

get: entry (sws);

dcl  sws			        bit (36);

	fgbxp = addr (flagbox$);
	sws = string (fgbx.flags);
	return;

set_bce_command:
     entry (bce_command);

dcl  bce_command		        char (128);

	fgbxp = addr (flagbox$);
	fgbx.return_to_bce_command = bce_command;
	return;

get_bce_command:
     entry (bce_command);

	fgbxp = addr (flagbox$);
	bce_command = fgbx.return_to_bce_command;
	return;
%page; %include flagbox;
     end flagbox_mgr;
