/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        *********************************************************** */
initializer: proc ();

/* *	INITIALIZER
   *
   *	This program is the driving procedure of Multics Initialization.
   *	It receives control from bootstrap2, and never returns. It must
   *	be separate from bootstrap2, and, in fact, be part of the permanent
   *	supervisor, because it makes the call to delete all the initialization
   *	segments. However, it does little else, and just calls real_initializer
   *	(which is an init-seg, and therefore gets deleted) to do the
   *	real work of initialization.
   *
   *	Remodeled, 12/21/80 by W. Olin Sibert
   *	Changed 10/27/84 by Allen Ball to set slt.(first last)_init_seg = 32768 after deleting them. 
   */

	dcl     addr		 builtin;
	dcl     delete_segs$delete_segs_init entry ();
	dcl     init_proc		 entry ();
	dcl     real_initializer	 entry ();
	dcl     slt$		 external;


	sltp = addr (slt$);
	call real_initializer;			/* Call  the real thing */

	call delete_segs$delete_segs_init;		/* Clean up after the previous call */

	slt.first_init_seg = 32768;			/* These segs are no more. */
	slt.last_init_seg = 32768;			/* 32768 is > possible valid segno */

	call init_proc;				/* And call out to ring 1, never to return */

%include slt;
     end initializer;
