/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1984 *
        *                                                         *
        *********************************************************** */
bootload_disk_post: proc (coreadd, errcode);

/* Routine to post bootload disk i/o completions.
Written in June 1983 by Keith Loepere. */

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

dcl  addr			        builtin;
dcl  coreadd		        fixed bin (26) parameter; /* mem addr i/o finished into */
dcl  errcode		        fixed bin (35) parameter; /* word of flags signalling successful/bad i/o */
dcl  i			        fixed bin;		/* loop counter */
dcl  sys_info$initialization_state    fixed bin ext;
dcl  syserr		        entry options (variable);

	if sys_info$initialization_state ^= 1 then go to crash;
	disk_post_area_ptr = addr (bootload_disk_post_seg$);
	do i = 1 to disk_post_area.number;
	     if disk_post_area.buffer_coreadd (i) = coreadd then do;
		if disk_post_area.disk_complete (i) then go to crash;
		disk_post_area.disk_complete (i) = "1"b;
		disk_post_area.disk_error_code = errcode;
		return;
	     end;
	end;
crash:	call syserr (CRASH, "bootload_disk_post: Attempt to post non-requested i/o completion.");
	return;
%page;
%include bootload_post_area;
%page;
%include syserr_constants;
%page;

/* BEGIN MESSAGE DOCUMENTATION

  Message:
  bootload_disk_post: Attempt to post non-requested i/o completion.

  S: $crash

  T: $init

  M: disk_control detected an i/o completion that Bootload Multics does
  not believe it requested.

  A: Reboot.

  END MESSAGE DOCUMENTATION */

     end;
