/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

plio2_resig_:proc(pspp) options(support);

	dcl pspp ptr;
	dcl psp ptr;
	dcl fsbp ptr;
	dcl file_p ptr;
	dcl name33 char(33) aligned;
	dcl (index,null,substr) builtin;
	dcl addr builtin;
	dcl q ptr;


	dcl find_condition_info_ entry(ptr,ptr,fixed bin(35));
	dcl continue_to_signal_ entry(fixed bin(35));


	dcl code fixed bin(35);


dcl 1 condition_structure_ aligned like condition_info;

%include condition_info;

%include on_data_;

%include pl1_info;
%include condition_info_header;

%include plio2_fsb;
%include plio2_ps;



			/* called by the following programs.

					LDI
					LDO
					GVE
					PVE

							P.Belmont  74.01.07     */
	psp=pspp;
	if ps.job.string then goto resig;

	file_p=ps.file_p;
	fsbp=ps.fsbp;
	name33=fsb.filename;

	q=addr(condition_structure_);
	call find_condition_info_(null,q,code);
	if code^=0 then goto resig;

	q=condition_structure_.info_ptr;

	q->pl1_info.onfile=name33;
	q->pl1_info.onfile_sw="1"b;
	q->pl1_info.file_ptr=file_p;
	q->pl1_info.file_ptr_sw="1"b;

	ondata_$fileptr=file_p;
	ondata_$onfile=substr(name33,1,index(name33," ")-1);

resig:

	call continue_to_signal_(code);

end plio2_resig_;
