use_ep_basic:  proc;

/* This command causes the basic compiler to compile programs in double precision. */

dcl basic$precision_length fixed bin(35) ext;

	basic$precision_length = 2;
	return;


use_sp_basic:  entry;

	basic$precision_length = 1;			/* set back to single precision */
	return;

	end;
