/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


xmail_delete_mlist_: proc (P_dir, P_file);

	dcl     (P_dir, P_file)	 char (*);
	dcl     code		 fixed bin (35);
	dcl     com_err_$suppress_name entry () options (variable);
	dcl     hcs_$delentry_file	 entry (char (*), char (*), fixed bin (35));
	dcl     ioa_		 entry () options (variable);
	dcl     ME_CHAR		 char (19) init ("xmail_delete_mlist_");
	dcl     xmail_sw_$update_file	 entry (char (*));
	dcl     xmail_sw_$redisplay	 entry ();
	dcl     rtrim		 builtin;
	dcl     timer_manager_$sleep	 entry (fixed bin (71), bit (2));
	dcl     MLIST_SUFFIX	 char (3) init ("mls") int static options (constant);

	call hcs_$delentry_file (P_dir, P_file, code);
	if code ^= 0 then call delete_mlist_err (code, "Trying to delete mailing list.");

	call xmail_sw_$update_file (" ");
	call xmail_sw_$redisplay ();
	call ioa_ ("""^a"" mailing list was discarded.", rtrim (rtrim (P_file,
	     MLIST_SUFFIX), " ."));
	call timer_manager_$sleep (3, "11"b);

EXIT:

	return;

%page;
/* Internal procedures */

delete_mlist_err: proc (P_code, P_str);

	dcl     P_code		 fixed bin (35);
	dcl     P_str		 char (*);

	call com_err_$suppress_name (P_code, ME_CHAR, "^a", P_str);
	go to EXIT;

     end delete_mlist_err;

     end xmail_delete_mlist_;
