/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


get_system_search_rules: gssr: proc;

/* get_system_search_rules - get current default search rules and keywords.

   Written by THVV 7/76 */

	xsp = addr (temp);				/* Initialization. Find input structure for hardcore */
	call hcs_$get_system_search_rules (addr (temp), ec);
	if ec ^= 0 then do;
	     call com_err_ (ec, "get_system_search_rules", "");
	     return;
	end;

	do i = 1 to dft_sr_arg.nrules;
	     line = dft_sr_arg.rules (i).name;
	     do j = 1 to dft_sr_arg.ntags;
		if (dft_sr_arg.rules (i).flag & dft_sr_arg.tags (j).flag) ^= "0"b then do;
		     k = length (line) + 2 - verify (reverse (line), " ");
		     substr (line, k) = ", " || dft_sr_arg.tags (j).name;
		end;
	     end;
	     call ioa_ ("^a", line);
	end;

	return;					/* All done */

dcl  ec fixed bin (35);
dcl (i, j, k) fixed bin,
     line char (256);

dcl  com_err_ entry options (variable);
dcl  ioa_ entry options (variable);
dcl  hcs_$get_system_search_rules entry (ptr, fixed bin (35));

dcl  null builtin;

dcl 1 temp aligned like dft_sr_arg;

%include system_dft_sr;

     end get_system_search_rules;
