/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
ta_reconstruct_table_: proc;

dcl (com_err_, com_err_$suppress_name) ext entry options (variable);

	call com_err_ (0, "tape_archive", "The reconstruct key is not yet implemented.");
	return;
     end ta_reconstruct_table_;
