/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


display_constant: proc(pt,tree_level);

/*	Modified: 29 November 1979 by PCK to print tree level indented output */

dcl	pt ptr,
	tree_level fixed bin,
	fixed_bin fixed bin based,
	ioa_ entry options(variable);

%include symbol;

	call ioa_("^/^vxCONSTANT ^p",tree_level,pt -> symbol.initial);
	call ioa_("^vxvalue = ^w^/",tree_level,pt -> symbol.initial -> fixed_bin);

	end;
