/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

cxp12_: proc (base, exponent) returns (complex float bin (27));

dcl base complex float bin (27),
     exponent fixed bin (71),
     f complex float bin(63);

	f = base;
	return (f ** exponent);

     end cxp12_;
