/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

cxp2_: proc (base, exponent) returns (complex float bin (27));

dcl (base, exponent) complex float bin (27),
    (a, b) complex float bin (63);

	a = base;
	b = exponent;
	return (a ** b);

     end cxp2_;
