/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dcabs_: proc (number) returns (float bin (63));

dcl  number complex float bin (63),
	(abs, imag, real, sqrt) builtin,
    (r, x, y) float bin (63);

	r,
	x = abs (real (number));
	y = abs (imag (number));

	if y<x
	     then do;
	     x = y;
	     y = r;
	end;

	if y ^= 0.0e0
	     then do;
	     r = x/y;
	     y = sqrt (r*r+1.0e0)*y;
	end;

	return (y);

     end dcabs_;
