/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dcasin_: proc (number) returns (complex float bin (63));

dcl (number, a, b, c) complex float bin (63);
dcl	(imag, log, real, sqrt) builtin;

	real (a) = -imag (number);
	imag (a) = real (number);

	b = 1.0e0;

trig:	
	c = -1.0e0i;

ret:	
	return (log (sqrt (a*a+b)+a)*c);

dcacos_: entry (number) returns (complex float bin (63));

	a = number;
	b = -1.0e0;

	goto trig;

dcasinh_: entry (number) returns (complex float bin (63));

	b = 1.0e0;

hyper:	
	a = number;

	c = 1.0e0;

	goto ret;

dcacosh_: entry (number) returns (complex float bin (63));

	b = -1.0e0;
	goto hyper;

     end dcasin_;
