/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dcatan_: proc (number) returns (complex float bin (63));

dcl (number, a, b, c) complex float bin (63);
dcl	(imag, log, real) builtin;

dcl  code_ ext entry (fixed bin (17));

	b = 1.0e0i;
	c = 0.5e0i;

atans:	
	a = number;

	if a = b
	     then do;
err:	     
	     call code_ (32);
	     return ((real (a)+imag (a))*170141182.0e30);
	end;

	if a = -b then goto err;

	return (log ((b+a)/ (b-a))*c);

dcatanh_: entry (number) returns (complex float bin (63));

	b = 1.0e0;
	c = 0.5e0;

	goto atans;

     end dcatan_;
