/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dcfmp_: proc (a, b) returns (complex float bin (63));

dcl (a, b) complex float bin (63);

	return (a * b);

     end dcfmp_;
