/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dcxp12_: proc (base, exponent) returns (complex float bin (63));

dcl (base, a, f) complex float bin (63),
    (exponent, h, k, m) fixed bin (71);

dcl	(abs, divide, sign) builtin;

dcl  code_ ext entry (fixed bin (17));

	a = base;
	k = exponent;

	f = 1.0e0;
	if a = 0.0e0
	     then do;
	     if k>0 then goto clear;

	     call code_ (14-sign (k));
	     goto clear;
	end;

	if k = 0 then goto ret;
	m = abs (k);

loop:	
	h = divide(m,2,71,0);

	if h+h ^= m
	     then f = f*a;

	if h ^= 0
	     then do;
	     m = h;
	     a = a*a;
	     goto loop;
	end;

	if k<0
	     then f = 1.0e0/f;

ret:	
	return (f);

clear:	
	return (a);

     end dcxp12_;
