/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* calls to round_ removed 07/16/73 by A. Downing */
dsqrt_: procedure (number) returns (float binary (63));

/*      compute the square root of a double-precision floating-point number      */
declare  number float binary (63),
	sqrt builtin;
	return(sqrt(number));
	end;
