/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dtan_: procedure (number) returns (float binary (63));

/*     compute the tangent of a double-precision floating-point number     */
declare number float binary (63),
	(tan, tand) builtin;

	return(tan(number));

dtand_:	entry(number) returns(float bin(63));
	return(tand(number));
	end;
