/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

dxp1_: procedure (base, exponent) returns (float binary (63));

/*     compute double-precision floating-point base ** integer exponent     */
declare base float binary (63),
        exponent fixed binary (17);

	return(base ** exponent);
	end;
