/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

xp22_:	procedure (base, exponent) returns (float binary (27));

declare base float binary (27),
         f float binary (63),
         exponent fixed binary (71);

dcl  round builtin;

	f = base;
	return (round(f ** exponent, 28));
     end xp22_;
