/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* modified 07/16/73 by A. Downing to use round builtin */

xp2_: procedure (base, exponent) returns (float binary (27));

/*    compute single-precision floating-point base ** integer exponent     */
declare base float binary (27),
         exponent fixed binary (17);

	return(base ** exponent);
	end;
