/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* modified by A. Downing to use round builtin function 07/16/73 */

xp3_: procedure (base, exponent) returns (float binary (27));

/*    compute base ** exponent for single-precision floating-point numbers    */
declare base float binary (27),
         exponent float binary (27);

	return(base ** exponent);
	end;
