/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */




/****^  HISTORY COMMENTS:
  1) change(86-06-05,GJohnson), approve(86-06-05,MCR7387),
     audit(86-06-10,Martinson), install(86-07-11,MR12.0-1091):
     Correct error message documentation.
                                                   END HISTORY COMMENTS */


/* format: style4 */
hc_initlzr_auxl_init_: proc;
init: entry;					/* to avoid coordinated installation */

/* * This procedure is an interface between as_init_ and the procedures in
   * bound_hc_initlzr_auxl_. This bound segment contains procedures that are,
   * themselves, interfaces between the answering service and subsystems on the
   * system tape. The intention is to avoid, as much as possible, coordinated
   * hardcore and answering service installations, whenever new subsystems that are
   * to be initialized or used by the answering service are added to the system tape.
   *
   * Modification history:
   * Initial coding July 1977 by T. Casey
   * Modified April 1982 by E. N. Kittlitz. new initialization.
*/

/* DECLARATIONS */


/* External Entries */

dcl  hc_device_acct_$init entry (fixed bin (35));
dcl  lv_request_$init entry;
dcl  rcp_mount_timer_poll_$init_rcp_mount_timers entry;
dcl  sub_err_ entry () options (variable);
dcl  sys_log_$error_log entry options (variable);

/* External static */

dcl  error_table_$out_of_sequence fixed bin (35) ext static;

/* Automatic */
dcl  code fixed bin (35);


/* PROCEDURE */

	if ^sc_stat_$Multics_typed | sc_stat_$Go_typed then
	     call sub_err_ (error_table_$out_of_sequence, "hc_initlzr_auxl_init_", "s");
	call rcp_mount_timer_poll_$init_rcp_mount_timers;
	call lv_request_$init;
	call hc_device_acct_$init (code);
	if code ^= 0 then do;
	     call sys_log_$error_log (2, code, "hc_initlzr_auxl_init_", "From hc_device_acct_$init");
	     call sub_err_ (0, "hc_initlzr_auxl_init_", "s");
	end;
	return;

%include sc_stat_;
%page;
/* BEGIN MESSAGE DOCUMENTATION

   Message:
   hc_initlrz_auxl_init_: MESSAGE. From hc_device_acct_$init.

   S:	as (severity2)

   T:	$init

   M:	An error was detected while initializing device accounting.

   A:	$notify

   END MESSAGE DOCUMENTATION */

     end hc_initlzr_auxl_init_;

