/****^  ******************************************************
        *                                                    *
        * Copyright, (C) Honeywell Bull Inc., 1987           *
        *                                                    *
        * Copyright (c) 1972 by Massachusetts Institute of   *
        * Technology and Honeywell Information Systems, Inc. *
        *                                                    *
        ****************************************************** */



/****^  HISTORY COMMENTS:
  1) change(87-12-03,TLNguyen), approve(87-12-03,MCR7806),
     audit(87-12-10,Lippard), install(88-01-19,MR12.2-1015):
     - Remove the null builtin type from the source because it is not
       referenced anywhere within the source.
                                                   END HISTORY COMMENTS */


fst_help_: proc;

/* This procedure prints FAST info segments */
/* Written 3/76 by S.E. Barr */
/* MCR 4267 Change help with no args to print list of topics 12/19/79 S. Herbst */
/* Changed to call system help command 06/24/81 S. Herbst */

dcl  arg_ptr ptr;
dcl  arg_length fixed bin;
dcl  code fixed bin (35);
dcl  i fixed bin;
dcl  nargs fixed bin;				/* number of arguments for command */

dcl  arg char (arg_length) based (arg_ptr);

dcl  rtrim builtin;

dcl  directory char (168) aligned int static options (constant) init (">doc>ss>fast");

/* external */

dcl  cu_$arg_count entry (fixed bin);
dcl  cu_$arg_ptr entry (fixed bin, ptr, fixed bin, fixed bin (35));
dcl  com_err_ entry options (variable);
dcl  help entry options (variable);

	call cu_$arg_count (nargs);

	if nargs = 0 then call help (rtrim (directory) || ">topics");

	else do i = 1 to nargs;
	     call cu_$arg_ptr (i, arg_ptr, arg_length, code);
	     if code = 0 then call help (rtrim (directory) || ">" || arg);
	     else call com_err_ (code, "help");
	end;

	return;

     end fst_help_;
