/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1983 *
        *                                                         *
        *********************************************************** */

/* format: style4,inddcls,^ifthendo,^indproc,indcom,^indblkcom,declareind8,dclind4 */

iox_get_options: proc (arg_description, arg_option_array, arg_code);

     /* Removed from attach_name.pl1 4/83 by S. Krupp. */

     /* Automatic */

	dcl descrip char (length (arg_description)) var;
	dcl first_option_num fixed bin;
	dcl i fixed bin;
	dcl last_option_num fixed bin;
	dcl n_options fixed bin;
	dcl t fixed bin;
	dcl tn fixed bin;
	dcl ts fixed bin;
	dcl x fixed bin;
	dcl y fixed bin;

     /* Builtin */

	dcl (index, length, ltrim, rtrim, search, substr, verify) builtin;

     /* Parameter */

	dcl arg_code fixed bin (35);
	dcl arg_description char (*);
	dcl arg_option_array (*) char (*) var;

	arg_code = 0;
	arg_option_array (*) = "";

	descrip = ltrim (rtrim (arg_description));
	if descrip = ""
	then return;

	first_option_num = lbound (arg_option_array, 1);
	last_option_num = hbound (arg_option_array, 1);
	n_options = last_option_num - first_option_num + 1;
	if n_options <= 0
	then return;

	tn = first_option_num - 1;
	ts = 1;

more1:
	tn = tn + 1;
	i = verify (substr (descrip, ts), "	 ") - 1;
	if i < 0 then goto done1;
	ts = ts + i;

continue1:
	x = search (substr (descrip, ts), "	"" ") - 1;
	if x < 0 then goto done1;

	arg_option_array (tn) = arg_option_array (tn) || substr (descrip, ts, x);
	t = ts + x + 1;
	if substr (descrip, t - 1, 1) = """" then do;
pass1:
	     y = index (substr (descrip, t), """") - 1;

	     arg_option_array (tn) = arg_option_array (tn) || substr (descrip, t, y);
	     ts = t + y + 1;
	     if ts <= length (descrip)
	     then if substr (descrip, ts, 1) = """" then do;
		     arg_option_array (tn) = arg_option_array (tn) || """";
		     t = ts + 1;
		     x = 0;
		     goto pass1;
		end;
	     goto continue1;
	end;
	ts = t;
	goto more1;

done1:
	arg_option_array (tn) = arg_option_array (tn) || substr (descrip, ts, length (descrip) - ts + 1);

     end iox_get_options;
