/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


/* format: style4,delnl,insnl,ifthenstmt,indnoniterend */
ios_signal_:
     proc (strname, io_status);

/* This procedure signals io_error for ios_, since the code involved would have
   made ios_ too long for a fast command loop. */

/* Coded 8/73 by M. Weaver
   Last modified (date and reason):
   Aug 9, 1977 by S. Webber to make better use of static storage
   Oct 28,1977 by M. R. Jordan to make io_status fixed bin(35) rather than bit(72) aligned
*/

declare  strname char (32) aligned;
declare  io_status fixed bin (35);
declare  1 io_err_info aligned,			/* structure to passed to condition handler */
%include cond_info_structure;
	2 stream_name char (32), 2 status, 3 code fixed bin (35), 3 io_bits bit (36);

declare  (addr, null, size) builtin;

declare  signal_ entry (char (*), ptr, ptr);

/* fill in info structure */

	io_err_info.length = size (io_err_info);
	io_err_info.version = 1;
	string (io_err_info.action_flags) = "0"b;
	io_err_info.info_string = "An error has occurred using ios_.  Check stream names and status.";
	io_err_info.status_code = 0;
	io_err_info.stream_name = strname;
	io_err_info.status.code = io_status;
	io_err_info.status.io_bits = (36)"0"b;

	call signal_ ("io_error", null, addr (io_err_info));
						/* if returned to, try again */

	return;

     end ios_signal_;
