/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */
lm_salvage_lock_seg_:
	procedure (Code);

declare Code fixed bin (35);
declare dm_misc_util_$log entry options (variable);

	Code = 0;
	call dm_misc_util_$log (INFORM_SV, "lm_salvage_lock_seg_: Lock seg salvage requested.");
%include dm_log_sv_codes;

/* This is just a stub until check_lock_seg can be written */

	end lm_salvage_lock_seg_;
