/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


rcp_ioi_attach_:  procedure (arg_rcse_ptr, arg_ecode);

/*	This program is an internal RCP interface.
*	Created on 07/14/75 by Bill Silver.
*
*	This program will call IOI to attach the device specified in the RCSE.
*	If the attachment is successful an attachment message will be output
*	to the operator.  If the caller has specified a comment, a note message
*	will also be output to the operator.
*/

dcl	arg_ecode		fixed bin(35);	/* (O) Return error_table_ code. */
dcl	arg_rcse_ptr	ptr;		/* (I) Pointer to the RCSE that specifies the device. */

dcl	ecode		fixed bin(35);	/* error_table_ code. */

dcl	admin_gate_$ioi_attach	entry  (fixed bin, char(*) aligned, fixed bin(71), bit(1) aligned, fixed bin(35));
dcl	admin_gate_$syserr		entry  options(variable);
dcl	rcp_comment_		entry  (ptr);
/*	*/
%include rcp_com_seg;
/*	*/
	rcse_ptr = arg_rcse_ptr;		/* Copy argument. */

	call admin_gate_$ioi_attach (rcse.ioi_index, rcse.device_name, rcse.event_id, (rcse.flags.priv), ecode);
	arg_ecode = ecode;
	if   ecode ^= 0			/* If attachment failed don't output messages. */
	     then return;

	call admin_gate_$syserr (0, "RCP: Attached ^a for ^a", rcse.device_name, rcse.group_id);
	call rcp_comment_ (rcse_ptr);		/* Type out any user comment. */


/* BEGIN MESSAGE DOCUMENTATION

Message:
RCP: Attached DEVICE for PERSON.PROJ.T

S:	$info

T:	$run

M:	The device DEVICE has been attached by the user process.

A:	$ignore


END MESSAGE DOCUMENTATION */

	end  rcp_ioi_attach_;
