/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
x:   proc;
	call ioa_ ("^a", gfms_ascii_ ("212223"b3));
dcl  ioa_ entry() options(variable);
dcl  gfms_ascii_ entry (bit(*)) returns(char(*));
     end;
