/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/* record_stream_ program for handling sequential output openings */
rs_open_seq_out_:
     proc (iocb_ptr_arg);
	iocb_ptr = iocb_ptr_arg;
						/* set iocb entries for valid operations in this mode and return */
	write_record = write_record_rs;
	return;					/* end of opening routine */

write_record_rs:
     entry (iocb_ptr_arg, buff_ptr, buff_len, code);
	iocb_ptr = iocb_ptr_arg -> actual_iocb_ptr;
	rsab_ptr = attach_data_ptr;
	call iox_$put_chars (target_iocb_ptr, buff_ptr, buff_len, code);
	if length_n = 0				/* then append newline character */
	then call iox_$put_chars (target_iocb_ptr, addr (newline), 1, code);
	return;					/* end of sequential write routine */

/* declarations for  entire program */
	dcl     (iocb_ptr_arg, iocb_ptr)
				 ptr;
	dcl     code		 fixed bin (35);
%include rs_attach_block;
%include iocbv;
	dcl     buff_ptr		 ptr;
	dcl     buff_len		 fixed bin (21);
	dcl     buffer		 char (buff_len) based (buff_ptr);
	dcl     iox_$put_chars	 entry (ptr, ptr, fixed bin (21), fixed bin (35));
	dcl     newline		 char (1) static internal aligned init ("
");

     end rs_open_seq_out_;
