/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/* Print the -long control argument message.

   Written 17 March 1981 by M. N. Davidoff.
*/
/* format: style5 */
format_pl1_long_:
        procedure (P_temp_segs, P_source_ptr);

        declare P_temp_segs		(*) pointer;    /* (Input) array of temporary segment pointers */
        declare P_source_ptr		pointer;	      /* (Input) pointer to prevailing style control comment */

/* automatic */

        declare mode_differences	char (dimension (switch_mode_names, 1)
				* (length (switch_mode_not_indicator)
				+
				max (
				maxlength (
				switch_mode_names (
				lbound (switch_mode_names, 1))),
				maxlength (
				switch_antonym_names (
				lbound (switch_antonym_names, 1))))
				+ length (mode_separator))
				+ dimension (value_mode_names, 1)
				* (
				maxlength (
				value_mode_names (
				lbound (value_mode_names, 1)))
				+ length (null -> value_picture)
				+ length (mode_separator))) varying;
        declare mode_index		fixed binary;

/* based */

        declare value_picture		picture "(5)z9" based;

/* builtin */

        declare (convert, dimension, divide, hbound, lbound, length, ltrim, max,
	      maxlength, null, rtrim, size)
				builtin;

%include format_pl1_dcls;

/* program */

        temp_segs (*) = P_temp_segs (*);

        mode_differences = "";

        do mode_index = lbound (global.prevailing_style.switches, 1)
	  to hbound (global.prevailing_style.switches, 1);
	      if global.prevailing_style.switches (mode_index)
		^= global.command_line_style.switches (mode_index) then
		    do;
		    if mode_differences ^= "" then
			  mode_differences =
			      mode_differences || mode_separator;

		    if ^global.prevailing_style.switches (mode_index) then
			  if switch_antonym_names (mode_index) = "" then
				mode_differences =
				    mode_differences
				    || switch_mode_not_indicator
				    ||
				    rtrim (
				    switch_mode_names (mode_index));

			  else
				mode_differences =
				    mode_differences
				    ||
				    rtrim (
				    switch_antonym_names (mode_index));

		    else
			  mode_differences =
			      mode_differences
			      || rtrim (switch_mode_names (mode_index));
		    end;
        end;

        do mode_index = lbound (global.prevailing_style.values, 1)
	  to hbound (global.prevailing_style.values, 1);
	      if global.prevailing_style.values (mode_index)
		^= global.command_line_style.values (mode_index) then
		    do;
		    if mode_differences ^= "" then
			  mode_differences =
			      mode_differences || mode_separator;

		    mode_differences =
		        mode_differences
		        || rtrim (value_mode_names (mode_index))
		        ||
		        ltrim (
		        convert (value_picture,
		        global.prevailing_style.values (mode_index)));
		    end;
        end;

        call format_pl1_error_ (temp_segs (*), 1,
	  "The following prevailing style modes differ from the command line modes:
"
	  || mode_differences, P_source_ptr);
        end format_pl1_long_;
