/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

block_dcld_in: proc (P_sp) returns (ptr);

/* given P_sp, a ptr to a runtime_symbol node, return a pointer to the runtime_block node it was  declared in.
   This can't fail, given a valid symbol table

   Created:  22 Feb 79 James R. Davis
  Modified June 83 JMAthane to replace references to "runtime_symbol"structure
	by calls to runtime_symbol_info_ subroutine.
*/

	dcl     P_sp		 ptr parameter;
	dcl     sp		 ptr;		/* copy of P_sp */
	dcl     (addrel, fixed)	 builtin;
	sp = P_sp;
	do while (runtime_symbol_info_$level (sp) > 1);
	     sp = runtime_symbol_info_$father (sp);
	end;

/* now sp pts to level 0 or level 1 entry */

	return (runtime_symbol_info_$father (sp));

%include pascal_symbol_node;
%include runtime_symbol;
%include runtime_symbol_info_;
     end block_dcld_in;
