/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


tc_shutdown: proc;

/* Modified by E Stone on 5/74 to call deactivate_segs rather than deact_proc and to turn wait enable on */

dcl  aptptr ptr,					/* pointer to apt entry */
     sstp ptr,					/* pointer to SST */
     pds_astep ptr;					/* pointer to the aste for the pds of a process */

dcl  i fixed bin,					/* variable used to loop through APT */
     state fixed bin,				/* executation state of a process */
     size fixed bin,				/* number of entries in APT */
     length fixed bin;				/* number of words per apte */

dcl  sst_seg$ fixed bin ext,
     tc_data$apt_size fixed bin ext,
     tc_data$apt_entry_size fixed bin ext,
     tc_data$initializer_id ext bit (36) aligned,
     tc_data$system_shutdown fixed bin ext,
     tc_data$wait_enable fixed bin ext,
     tc_data$apt fixed bin ext;

dcl  deactivate_segs entry (ptr);

dcl (addr, addrel, bin) builtin;

% include apte;

/* 
   */

	tc_data$system_shutdown = 1;
	tc_data$wait_enable = 0;			/* make sure we are only process running */

	aptptr = addr (tc_data$apt);
	size = tc_data$apt_size;
	length = tc_data$apt_entry_size;
	sstp = addr (sst_seg$);

/* destroy all processes except initializer and idle processes */

	do i = 1 to size;
	     state = bin(aptptr -> apte.flags.state, 18);
	     if state = 0 | state = 5
		then go to end_apt_loop;
	     if aptptr -> apte.processid = tc_data$initializer_id
		then go to end_apt_loop;
	     if aptptr -> apte.flags.idle
		| aptptr -> apte.flags.hproc
		then go to end_apt_loop;
	     pds_astep = ptr (sstp, aptptr -> apte.asteps.pds);
	     call deactivate_segs (pds_astep);

end_apt_loop:  
	     aptptr = addrel (aptptr, length);
	end;

/* 	return;				/* All done */

     end tc_shutdown;
