/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1983 *
        *                                                         *
        *********************************************************** */
/* CV_FSDISK_ERROR_ -- converts fsdisk_error_message to error_table_ */
/* format: style2 */

cv_fsdisk_error_:
     procedure (Code);

	declare Code		 fixed binary (35);

/* format: off */
	declare et_codes		 (1:9) fixed bin (35)
                  init (		 error_table_$fsdisk_pvtx_oob,
				 error_table_$fsdisk_drive_in_use,
				 error_table_$fsdisk_not_salv,
				 error_table_$fsdisk_old_label,
				 error_table_$fsdisk_old_vtoc,
				 0,
				 error_table_$fsdisk_phydev_err,
				 error_table_$fsdisk_not_storage,
				 error_table_$fsdisk_not_ready);
/* format: on */

	declare (
	        error_table_$fsdisk_pvtx_oob,
	        error_table_$fsdisk_drive_in_use,
	        error_table_$fsdisk_not_salv,
	        error_table_$fsdisk_old_label,
	        error_table_$fsdisk_old_vtoc,
	        error_table_$fsdisk_phydev_err,
	        error_table_$fsdisk_not_storage,
	        error_table_$fsdisk_not_ready
	        )			 fixed bin (35) external static;
	if Code < 10 & Code > 0
	then Code = et_codes (Code);
	return;
     end cv_fsdisk_error_;


