/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


get_external_variable_: proc (vname, vptr, vsize, vdesc_ptr, code);


/*

This procedure will locate the specified external variable and return 
information about the variable.  The information returned includes the 
location and size (in words) of the data and an optional descriptor pointer.

Note:  At present the descriptor is not available for external variables
and the vdesc_ptr will always be null ().

Written 5/6/80 by Michael R. Jordan

Modified: 82-11-19, T Oke to change vsize from fb (19) to fb (24) for VLA.
*/

/*		PARAMETERS		*/


dcl  vname char (*);				/* the variable name (Input) */
dcl  vptr ptr;					/* pointer to the data (Output) */
dcl  vsize fixed bin (24);				/* size (in words) of the data (Output) */
dcl  vdesc_ptr ptr;					/* location of descriptor (Output) */
dcl  code fixed bin (35);				/* a standard error code */


/*		CONSTANTS			*/


/*		AUTOMATIC			*/


dcl  node_ptr ptr;					/* pointer to variable node */


/*		BASED			*/


/*		EXTERNAL ENTRIES		*/


dcl  set_ext_variable_$locate entry (char (*), ptr, ptr, fixed bin (35));

/*		ERROR CODES		*/


/*		BUILTINS			*/

dcl  null builtin;
dcl  stackbaseptr builtin;

	vptr = null ();				/* initialize vptr */
	vsize = 0;				/* and vsize */
	vdesc_ptr = null ();			/* oh, and don't forget the descriptor ptr */
	code = 0;					/* no error yet */

	call set_ext_variable_$locate (vname, stackbaseptr (), node_ptr, code);
	if code ^= 0
	then return;

	vptr = node_ptr -> variable_node.vbl_ptr;	/* return location */
	vsize = node_ptr -> variable_node.vbl_size;	/* and size */

	return;					/* and thats all we can do */

%include system_link_names;


end get_external_variable_;
