dcl (	neg		init(37),
	negl		init(38),
	fneg		init(39),

	clear_aq		init(58),
	clear_q		init(59),
	blank_q		init(135),

	als		init(134),
	lrl		init(62),
	lls		init(63)) fixed bin(15) internal static options(constant);
