/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
/* BEGIN INCLUDE FILE ... _imft_get_channel_names.incl.pl1 */
/* Created:  July 1982 by G. Palter */

/* Data structure used by imft_io_ to return names of channels used for data transmission */

dcl  1 get_channel_names aligned based (get_channel_names_ptr),
       2 version character (8),
       2 input_channel character (32) unaligned,
       2 output_channel character (32) unaligned;

dcl  get_channel_names_ptr pointer;

dcl  GET_CHANNEL_NAMES_VERSION_1 character (8) static options (constant) initial ("igcn_001");

/* END INCLUDE FILE ... _imft_get_channel_names.incl.pl1 */
