/* BEGIN INCLUDE FILE ... abs_message_format.incl.pl1 */

/* Requires user_attributes.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(86-03-01,Gilcrease), approve(86-03-27,MCR7370),
     audit(86-06-23,Lippard), install(86-06-30,MR12.0-1082):
     Modified 740723 by PG to add AIM info
     Modified April 1978 by T. Casey to add much new info and change version number to 4
     Modified November 1978 by T. Casey to add secondary_ok
     Modified June 1981 by T. Casey for MR9.0 to make max_cpu_time fixed bin (35) (was fixed bin (17) aligned)
  2) change(86-03-27,Gilcrease), approve(86-03-27,MCR7370),
     audit(86-06-23,Lippard), install(86-06-30,MR12.0-1082):
     Add truncate_absout and restarted bits for -truncate absout. SCP 6297.
  3) change(86-12-08,GDixon), approve(87-07-16,MCR7741),
     audit(87-07-16,Brunelle), install(87-08-04,MR12.1-1056):
     Changed structure under request.abs_attributes to use like structure in
     abs_attributes.incl.pl1.  This allows the same attributes to be used
     in pit.incl.pl1 and user_table_entry.incl.pl1 as well as this include
     file.
  4) change(87-11-11,Parisek), approve(88-02-11,MCR7849),
     audit(88-03-22,Lippard), install(88-07-13,MR12.2-1047):
     Added the version 6 elements: home_dir, init_proc, initial_ring,
     len_homedir, len_initproc. SCP6367
  5) change(88-07-29,Parisek), approve(88-07-29,PBF7849),
     audit(88-07-29,Lippard), install(88-08-01,MR12.2-1072):
     Place the elements "home_dir", and "init_proc" before the varying length
     element "args" in the stucture.  Since "args" length can grow varyingly,
     it should remain at the bottom of the structure.
                                                   END HISTORY COMMENTS */


dcl  abs_message_version_6 fixed bin int static options (constant) init (6);

dcl 1 request aligned based (reqp),			/* format of absentee request */
						/* the pointer, reqp, must be declared in the including program */
    2 request_header like queue_msg_hdr,		/* 62 words */
    2 request_version fixed bin,			/* identification of version of abs request */
    2 len_name fixed bin,				/* length of name */
    2 arg_count fixed bin,				/* number of arguments to input segment */
    2 len_args fixed bin,				/* length of string containing arguments to input segment */
    2 len_output fixed bin,				/* length of output pathname */
    2 len_proxy fixed bin,				/* length of proxy name */
    2 len_resource fixed bin,				/* length of resource description */
    2 len_sender fixed bin,				/* length of sender */
    2 len_comment fixed bin,				/* length of comment */
    2 len_vpad fixed bin,				/* length of spare variable length string */
    2 initial_ring fixed bin,				/* initial ring number request */
    2 len_homedir fixed bin,				/* length of home_dir */
    2 len_initproc fixed bin,				/* length of login responder string */
    2 request_pad (5) fixed bin,			/* leave room for stuff we did not think of this time */
    2 deferred_time fixed bin (71),			/* clock time until which this request should be held + not run */
    2 max_cpu_time fixed bin (35),			/* user given cpu limit in seconds */
    2 requested_authorization bit (72),			/* request should be run at this authorization */
    2 abs_attributes aligned like user_abs_attributes,	/* include user_abs_attributes.incl.pl1 */
    2 abs_status_flags,				/* bits giving reasons for job's status */
      3 operator_deferred_until_time bit (1) unaligned,
      3 operator_deferred_indefinitely bit (1) unaligned,
      3 resources_unavailable bit (1) unaligned,
      3 cpu_time_limit bit (1) unaligned,
      3 queue_limit bit (1) unaligned,
      3 user_limit bit (1) unaligned,
      3 load_control bit (1) unaligned,
      3 status_pad bit (29) unaligned,
 
    2 name char (0 refer (request.len_name)) aligned,	/* personal name of requestor */
    2 output_file char (0 refer (request.len_output)) aligned, /* absolute pathname of output file */
    2 proxy_name char (0 refer (request.len_proxy)) aligned, /* name of user for whom submitted */
    2 resource char (0 refer (request.len_resource)) aligned, /* resource description */
    2 sender char (0 refer (request.len_sender)) aligned,	/* name of RJE station or other sender */
    2 comment char (0 refer (request.len_comment)) aligned, /* message to operator, or anything else user puts in it */
    2 home_dir char (0 refer (request.len_homedir)) aligned,/* initial home dir */
    2 init_proc char (0 refer (request.len_initproc)) aligned,
						/* name of login responder */
    2 vpad char (0 refer (request.len_vpad)) aligned,	/* for the thing we didn't think of this time */
    2 arg_lengths (0 refer (request.arg_count)) fixed bin,	/* array of argument lengths */
    2 args char (0 refer (request.len_args)) aligned;	/* string containing arguments to control segment */

/* END INCLUDE FILE ... abs_message_format.incl.pl1 */
