/* Begin include file abs_request_dcls.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(86-02-19,Cox), approve(86-05-12,MCR7390), audit(86-05-12,Newcomb),
     install(86-06-30,MR12.0-1082):
     Initially written.
  2) change(86-06-20,Gilcrease), approve(86-06-20,MCR7390),
     audit(86-06-25,Lippard), install(86-06-30,MR12.0-1082):
               Make abs_request_info.attributes.truncate_absout known,
               for version 2 of the include file,
               to indicate -truncate .absout is implemented SCR6297.
  3) change(86-10-14,Lippard), approve(85-12-30,MCR7326),
     audit(86-10-27,GDixon), install(86-10-28,MR12.0-1200):
     Add comments describing each field.
  4) change(87-11-11,Parisek), approve(88-02-11,MCR7849),
     audit(88-05-04,Lippard), install(88-07-13,MR12.2-1047):
     Added the request_info version 3 elements init_proc, subsystem_name,
     home_dir, initial_ring, no_start_up.  Added the return_info version
     3 elements: error_msg, and abs_pathname. SCP6367.
  5) change(88-04-29,Parisek), approve(88-04-29,MCR7878),
     audit(88-05-04,Lippard), install(88-07-13,MR12.2-1047):
     A. Remove the must_use_search bit element.
     B. Replace the input_segment_entryname element with an unused pad
        field, as the input entryname will be located by enter_abs_request_
        and placed into the request header as request.request_header.ename.
                                                   END HISTORY COMMENTS */

/* format: style2,^inddcls,ifthenstmt,ifthendo,^indnoniterdo,^inditerdo,ind3,idind32 */

dcl     1 abs_request_info		structure aligned based (abs_request_info_ptr),
	2 version			char (8) aligned,	/* version number of this structure */
	2 resource_length		fixed bin,	/* length of resource string */
	2 comment_length		fixed bin,	/* length of comment string */
	2 max_arg_length		fixed bin,	/* length of longest arg */
	2 arg_count		fixed bin,	/* number of args */
	2 proxy_personid		char (22) aligned,	/* person ID of proxy user */
	2 proxy_projectid		char (9) aligned,	/* project ID of proxy user */
	2 queue			char (4) aligned,	/* absentee queue */
	2 deferred_time		fixed bin (71),	/* time at which absentee is to run */
	2 max_cpu_time		fixed bin (35),	/* max CPU time for absentee process */
	2 requested_authorization	bit (72),		/* authorization at which absentee is to be logged in */
	2 input_segment_dirname	char (168) unaligned,/* pathname of absin segment */
	2 pad                         (8) fixed bin,	/* reserved */
	2 output_segment_dirname	char (168) unaligned,/* pathname of absout segment */
	2 output_segment_entryname	char (32) unaligned,
	2 attributes		aligned,
	  3 restartable		bit (1) unaligned,	/* True if this absentee may be restarted */
	  3 user_deferred_indefinitely
				bit (1) unaligned,	/* True if this absentee is to be deferred indefinitely */
	  3 secondary_ok		bit (1) unaligned,	/* True if it's OK for foreground job to be logged in without
						 primary status */
	  3 truncate_absout		bit (1) unaligned,	/* True if absout is to be truncated before absentee runs */
	  3 notify		bit (1) unaligned,	/* True if submitter is to be notified when job starts and ends */
            3 no_start_up               bit (1) unaligned,
	  3 attributes_mbz		bit (30) unaligned,	/* must be zero */
	2 sender			char (32),	/* submitter of absentee */
          2 initial_ring                fixed bin,	/* initial ring requested */
          2 home_dir                    char (64),	/* user's home dir */
          2 init_proc                   char (64),	/* login responder name */

	2 resource		char (arqi_resource_length refer (abs_request_info.resource_length)),
						/* any RCP resources required by the job */
	2 comment			char (arqi_comment_length refer (abs_request_info.comment_length)),
						/* comment field */
	2 arguments		dimension (arqi_arg_count refer (abs_request_info.arg_count))
				char (arqi_max_arg_length refer (abs_request_info.max_arg_length)) varying;
						/* additional arguments to absentee process */
	

dcl     1 abs_return_info		structure aligned based (abs_return_info_ptr),
	2 version			char (8) aligned,		/* version of this structure */
	2 request_id		fixed bin (71),		/* request ID of the absentee job:
								0 if not entered,
								> 0 if entered */
	2 queue			char (4) aligned,		/* queue the job is entered in */
	2 queue_requests_count	fixed bin (17),		/* total number of requests in the queue */
          2 error_msg                   char (256),	          /* Additional error message info */
          2 abs_pathname                char (168);                   /* Absolute absin pathname found via ec search paths */

dcl     (abs_request_info_ptr, abs_return_info_ptr)
				ptr automatic;

dcl     (
        ABSENTEE_REQUEST_INFO_VERSION_3 initial ("arqi_003"),
        ABSENTEE_RETURN_INFO_VERSION_3	initial ("arti_003")
        )				char (8) internal static options (constant);

/**** The following fields should be set before abs_request_info is allocated */
dcl     arqi_resource_length		fixed bin;
dcl     arqi_comment_length		fixed bin;
dcl     arqi_max_arg_length		fixed bin;
dcl     arqi_arg_count		fixed bin;

dcl     (
        BACKGROUND_QUEUE		dimension (0:4) init ("0", "1", "2", "3", "4"),
        FOREGROUND_QUEUE		init ("fg"),
        DEFAULT_QUEUE		init ("dft")
        )				char (4) aligned internal static options (constant);

/* End include file abs_request_dcls.incl.pl1 */
