/*  BEGIN INCLUDE FILE:  ansi_hdr1.incl.pl1                 */
/*  Modified by J. A. Bush 11/07/82 for use by mtape_ */

/* format: style4 */

dcl  ansi_hdr1P ptr;				/* pointer on which ansi_hdr1 structure is based */

dcl  1 ansi_hdr1 unaligned based (ansi_hdr1P),
       2 label_id char (4),				/* HDR1/EOF1/EOV1 */
       2 file_id char (17),				/* file identifier */
       2 set_id char (6),				/* file-set identifier */
       2 section char (4),				/* file section number */
       2 sequence char (4),				/* file sequence number (within file set) */
       2 generation char (4),				/* file generation number */
       2 version char (2),				/* generation version number */
       2 creation char (6),				/* file creation date - Julian form (" yyddd") */
       2 expiration char (6),				/* file expiration date - Julian form */
       2 access char (1),				/* file accessibility code */
       2 blkcnt char (6),				/* used by EOF1/EOV1, must be "000000" for HDR1 */
       2 system char (13),				/* system code = "MULTICS ANSI2" for mtape_ */
       2 reserved char (7);				/* must be spaces */


dcl  ANSI_L1_ID (3) char (4) int static options (constant) init
	("HDR1", "EOV1", "EOF1");
dcl  (ANSI_HDR1 init (1),
     ANSI_EOV1 init (2),
     ANSI_EOF1 init (3)) fixed bin int static options (constant);
dcl  ANSI_SYS_CODE char (13) int static options (constant) init ("MULTICS ANSI2");

/*  END INCLUDE FILE:  ansi_hdr1.incl.pl1                   */
