/* BEGIN INCLUDE FILE archive_header.incl.pl1 */


dcl 1 archive_header aligned based,
    2 header_begin char (8),
    2 pad1 char (4),
    2 name char (32),
    2 timeup char (16),
    2 mode char (4),
    2 time char (16),
    2 pad char (4),
    2 bit_count char (8),
    2 header_end char (8);

/* END INCLUDE archive_header.incl.pl1 */
