/* BEGIN INCLUDE FILE ... as_data_.incl.pl1 ... */

/* format: style4 */

/* This file must be kept in sync with as_data_.alm */

/****^  HISTORY COMMENTS:
  1) change(86-09-21,Beattie), approve(86-09-22,MCR7542),
     audit(86-10-31,Brunelle), install(86-11-12,MR12.0-1211):
     Remove references to the 963 and 029 preaccess commands and remove support
     for ARDS, 202_ETX, 2741 and 1050 in system interfaces.
  2) change(86-09-25,Swenson), approve(87-07-20,MCR7737),
     audit(87-07-20,GDixon), install(87-08-04,MR12.1-1056):
     Add references to as_data_ entrypoints added for Login Server.
  3) change(87-03-03,Brunelle), approve(87-07-20,MCR7697),
     audit(87-07-20,GDixon), install(87-08-04,MR12.1-1056):
     Added new user signal field of inacrcvd (14) to handle inactivity response
     from user.
                                                   END HISTORY COMMENTS */

dcl  as_data_$BS char (1) aligned ext static;		/* BACKSPACE character */
dcl  as_data_$CR char (1) aligned ext static;		/* CARRIAGE RETURN character */
dcl  as_data_$abs_dim char (32) ext static;		/* absentee DIM */
dcl  as_data_$acct_update_priority fixed bin ext static;	/* accounting update IPC priority */
dcl  as_data_$acsdir char (168) ext static;		/* Access Control Segment directory */
dcl  as_data_$ansp ptr ext static;			/* answer_table */
dcl  as_data_$as_procid bit (36) aligned ext static;	/* Answering Service process id */
dcl  as_data_$as_ring fixed bin (3) ext static;		/* AS operating ring */
dcl  as_data_$as_tty char (6);			/* AS master tty channel */
dcl  as_data_$asmtp ptr ext static;			/* AS meter table */
dcl  as_data_$autp ptr ext static;			/* absentee_user_table */
dcl  as_data_$buzzardp ptr ext static;			/* dpg_ list of buteo processes */
dcl  as_data_$cdtp ptr ext static;			/* CDT */
dcl  as_data_$default_weight fixed bin (35) ext;		/* default user process load control weight */
dcl  as_data_$devtabp ptr ext static;			/* device_table */
dcl  as_data_$dft_user_ring fixed bin (3) ext static;	/* default user ring */
dcl  as_data_$dutp ptr ext static;			/* daemon_user_table */
dcl  as_data_$g115_dim char (32) ext static;
dcl  as_data_$lct_initialized bit (1) aligned ext static;	/* LCT allocated in ring 0 */
dcl  as_data_$lct_size fixed bin ext static;		/* CDT tty channels + spares */
dcl  as_data_$max_user_ring fixed bin (3) ext static;	/* maximum user ring */
dcl  as_data_$mgtp ptr ext static;			/* master group table */
dcl  as_data_$mrd_dim char (32) ext static;		/* daemon's message routing DIM */
dcl  as_data_$ntty_dim char (32) ext static;		/* network connection DIM */
dcl  as_data_$pdtdir char (168) ext static;		/* PDT directory */
dcl  as_data_$pit_ptr ptr ext static;			/* pit_temp_ */
dcl  as_data_$rcpdir char (168) ext static;		/* RCP directory */
dcl  as_data_$request_priority fixed bin ext static;
dcl  as_data_$rs_ptrs (0:9) ptr ext static;		/* rate_structures */
dcl  as_data_$rtdtp ptr ext static;			/* RTDT */
dcl  as_data_$sat_htp ptr ext static;			/* SAT hash table */
dcl  as_data_$satp ptr ext static;			/* SAT */
dcl  as_data_$suffix (0:9) char (2) unaligned ext static;
dcl  as_data_$sysdir char (168) ext static;		/* system control directory */
dcl  as_data_$teens_suffix (10:19) char (2) unaligned ext static;
dcl  as_data_$terminet_tabs_string char (144) varying ext static;
dcl  as_data_$tty_dim char (32) ext static;		/* standard interactive DIM */
dcl  as_data_$update_priority fixed bin ext static;	/* ??? */
dcl  as_data_$version char (8) ext static;		/* AS version */
dcl  as_data_$whoptr ptr ext static;			/* whotab */

dcl  1 as_data_$login_args aligned ext static,		/* control arguments for login */
       2 n_login_args fixed bin,
       2 pad fixed bin,
       2 login_args (55 /* as_data_$login_args.n_login_args */) char (24) unaligned;

dcl  1 as_data_$signal_types ext static aligned,		/* IPC process control signals */
       2 n_signals fixed bin,
       2 pad fixed bin,
       2 signals (14 /* as_data_$signal_types.n_signals */) char (8) unaligned;

dcl  1 as_data_$system_signal_types ext static aligned,	/* IPC process control signals */
       2 n_system_signals fixed bin,
       2 pad fixed bin,
       2 system_signals (10 /* as_data_$system_signal_types.n_system_signals */) char (8) unaligned;

dcl  as_data_$login_words fixed bin ext static aligned,
						/* interactive login words */
     1 as_data_login_words aligned based (addr (as_data_$login_words)),
       2 n_words fixed bin,
       2 pad fixed bin,
       2 words (0 refer (as_data_login_words.n_words)) char (16) unaligned;

dcl  as_data_$debug_flag bit (1) aligned external static;
dcl  as_data_$ls_request_server_info_ptr ptr external static;
dcl  as_data_$ls_message_buffer_cur_lth fixed bin (18) external static;
dcl  as_data_$ls_message_buffer_max_lth fixed bin (18) external static;
dcl  as_data_$ls_message_buffer_ptr ptr external static;

/* END INCLUDE FILE ... as_data_.incl.pl1 ... */
