/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1985 *
   *                                                         *
   *********************************************************** */
/* Begin include file asum_data_.incl.pl1 */
/* Definitions in asum_data_ (as_user_message_data_) BIM 1985-01-17 */
/* format: style3 */

declare	asum_data_$acl_entries
			bit (36) aligned ext;	/* base acl array here */
declare	asum_data_$db_dir	char (168) ext;
declare	asum_data_$db_multiclass
			bit (1) aligned ext;
declare	asum_data_$n_acl_entries
			fixed bin ext;
declare	asum_data_$db_cbi	bit (36) aligned ext;	/* No need to declare the whole structure here */
declare	asum_data_$db_dir_cbi
			bit (36) aligned ext;	/* No need to declare the whole structure here */
declare	asum_data_$db_dir_rb
			(2) fixed bin (3) ext;
declare	asum_data_$db_rb	(3) fixed bin (3) ext;
declare	asum_data_$db_locked
			bit (1) aligned ext;
declare	asum_data_$process_info_ptr
			pointer static ext;
declare	asum_data_$system_info_ptr
			pointer static ext;
declare	asum_data_$entry_ring
			fixed bin (3) static ext;
declare	asum_data_$lock_id	bit (36) aligned ext;
declare	asum_data_$process_id
			bit (36) aligned ext;

/* End include file asum_data_.incl.pl1 */
