/* BEGIN INCLUDE FILE ... audit_names.incl.pl1 */

dcl  audit_names (21) char (12) varying internal static initial (
     "seg_init", "dir_init", "mc_seg_init", "no_access",
     "ipr_fault", "acv_mode", "acv_ring", "no_wakeup",
     "sys_priv", "ssa_ops", "no_attach",
     (7)(1)"",
     "no_mount", "mseg", "comm");

dcl  unused_audit_flags bit (36) aligned internal static
     initial ("000000000001111111000111111111111111"b);

/* END INCLUDE FILE ... audit_names.incl.pl1 */
