/* BEGIN INCLUDE FILE ... author_dcl.incl.pl1 */

/* This include file declares the "author" substructure
   in a form suitable for using the PL/I "like" attribute.

   Written 750304 by PG
*/

dcl 1 author_dcl aligned based,
%include author;
    2 pad;

/* END INCLUDE FILE ... author_dcl.incl.pl1 */
