dcl (	numeric_scalar_param	init(2),
	string_scalar_param		init(3),
	numeric_list_param		init(4),
	string_list_param		init(5),
	numeric_table_param		init(6),
	string_table_param		init(7),
	numeric_function_param	init(8),
	string_function_param	init(9),
	file_param		init(10)) fixed bin static;
