/* BEGIN include file bce_partition_layout.incl.pl1
This is the layout of the bce partition for bootload Multics.
Written September 1983 by Keith Loepere. */

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

dcl  BCE_PART_LTH		        init (2200) fixed bin internal static options (constant);  /* This is the default value. */
dcl  SAVED_IMAGE_RECORDX	        init (0) fixed bin internal static options (constant);
dcl  CRASH_HANDLER_RECORDX	        init (512) fixed bin internal static options (constant);
dcl  BCE_PAGING_AREA_RECORDX	        init (1024) fixed bin internal static options (constant);
dcl  BCE_PAGING_AREA_LTH	        init (128) fixed bin internal static options (constant);
dcl  MST_AREA_RECORDX	        init (1152) fixed bin internal static options (constant);

/* END include file bce_partition_layout.incl.pl1 */
