/****  START OF:	bindext.incl.pl1			 *  *  *  *  *  */


/****^  HISTORY COMMENTS:
  1) change(86-06-14,Elhard), approve(86-06-14,MCR7198),
     audit(86-06-30,Weaver):
     Added declarations for bx_$caller and bx_$temp_bsegp.
                                                   END HISTORY COMMENTS */

/* DECLARATION OF BINDER'S MAIN DATABASE */

/* include file bindext.incl.pl1 */

/* Modified Sept 1978 by David Spector for using "get_temp_segment_" in temp_mgr_ */
/* Modified Dec 1978 by David Spector for making repatch table automatically extensible */
/* Modified 01/15/81 W. Olin Sibert for new options */

declare  bx_$vers_name char (168) aligned external;	/* ASCII version name, in ACC form */
declare  bx_$vers_number fixed bin external;		/* integer part of version number */
declare  bx_$size fixed bin external;			/* size of main data base, for resetting */
declare  bx_$snt_limit fixed bin external;		/* preset limit for segname table */
declare  bx_$oddname_limit fixed bin external;		/* preset limit for oddname table */
declare  bx_$stringmap_limit fixed bin external;		/* preset limit for stringmap table */
declare  bx_$addname_limit fixed bin external;		/* preset limit for addname table */
declare  bx_$area_begin fixed bin (18) external;		/* beginning of main data base */
declare  bx_$ctp pointer external;			/* pointer to component table */
declare  bx_$freep pointer external;			/* pointer to beginning of free area */
declare  bx_$isp pointer external;			/* pointer to first insym table */
declare  bx_$inpp pointer external;			/* pointer to binder's input structure */
declare  bx_$bsegp pointer external;			/* pointer to base of new object segment */
declare  bx_$temp pointer external;			/* pointer to threaded list of temp segments */
declare  bx_$optp pointer external;			/* pointer to options table */
declare  bx_$odnp pointer external;			/* pointer to oddname table */
declare  bx_$first_rptp pointer external;		/* pointer to first chunk of repatch table */
declare  bx_$last_rptp pointer external;		/* pointer to current chunk of threaded repatch table */
declare  bx_$adnp pointer external;			/* pointer to addname table */
declare  bx_$bindmap_def pointer external;		/* pointer to new object's "bind_map" definition */
declare  bx_$bdefp pointer external;			/* pointer to new object's definition section */
declare  bx_$bstatp pointer external;			/* pointer to new object's static section */
declare  bx_$blnkp pointer external;			/* pointer to new object's linkage section */
declare  bx_$bsymp pointer external;			/* pointer to new object's symbol section */
declare  bx_$sntp pointer external;			/* pointer to segname table */
declare  bx_$tdefp pointer external;			/* pointer to temporary new definition section */
declare  bx_$tintp pointer external;			/* pointer to temporary new internal static */
declare  bx_$tlinkp pointer external;			/* pointer to temporary new linkage section */
declare  bx_$strmp pointer external;			/*  pointer to stringmap table */
declare  bx_$n_firstrefs fixed bin external;		/* count of components with firstref traps */
declare  bx_$bound_segname char (32) aligned external;	/* name of new bound object */
declare  bx_$fatal_error fixed bin external;		/* 1 -> fatal error was detected */
declare  bx_$bseg_acinfop pointer external;		/* new object's acinfop for "tssi_" */
declare  bx_$bseg_bitcount fixed bin (24) external;	/* new object's bitcount */
declare  bx_$o_lng fixed bin (19) external;		/* length of new bound object */
declare  bx_$t_lng fixed bin (18) external;		/* length of new text section */
declare  bx_$d_lng fixed bin (18) external;		/* length of new definition section */
declare  bx_$i_lng fixed bin external;			/* length of new static section */
declare  bx_$l_lng fixed bin external;			/* length of new linkage section */
declare  bx_$s_lng fixed bin (18) external;		/* length of new symbol section */
declare  bx_$addname fixed bin external;		/* 1 -> addname option specified */
declare  bx_$debug fixed bin external;			/* 1 -> debug option was specified */
declare  bx_$brief fixed bin external;			/* 1 -> brief option was specified */
declare  bx_$force_order fixed bin external;		/* 1 -> -force_order specified on command line */
declare  bx_$has_sep_stat fixed bin external;		/* 1 -> a comp has nonzero sep static */
declare  bx_$has_comb_stat fixed bin external;		/* 1 -> a comp has nonzero combined static */
declare  bx_$bound_sep_stat fixed bin external;		/* 1 -> bound segment has separate static */
declare  bx_$perprocess_static fixed bin external;	/* 1 -> bound segment has perprocess static switch on */
declare  bx_$standard fixed bin external;		/* 1 -> bound seg is in standard format */
declare  bx_$bproc fixed bin external;			/* 1 -> at least one component is a procedure */
declare  bx_$textlng fixed bin (18) external;		/* length of new pure text portion */
declare  bx_$curdeflng fixed bin (18) external;		/* current length of new definition section */
declare  bx_$tintlng fixed bin external;		/* current length of new internal static */
declare  bx_$maxlinklng fixed bin external;		/* maximum size linkage section may attain */
declare  bx_$maxdeflng fixed bin (18) external;		/* maximum size definition section may attain */
declare  bx_$tlinklng fixed bin external;		/* current size of linkage section */
declare  bx_$ncomp fixed bin external;			/* number of component objects to be bound */
declare  bx_$v_lng fixed bin external;			/* length of version name string */
declare  bx_$n_lng fixed bin external;			/* length of bound segment name string */
declare  bx_$nsymdefs fixed bin external;		/* count of non-null symbol definitions */
declare  bx_$nsegdefs fixed bin external;		/* count of non-null segment name definitions */
declare  bx_$temp_bsegp ptr external;			/* pointer to the temporary bound seg in the process dir */
declare  bx_$caller char (32) aligned external;		/* name of the caller of bind_ for error messages */

/****  END OF:	bindext.incl.pl1			 *  *  *  *  *  */
