/* BEGIN INCLUDE FILE... cmcs_vfile_rs.incl.pl1 */

/* This COBOL MCS include file is used to reference records by their
   vfile_ descriptors. It is used mainly in the maintenance of
   message status lists. */

/* Bob May, 6/30/77 */

dcl  vfile_rs_version fixed bin int static options (constant) init (1);

dcl  vfile_rs_ptr ptr;

dcl 1 vfile_rs aligned based (vfile_rs_ptr),
    2 version fixed bin,				/* currently must be set to 1 */
    2 flags,
     (3 lock_sw bit (1),				/* "1"b */
      3 unlock_sw bit (1),				/* "1"b */
      3 create_sw bit (1),				/* "0"b */
						/* switch separator */
      3 locate_sw bit (1),				/* "0"b for current_rec, "1"b to use descriptor */
      3 filler bit (32)) unaligned,			/* (32) "0"b */
    2 rec_len fixed bin (21),
    2 max_rec_len fixed bin (21),
    2 rec_ptr ptr,
    2 descr like vfile_descr,				/* process INdependent addressing */
    2 filler fixed bin;				/* 0 */

dcl 1 vfile_descr,					/* process INdependent addressing */
   (2 comp_no fixed bin (17),				/* component of MSF */
    2 comp_offset bit (18)) unaligned;			/* offset of record in component */

/* END INCLUDE FILE... cmcs_vfile_rs.incl.pl1 */
