/*
	call cobol_call_op(op_num,tagno);

	call cobol_call_op(op_num,tagno,tag1);

	call cobol_call_op$get_op(operator_struc_ptr);

		declare (tagno,tag1) fixed bin , op_num fixed bin , operator_struc_ptr ptr;

*/
