
/* BEGIN INCLUDE FILE ...   cobol_repl_unique.incl.pl1 */

/*  DECLARATION OF OFFSETS OF THE VARIOUS ENTRIES OF CERTAIN COBOL RECORD TYPES  */

/*  THIS IS THE 645 VERSION  */

dcl numeric_literal_size fixed bin(15) int static init(36);
dcl alphanumeric_literal_size fixed bin(15) int static init(24);
dcl numeric_extension_offset fixed bin(15) int static init(52);


/*  DECLARATION OF FIXED LENGTH PORTIONS OF CONDITION NAME INITIAL VALUE STRUCTURES  */

dcl numeric_extension_size fixed bin(15) int static init(20);
dcl alpha_extension_size fixed bin(15) int static init(8);


/*  DECLARATION OF THE LENGTH OF A RESERVED WORD RECORD  */

dcl reserved_word_size fixed bin(15) int static init(28);

/* END INCLUDE FILE ...   cobol_repl_unique.incl.pl1 */

