
/* BEGIN INCLUDE FILE ... cobol_perform_entry.incl.pl1 */
/* Last modified on 01/26/77 by ORN */

dcl perform_ptr ptr;
dcl 1 perform_entry based(perform_ptr),
     2 proc_number fixed bin,
     2 code fixed bin,
     2 next char(5),
     2 next1 char(5),
     2  priority fixed bin,
     2 address fixed bin;

/* END INCLUDE FILE ... cobol_perform_entry.incl.pl1 */

