
/* BEGIN INCLUDE FILE ...   cobol_spec_constants.incl.pl1 */
/*	last modified on 11/20/74			*/
dcl msg_constant fixed bin static internal init  (32);
dcl pd_db_constant fixed bin static internal init  (8);
dcl dn_constant fixed bin static internal init  (112);
dcl niv_constant fixed bin static internal init  (20);
dcl aiv_constant fixed bin static internal init  (8);
dcl ed_constant fixed bin static internal init  (20);
dcl occ_constant fixed bin static internal init  (12);
dcl occ_dim_constant fixed bin static internal init  (24);
dcl in_constant fixed bin static internal init  (80);
dcl cn_constant fixed bin static internal init  (52);
dcl fd_constant fixed bin static internal init  (48);
dcl cd_constant fixed bin static internal init  (64);
dcl linage_rec_constant fixed bin static internal init  (64);
dcl linage_name_rec_constant fixed bin static internal init  (32);
dcl qual_rec_constant fixed bin static internal init  (20);
dcl occ_key_constant fixed bin static internal init  (36);
dcl report_rec_constant fixed bin static internal  init  (28);
dcl obj_rec_constant fixed bin static internal init  (24);
dcl rename_rec_constant fixed bin static internal init  (48);
dcl odo_rec_constant fixed bin static internal init  (32);
dcl skey_rec_constant fixed bin static internal init  (44);
dcl fkey_constant fixed bin static internal init  (84);
/* END INCLUDE FILE ...   cobol_spec_constants.incl.pl! */

