
/* BEGIN INCLUDE FILE ... cobol_ddal_diag_values.incl.pl1 */
/* Last modified on 06/10/77 by ORN */

dcl warn_UNEQUAL_SIZE_REDEFINES	fixed bin static options(constant) init(150);
dcl warn_REC_EXCEEDS_DEVICE_LIMIT	fixed bin static options(constant) init(156);
dcl warn_CODE_SET_VIOLATION		fixed bin static options(constant) init(158);
dcl warn_RECSIZE_TOO_SMALL		fixed bin static options(constant) init(159);
dcl warn_VLR_RECSIZE_EXCEEDED		fixed bin static options(constant) init(160);
dcl warn_SPANNED_RECSIZE_EXCEEDED	fixed bin static options(constant) init(161);
dcl warn_FLR_RECSIZE_EXCEEDED		fixed bin static options(constant) init(162);
dcl warn_BLKSIZE_TOO_SMALL		fixed bin static options(constant) init(163);
dcl warn_BLKSIZE_LESS_THAN_RECSIZE	fixed bin static options(constant) init(164);
dcl warn_BLKSIZE_NOT_MULT_OF_RECSIZE	fixed bin static options(constant) init(165);
dcl obs_BLKSIZE_ADJUSTED		fixed bin static options(constant) init(166);
dcl obs_RECSIZE_ADJUSTED		fixed bin static options(constant) init(167);
dcl obs_CRASIZE_ADJUSTED		fixed bin static options(constant) init(168);
dcl warn_MIN_RECSIZE_MISSING		fixed bin static options(constant) init(169);
dcl warn_RECSIZE_INCONSISTENT		fixed bin static options(constant) init(170);
dcl obs_BLOCKING_IGNORED		fixed bin static options(constant) init(171);
dcl obs_GREATER_SIZE_REDEFINES	fixed bin static options(constant) init(172);
dcl obs_ALLOC_ADJUSTED		fixed bin static options(constant) init(173);
dcl obs_IMPLICIT_SYNC		fixed bin static options(constant) init(174);
dcl obs_IMPLICIT_SYNC_IN_ARRAY	fixed bin static options(constant) init(175);
dcl obs_IMPLICIT_SYNC_FOR_DISPLAY	fixed bin static options(constant) init(176);
dcl obs_IMPLICIT_SYNC_FOR_GROUP	fixed bin static options(constant) init(177);
dcl obs_PREVIOUS_SYNC		fixed bin static options(constant) init(179);
dcl obs_EXPLICIT_SYNC		fixed bin static options(constant) init(180);

/* END INCLUDE FILE ... cobol_ddal_diag_values.incl.pl1 */

