

/* STATIC DATA */

dcl 1 fixdef static aligned,
     2 wd1 fixed bin(35) aligned,
     2 wd2 fixed bin(35) aligned;



/* EXTERNAL ENTRY NAMES */

		dcl ioa_$rsnnl entry options(variable);
		dcl signal_ entry(char(*),ptr,ptr);
		dcl cobol_reset_r$in_line entry;

/* BUILTIN FUNCTIONS */

		dcl (null,addrel,substr,addr,fixed,unspec,max) builtin;

%include cobol_fixup_value;
%include cobol_fixup_tables;
%include cobol_error_info;
%include cobol_;
%include cobol_ext_;

