
/* BEGIN INCLUDE FILE ...   cobol_fixup_value.incl.pl1 */
/* Last modified on Dec 18, 1974 by ORN */

dcl value_ptr ptr;
dcl 1 value based(value_ptr) aligned,
     2 con_len fixed bin aligned,
     2 code_len fixed bin aligned,
     2 text_len fixed bin aligned,
     2 def_len fixed bin aligned,
     2 link_len fixed bin aligned,
     2 sym_len fixed bin aligned,
     2 int_storage_len fixed bin aligned,
     2 exec_off fixed bin aligned;

/* END INCLUDE FILE ...   cobol_fixup_value.incl.pl1 */

