
/* BEGIN INCLUDE FILE ...   cobol_rename_rec.incl.pl1 */
dcl 1 rename_rec based(com2_ptr),
   2 repl_ptr ptr,
     2 next char(5),
     2 obj1 char(5),
     2 obj2 char(5),
     2 lineno_01 fixed bin,
     2 lineno_66 fixed bin,
     2 rec_no_66 char(5),
     2 info bit(8),
     2 size fixed bin,
     2 name char(31);
/* END INCLUDE FILE ...   cobol_rename_rec.incl.pl1 */

