
/* BEGIN INCLUDE FILE ...   cobol_occ_key_rec.incl.pl1 */

dcl 1 occ_key based(com2_ptr),
     2 next char(5),
     2 first_key char(5),
     2 rec_no char(5),
     2 ntble fixed bin,
     2 lineno fixed bin,
     2 info bit(8);

/* END INCLUDE FILE ...   cobol_occ_key_rec.incl.pl1 */

