
/* BEGIN INCLUDE FILE ...   cobol_odo_rec.incl.pl1 */
dcl 1 odo_rec based(com2_ptr),
     2 next char(5),
     2 descr char(5),
    2 seg_no fixed bin,
    2 offset_l fixed bin(24),
    2 offset_r fixed bin(24),
     2 info bit(8);
/* END INCLUDE FILE ...   cobol_odo_rec.incl.pl1 */

