/*	BEGIN INCLUDE FILE comp_modes.incl.pl1	*/

dcl 1 modes aligned based (shared.mode_ptr), /* program modes block */
    2 bug bit (1) unaligned,		/* debug mode */
    2 footnote bit (1) unaligned,	/* footnote mode flag */
    2 table bit (1) unaligned,	/* tabular text mode */
    2 MBZ bit (33) unaligned;

/*	END INCLUDE FILE comp_modes.incl.pl1	*/
