/*	BEGIN INCLUDE FILE comp_col_hdrftr.incl.pl1		*/

dcl 1 chdr	aligned like text based (chdr_ptr);
dcl chdr_ptr	ptr;
dcl 1 cftr	aligned like text based (cftr_ptr);
dcl cftr_ptr	ptr;

/*	END INCLUDE FILE comp_col_hdrftr.incl.pl1	*/
