
/*	BEGIN INCLUDE FILE comp_value_overlays.incl.pl1	*/

dcl bin_value	fixed (35) based;	/* for binaries */
dcl flag_value	bit (1) based;	/* for flags */
dcl label_value	label based;	/* for functions */
dcl num_value	fixed dec (11, 3) based; /* for numerics */
dcl string_value	char (1020) varying based; /* for strings */

/*	END INCLUDE FILE comp_value_overlays.incl.pl1	*/
