/*	BEGIN INCLUDE FILE comp_input.incl.pl1	*/


dcl input_file	char (const.max_seg_chars) based (shared.input_ptr); /* input file as a string */

/*	END INCLUDE FILE comp_input.incl.pl1	*/
