/*	BEGIN INCLUDE FILE comp_areas.incl.pl1		*/

dcl comp_area	area (sys_info$max_seg_size) /* compose no freeing area */
		based (const.comp_area_ptr);
dcl comp_free	area (sys_info$max_seg_size) /* compose freeing area */
		based (const.comp_free_ptr);

/* 	END INCLUDE FILE comp_areas.incl.pl1	 */
