/* Begin include file ... config_field_codes.incl.pl1 ... 4/80 MRJ */

dcl  OCTAL_CONFIG_FIELD fixed bin static options (constant) init (0);
dcl  A_THRU_H_CONFIG_FIELD fixed bin static options (constant) init (1);
dcl  ASCII_CONFIG_FIELD fixed bin static options (constant) init (2);
dcl  DECIMAL_CONFIG_FIELD fixed bin static options (constant) init (3);

/* End include file ... config_field_codes.incl.pl1 */
