/* BEGIN INCLUDE FILE ... config_chnl_card.incl.pl1 ... 11/27/80 W. Olin Sibert */

dcl  chnl_cardp ptr;				/* Pointer to a CHNL card. */

dcl 1 chnl_card based (chnl_cardp) aligned,		/* CHNL card declaration */
    2 word char (4),				/* "chnl" */
    2 name char (4),				/* subsystem name */
    2 group (3),					/* Channel groups for this subsystem -- 9 fields total */
      3 iom fixed bin (3),				/* IOM number */
      3 chan fixed bin (8),				/* channel number */
      3 nchan fixed bin,				/* number of channels */

    2 pad (4) bit (36) aligned,			/* pad to 15 fields */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl 1 chnl_card_array aligned based (chnl_cardp),		/* Overlay for channel group array */
    2 pad1 (2) bit (36) aligned,
    2 group (min (3, divide (max (0, (chnl_card.n_fields - 1)), 3, 17, 0))),
      3 iom fixed bin (3),				/* IOM number */
      3 chan fixed bin (8),				/* Channel number. */
      3 nchan fixed bin;				/* Number of logical channels on this channel. */

dcl  CHNL_CARD_WORD char (4) aligned internal static options (constant) init ("chnl");

/* END INCLUDE FILE ... config_chnl_card.incl.pl1 */
