/* BEGIN INCLUDE FILE ... config_mpc_card.incl.pl1 ... 11/27/80 W. Olin Sibert */

dcl  mpc_cardp ptr;					/* Pointer to an MPC card. */

dcl 1 mpc_card aligned based (mpc_cardp),
    2 word char (4),				/* "mpc" */
    2 name char (4),				/* Name of this MPC - e.g., "mspa" */
    2 model fixed bin,				/* Model of this MPC - e.g., 601. */
    2 port (4),					/* Per port information. 12 fields total */
      3 iom fixed bin (3),				/* IOM number */
      3 chan fixed bin (8),				/* Channel number. */
      3 nchan fixed bin,				/* Number of logical channels on this channel. */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl 1 mpc_card_array aligned based (mpc_cardp),		/* Overlay for MPC port array */
    2 pad1 (3) bit (36) aligned,
    2 port (divide (max (0, (mpc_card.n_fields - 2)), 3, 17, 0)),
      3 iom fixed bin (3),				/* IOM number */
      3 chan fixed bin (8),				/* Channel number. */
      3 nchan fixed bin;				/* Number of logical channels on this channel. */

dcl  MPC_CARD_WORD char (4) aligned internal static options (constant) init ("mpc");

/* END INCLUDE FILE ... config_mpc_card.incl.pl1 */
