/* BEGIN INCLUDE FILE ... config_deck_keywords_.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(85-09-09,Farley), approve(85-09-09,MCR6979),
     audit(86-03-08,CLJones), install(86-03-21,MR12.0-1033):
     Add Fips card.
                                                   END HISTORY COMMENTS */

/* Written August of 1984 by Allen Ball. */
/* Modified January 1985 by Paul Farley to add a FIPS card type. */

dcl Card_field_names (41) char (12) static options (constant) init
	("-4k", "-16k", "-64k", "-256k", "-apt",
	 "-boot_delta", "-cache", "-chn", "-ctlr", "-delta",
	 "-device", "-drive", "-exp_port", "-iom", "-itt",
	 "-ll", "-maxe", "-maxmaxe", "-mine", "-model",
	 "-nchan", "-number", "-part", "-port", "-real_name",
	 "-size", "-state", "-subsys", "-tag", "-tefirst",
	 "-telast", "-timax", "-train", "-type", "-wsf",
	 "-zone", "-option", /* not real: */ "emp", "EMP",
	 "minimum", "repeat");

dcl Card_names (18) char (4) static options (constant) init
	("chnl", "clok", "cpu ", "iom ", "ipc",
	 "mem ", "mpc ", "parm", "part", "prph",
	 "root", "salv", "schd", "sst ", "tbls",
	 "tcd ", "udsk", "USER");

dcl Card_subnames (10) char (3) static options (constant) init
	("ccu", "dsk", "fnp", "opc",
	 "prt", "pun", "rdr", "tap",
	 /* not real: */ "emp", "EMP");

dcl Card_data_types (4) char (7) static options (constant) init
	("CHAR", "DECIMAL", "OCTAL", "STRING");

dcl Card_data_bit_strings (4) bit (2) static options (constant) init
	("01"b, "11"b, "00"b, "10"b);


/* END INCLUDE FILE ... config_deck_keywords_.incl.pl1 */
