dcl (	pointer_context		initial(6),
	area_context		initial(8),
	file_name_context		initial(11),
	condition_context		initial(15),
	parameter_context		initial(20)) fixed bin(15) internal static options(constant);
