/*     BEGIN INCLUDE FILE ... db_arg_list.incl.pl1 ... last modified Dec. 1972 - WSS  */

dcl 	ap		ptr;

dcl    1	arg_list		based (ap)	aligned,

	2 num_args	fixed bin(16)	unaligned,
	2 code		bit (19)		unaligned,

	2 num_desc	fixed bin(16)	unaligned,
	2 fill		bit (19)		unaligned,

	2 args (25)	ptr		aligned;

/*    END INCLUDE FILE ... db_arg_list.incl.pl1 */
