dcl tedget_segment_ entry (		/* get a segment to work in	       */
		ptr,		/* -> database		       */
		ptr,		/* -> gotten segment	 [OUT] */
		fixed bin,	/* sequence # of it         [IN/OUT] */
				/* if >0 upon entry, it will then    */
				/*  fill that entry in seg_p array   */
				/* otherwise it will take any one    */
		);

