/* BEGIN INCLUDE FILE ... declare_type.incl.pl1 */

/* Modified: 25 Apr 1979 by PCK to implement 4-bit decimal */

dcl  (	by_declare	initial("001"b),
	by_explicit_context initial("010"b),
	by_context	initial("011"b),
	by_implication	initial("100"b),
	by_compiler	initial("101"b)) int static bit(3) aligned options(constant);

/* END INCLUDE FILE ... declare_type.incl.pl1 */
