/* BEGIN INCLUDE FILE ... dial_server_request.incl.pl1 */

/* This include file declares the data structure to be
   passed to the dial facility to allow a process
   to accept dials.
*/
/*  Modified 11-9-76 by S.T. Kent to add selective channel release flag
   and registered dial server flag
   Modified April 1979 by Larry Johnson for no_hangup option on release channel
   Modified November 1980 by E.N. Kittlitz for baud rate, line server
   type, and to separate dial_out_destination from dial_qualifier
   Modified March 1981 by Robert Coren to add tandd_attach and no_listen bits
   Modified April 1983 by E. N. Kittlitz for access_class.
   Moodified 84-04-04 BIM for privileged_server.
*/

dcl  request_ptr ptr;

dcl  dial_server_request_version_4 fixed bin internal static initial (4);

dcl 1 dial_server_request aligned based (request_ptr),
    2 header like as_request_header,			/* std header */
    2 version fixed bin,				/* version of this structure */
    2 dial_control_channel fixed bin (71),		/* send dial acknowledgements here */
    2 dial_qualifier char (22),			/* dial qualifier name to use */
    2 channel_name char (32),				/* channel to attach (may have * convention) */
    2 dial_out_destination char (32),			/* phone-no, etc. for dial out */
    2 baud_rate fixed bin,				/* baud rate required */
    2 line_type fixed bin,				/* line type (protocol) required */
    2 server_type char (32),				/* expansion... */
    2 flags aligned,				/* control flags */
      3 start bit (1) unaligned,			/* start as server */
      3 stop bit (1) unaligned,			/* stop as server */
      3 privileged_attach bit (1) unaligned,		/* grab channel */
      3 release_channel bit (1) unaligned,		/* release this channel */
      3 registered_server bit (1) unaligned,		/* request to become a dial server with a registered qualifier */
      3 no_hangup bit (1) unaligned,			/* release channel without hanging it up */
      3 release_dial_id bit (1) unaligned,		/* stop as dial server, but keep current dial-ups */
      3 tandd_attach bit (1) unaligned,			/* grab channel and force it not to listen */
      3 no_listen bit (1) unaligned,			/* don't listen again at release */
      3 access_class_specified bit (1) unaligned,		/* access_class is valid */
      3 privileged_server bit (1) unaligned,		/* allow_dials/registered_server of range */
      3 pad bit (25) unaligned,
    2 access_class bit (72);


/* END INCLUDE FILE ... dial_server_request.incl.pl1 */
