/* Begin include file ...... disk_error_interp.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(89-06-23,Farley), approve(89-07-26,MCR8122),
     audit(89-09-11,WAAnderson), install(89-09-22,MR12.3-1072):
     Added "finterp" and "fnamep" to major status array to allow seperation of
     some of the FIPS statuses, due to different processing requirements.
     Also added "just_log" flag to substatus entry to allow some errors to
     only be logged and not displayed on the console.
                                                   END HISTORY COMMENTS */


/* last modified 5/19/76 by Noel I. Morris */

/* Breakdown of disk error status. */

dcl  disk_error_data$ ext;				/* disk error status data segment */

dcl  dedp ptr;					/* pointer to major status structure */

dcl 1 disk_error_data (0: 23) aligned based (dedp),	/* major status array */
   (2 interp bit (18),				/* pointer to substatus data for this major status */
    2 namep bit (18),				/* rel pointer to major status description */
    2 finterp bit (18),				/* pointer to FIPS substatus data for this major status */
    2 fnamep bit (18)) unal;				/* rel pointer to FIPS major status description */

dcl  dskerap ptr;					/* pointer to substatus array */

dcl 1 disk_status_interp_array (100) like disk_error_interp based (dskerap) aligned;
						/* array of substatus interpretations */

dcl  dskerp ptr;					/* pointer to error interpretation data */

dcl 1 disk_error_interp based (dskerp) aligned,		/* substatus interpretation structure */
   (2 bitson bit (6),				/* substatus bits which must be ON */
    2 bitmask bit (6),				/* substatus bits which must be checked */
    2 max_retries fixed bin (5),			/* maximum no. of retries for this error */
    2 reseek bit (1),				/* "1"b if restore and reseek required */
    2 rsr bit (1),					/* "1"b if detailed status should be read */
    2 bad_addr bit (1),				/* "1"b if disk address is defective */
    2 bad_dev bit (1),				/* "1"b if device is inoperative */
    2 bad_path bit (1),				/* "1"b if disk data path is defective */
    2 bad_mem bit (1),				/* "1"b if memory may be defective */
    2 just_log bit (1),				/* "1"b if error is only to be logged */
    2 pad1 bit (11),
    2 namep bit (18),				/* rel pointer to substatus description */
    2 pad2 bit (18)) unal;

dcl  dsdp ptr;					/* pointer to status description */

dcl 1 disk_status_descrip based (dsdp) aligned,		/* status description string */
   (2 lth fixed bin (8),				/* length of string */
    2 chr char (32 refer (disk_status_descrip.lth))) unal;	/* status description string */

/* End of include file ...... disk_error_interp.incl.pl1 */
