/* BEGIN INCLUDE FILE dm_bj_names.incl.pl1 */

dcl  SYSTEM_BJ char (32) internal static options (constant)
     init ("dm_default_bj");

/* SYSTEM_BJ is the name of the before journal to be used by processes
   which have not set up their own journals for data management.       */


dcl  BJ_PST char (16) internal static options (constant) init ("bj_pst_segment");

/* BJ_PST is the name of the system wide before journal registration table */

/* END INCLUDE FILE dm_bj_names.incl.pl1 */
