/*  BEGIN INCLUDE FILE:	dm_bj_pst.incl.pl1	*/
/*
Layout of the before journal per-system table header and BJ table entries.

Written by Andre Bensoussan 06-15-1982
Modified:
09/29/82 by Lee A. Newcomb:  To use dm_system_data_ for determining
	  dimension of bj_pst.e and force bj_pst.mod_list_area and
	  bj_pst.e to even word boundaries.
04/27/82 by M. Pandolf:  To add meter space by cutting away from mod_list_area.
*/
/* format: style4,indattr,idind33,^indcomtxt */

dcl  BJ_PST_VERSION_1	        fixed bin internal static options (constant) init (1);

dcl  bj_pst_ptr		        ptr;

dcl  1 bj_pst		        based (bj_pst_ptr) aligned,
       2 version		        fixed bin,
       2 pad1		        bit (36),
       2 lock,
         3 pid		        bit (36),		/* process_id holding lock */
         3 event		        bit (36),
       2 time_of_bootload	        fixed bin (71),	/* for ease of access */
       2 max_n_entries	        fixed bin,		/* as determined from dm_system_data_$bj_max_n_journals */
       2 n_entries_used	        fixed bin,		/* current # of BJs open on the system */
       2 highest_ix_used	        fixed bin,		/* max. # of BJs that has ever been open of the system */
       2 pn_table_offset	        fixed bin (18) uns,	/* relative offset of bj_pn_table in bj_pst seg. */
       2 check_in_table_offset        fixed bin (18) uns,	/* ditto for bj_check_in_table */
       2 buffer_table_offset	        fixed bin (18) uns,	/* ditto for where our BJ buffers are located */
       2 max_n_buffers	        fixed bin,		/* must be <= to max_n_entries */
       2 pad2		        bit (36),		/* force next on even word boundary */
       2 meters,					/* dim (50) fixed bin (71), */
         3 n_calls_begin_txn          fixed bin (71),	/* meter (1) */
         3 n_calls_before_image       fixed bin (71),	/* meter (2) */
         3 n_calls_abort              fixed bin (71),	/* meter (3) */
         3 n_calls_commit             fixed bin (71),	/* meter (4) */
         3 n_calls_rb_mark            fixed bin (71),	/* meter (5) */
         3 n_calls_fm_pc_mark         fixed bin (71),	/* meter (6) */
         3 n_calls_fm_rbh             fixed bin (71),	/* meter (7) */
         3 n_calls_rollback           fixed bin (71),	/* meter (8) */
         3 meter dim (9:50)           fixed bin (71),	/* meter (9) - meter (50) */
       2 mod_list_area	        (100) fixed bin (35), /* for keeping track of pst mods */

       2 e		        dim (dm_system_data_$bj_max_n_journals refer (bj_pst.max_n_entries))
			        like bj_pste;	/* per system BJ table entries */


/* END INCLUDE FILE:	dm_bj_pst.incl.pl1	*/
