/* BEGIN INCLUDE FILE ... dmpr_data_.incl.pl1 Feb 1976 */
/* format: style1,ind2,^inddcls,ifthenstmt,dclind2,declareind2,ifthendo,ifthen*/
/* Modified 7/79 by D. Vinograd to add new variables and change to based structure */
/* Modified: 1/26/83 by GA Texada to add cur_vol_open and change version to 2.	   */
/* Modified: 04/05/83 by GA Texada to add trace switch to support tracing.	   */
/* Modified 04/84 by GA Texada to change to version 3 (disk_type). This begins the adding of new items	*/
/* to the END of the structure to facilite easy additions.						*/
dcl dmprp		     ptr ext static init (null);
dcl dmpr_data_version_2  fixed bin int static init (2) options (constant);
dcl dmpr_data_version_3  fixed bin int static init (3) options (constant);
						/* Version 3 is current			*/

dcl 1 dmpr_data_	     aligned based (dmprp),
    2 version	     fixed bin,			/* version */
    2 lock	     bit (36),			/* inter-lock */
    2 ptrs,
      3 pre_attach_pvlp  (50) ptr,			/* array of pvolog ptrs */
      3 contents_namesp  ptr,				/* ptr to contents name seg */
      3 pre_attach_iocbp (50) ptr,			/* array of output iocbp */
      3 pvlp	     ptr,				/* ptr to dump volume log */
      3 account_iocbp    ptr,				/* iocbp for account seg */
      3 infop	     ptr,				/* ptr to info seg */
      3 inputp	     ptr,				/* ptr to input storage for sup interface */
      3 recordp	     ptr,				/* ditto for output */
      3 control_iocbp    ptr,				/* iocbp for dump control segment */
      3 error_iocbp	     ptr,				/* iocbp for error output file */
      3 outputvol_iocbp  ptr,				/* iocbp for dump volume */
      3 contentsp	     ptr,				/* ptr to dump volume table of contents */
      3 bvlp	     ptr,				/* ptr to volume log */
      3 dirp	     ptr,				/* ptr to directory buffer seg */
      3 segp	     ptr,				/* ptr to segment to be dumped */
      3 fcbp	     ptr,				/* ptr to file control block for contents_name msf */
      3 vpp	     ptr,				/* ptr to volume pool */
    2 fixed_bin,
      3 retrys	     fixed bin,			/* number of time segment disappeared while being dumped */
      3 physical_volume_dir_num fixed bin,		/* number of dirs dumped from this physical volume */
      3 physical_volume_dir_rec fixed bin,		/* number of dir records on this physical volume */
      3 physical_volume_seg_num fixed bin,		/* number of segs dumped from this physical volume */
      3 physical_volume_seg_rec fixed bin,		/* number of seg records dumped from this physical volume  */
      3 vol_log_dir_num  fixed bin,			/*  dirs dumped from pvol to dump vol */
      3 vol_log_dir_rec  fixed bin,			/*  dir rec on this pvol to dump vol */
      3 vol_log_seg_num  fixed bin,			/*  segs dumped from pvol to dump vol */
      3 vol_log_seg_rec  fixed bin,			/*  seg rec dumped from pvol to dump vol  */
      3 dump_volume_dir_num fixed bin,			/* number of dirs dumped on this dump volume */
      3 dump_volume_dir_rec fixed bin,			/* number of dir records on this dump volume */
      3 dump_volume_seg_num fixed bin,			/* number of segs dumped on this dump volume */
      3 dump_volume_seg_rec fixed bin,			/* number of seg records dumped on this dump volume  */
      3 num_null_vtoce   fixed bin,			/* number of null vtoce dumped from this physical volume */
      3 num_vtoce_only   fixed bin,			/* number of vtoce only  */
      3 mod_after_time   fixed bin (71),		/* dump all modified since this date */
      3 dump_type	     fixed bin,			/* type of dump */
      3 save_time	     fixed bin (71),		/* date, time of start of dump */
      3 start_time	     fixed bin (71),		/* start time of physical volume pass */
      3 wakeup_interval  fixed bin (71),		/* interval between wakeups of dumper in micro secs. */
      3 incr_ev_chn	     fixed bin (71),		/* event chn used to wakeup incremental dumper */
      3 incr_skip_count  fixed bin,			/* number of incr cycles skiped befor purging */
      3 pre_attach_vol   fixed bin,			/* if greater then 1 then pre attach output streams */
      3 vol_idx	     fixed bin,			/* index of multi volume attachment sequence */
      3 component	     fixed bin,			/* msf component of contents_name seg */
    2 bits,
      3 volid	     bit (36),			/* uid of dump volume */
      3 pre_attach_volid (50) bit (36),			/* array of volid */
      3 cycle_uid	     bit (36),			/* uid of this dump cycle */
      3 pvid	     bit (36),			/* uid of physical volume being dumped */
      3 flags,
      ( 4 purge	     bit (1),			/* if on purge volume logs */
        4 auto_vol	     bit (1),			/* if on use automatic dump volume selection */
        4 disable_error_report bit (1),			/* if on disables error reporting */
        4 arg_init	     bit (1),			/* if on indicates args have been processed */
        4 manual_free    bit (1),			/* on if manual free will be done */
        4 err_online     bit (1),			/* Flag error output to be online, default to a file */
        4 detach	     bit (1),			/* if on control detachment of dump volume */
        4 no_object	     bit (1),			/* if on not copy object from ring 0 */
        4 no_update	     bit (1),			/* if on prevent vtoce update */
        4 data_init	     bit (1),			/* if on indicates that data structure has been initialized */
        4 reset	     bit (1),			/* if on put items back on list */
        4 accounting     bit (1),			/* if on enables accounting */
        4 dmpr_asleep    bit (1),			/* dumper is asleep - interlock to prevent restart of last volume */
        4 dump_in_progress bit (1),			/* recursive entry interlock */
        4 not_reported   bit (1),			/* on if output counts not reported */
        4 names	     bit (1),			/* collect all names from dirs that are dumped */
        4 cur_vol_open   bit (1),			/* if a successful open on this volname		*/
        4 trace	     bit (1),			/* ON => trace				*/
        4 pad	     bit (18)) unal,		/* fill out the word properly			*/
      3 old_256K_switch bit(2) aligned,			/* 256K segs enabled prior to this dumper invocation?*/
      3 rpv_pvid        bit (36),			/* because the label really doesn't have it	*/
    2 chars,
      3 sys_dir	     char (168),			/* system directory where all volume dumper data lives */
      3 prev_volname     char (32),
      3 pre_attach_volname (50) char (32),		/* array of volnames */
      3 io_module	     char (32),			/* name of attached outer module for output io */
      3 pvname	     char (32),			/* name of physical volume being dumped */
      3 att_desc	     char (256),			/* attach description for output */
      3 volname	     char (32),			/* name of dump volume */
      3 control_name     char (32),			/* dump control file name   */
      3 myname	     char (32),			/* name of entry called */
      3 operator	     char (32),			/* operator name */
      3 restart_pvname   char (32),			/* where to restart complete or consolidated dump */
      3 lvname	     char (32),			/* name of logical volume being dumped */
   2 disk_type fixed bin;				/* disk type for recording in the volog		*/
	

/* END OF INCLUDE FILE ... dmpr_data_.incl.pl1 */
