/* BEGIN INCLUDE FILE ... env_ptrs.incl.pl1 */

/* coded December 19, 1977 by Melanie Weaver */

dcl 1 env_ptrs aligned based,
    2 version fixed bin,
    2 pad fixed bin (35),
    2 lot_ptr ptr,
    2 isot_ptr ptr,
    2 clr_ptr ptr,
    2 combined_stat_ptr ptr,
    2 user_free_ptr ptr,
    2 sys_link_info_ptr ptr,
    2 rnt_ptr ptr,
    2 sct_ptr ptr;

/* END INCLUDE FILE ... env_ptrs.incl.pl1 */
