/* BEGIN INCLUDE FILE ... event_wait_channel.incl.pl1 */

/* ipc_$block wait list with one channel

   Written 9-May-79 by M. N. Davidoff.
*/

     declare 1 event_wait_channel   aligned,
	     2 n_channels	      fixed bin initial (1),	/* number of channels */
	     2 pad	      bit (36),
	     2 channel_id	      (1) fixed bin (71);	/* event channel to wait on */

/* END INCLUDE FILE ... event_wait_channel.incl.pl1 */
