/*  BEGIN INCLUDE FILE ... exec_com_info.incl.pl1 */

/* Information needed by exec_com_ */

declare  exec_com_info_ptr		ptr;
	
declare  1 exec_com_info		aligned based (exec_com_info_ptr),
	 2 version		fixed bin,
	 2 arg_list_ptr		ptr,
	 2 first_arg		fixed bin,
	 2 execute_line		entry (ptr, fixed bin (21), fixed bin (35)),
	 2 eval_string		entry (ptr, char (*), fixed bin, char (*) var, fixed bin (35)),
	 2 ready			entry (),
           2 set_ready_mode		entry (1 aligned, 2 bit (1) unal, 2 bit (35) unal),
	 2 error			entry options (variable);

declare  exec_com_info_version_1	fixed bin internal static init (1);

/*   END INCLUDE FILE ... exec_com_info.incl.pl1 */
