/*	BEGIN INCLUDE FILE   format_document_options.incl.pl1	     

     Modified 82.10.18 by Paul W. Benjamin to add dont_compress_sw and upgrade
			to version_2.
     Modified 83.02.15 by PWB to add break_word_sw and max_line_length_sw.
     Modified 83.03.01 by PWB to add dont_break_indented_lines_sw.
     Modified 83.03.03 by PWB to add sub_err_sw.
     Modified 83.06.07 by PWB to add dont_fill_sw.
     Modified 83.06.09 by PWB to add hyphenation_sw and syllable_size.
*/

dcl 1 format_document_options aligned based (format_document_options_ptr),
      2 version_number        fixed bin,		/* input */
                                                            /* must be format_document_version_2 */
      2 indentation           fixed bin,		/* input */
						/* all lines must be indented by this value */
      2 line_length           fixed bin,		/* input */
						/* initial line length */
      2 switches,
        3 pgno_sw             bit (1) unal,		/* input */
						/* end each page with a centered page number */
        3 adj_sw              bit (1) unal,		/* input */
						/* adjust mode initially on */
                                                            /* only meaningful if dont_fill_sw = "0"b */
        3 galley_sw           bit (1) unal,		/* input */
						/* galley mode -- no page breaks */
        3 error_sw            bit (1) unal,		/* input */
						/* report all errors on error_output */
        3 literal_sw          bit (1) unal,		/* input */
						/* "1"b - interpret all lines as text */
						/* "0"b - lines that start with "." are controls */
        3 file_sw             bit (1) unal,		/* output */
						/* has meaning for non-zero storage system status codes */
						/* "1"b code refers to output file */
						/* "0"b code refers to input file */
        3 dont_compress_sw    bit (1) unal,		/* input */
						/* "1"b - don't compress white space */
						/* "0"b - compress white space when filling */
        3 break_word_sw      bit (1) unal,		/* input */
						/* "1"b - break a word rather than exceed line_length */
						/* "0"b - write an overlength line if no spaces found */
        3 max_line_length_sw  bit (1) unal,		/* input */
						/* "1"b - line_length cannot be exceeded */
						/* "0"b - line_length can be exceeded (by .pdw controls) */
        3 dont_break_indented_lines_sw			/* input */
			bit (1) unal,		/* don't break a line that begins with whitespace */
						/* when it is the last line, or the next line is */
						/* null or the next line begins with whitespace */
        3 sub_err_sw	bit (1) unal,		/* input */
						/* quietly call sub_err_ with diagnostic errors */
        3 dont_fill_sw        bit (1) unal,                 /* input */
                                                            /* "1"b - fill mode off initially */
                                                            /* "0"b - fill mode on initially */
        3 hyphenation_sw      bit (1) unal,
        3 mbz                 bit (23) unal,		/* input */
						/* MUST be zero */
      2 syllable_size
			fixed bin;		/* input */
						/* smallest portion of word */
						/* to be left by hyphenation */

dcl  format_document_options_ptr ptr;
dcl  format_document_version_2 fixed bin int static options (constant) init (2);
dcl  format_document_version_1 fixed bin int static options (constant) init (1);
	
/*	END INCLUDE FILE   format_document_options.incl.pl1	     */
