/* Begin include file fsdisk_errors.incl.pl1     10/20/75 by Bernard Greenberg for NSS */

dcl fsdisk_error_message (10) static char (32) init
	("PVT index out of range",		/* 1 */
	 "Drive in use already",		/* 2 */
	 "Volume not salvaged",		/* 3 */
	 "Unsupported label version",		/* 4 */
	 "Unsupported VTOC header vers.",	/* 5 */
	 "FSMAP will not fit",		/* 6 */
	 "Physical device error",		/* 7 */
	 "Not a storage system drive",	/* 8 */
	 "Drive not ready",			/* 9 */
	 "Reserved");			/* 10 */

% include fsdisk_errcodes;

/* End include file fsdisk_errors.incl.pl1 */
