/* BEGIN INCLUDE FILE gcos_save_mc.incl.pl1   (Wardd Multics)  09/12/81 0905.9 mst Sat */

/* Structure to isolate the definition of the size of the
space needed to store he machine conditions structure (mc).
*/
dcl 1 save_machine_conditions based
,     3 save_space		bit(1728)
;

/*   END INCLUDE FILE gcos_save_mc.incl.pl1 */
