/* BEGIN INCLUDE FILE gcos_save_data_entry.incl.pl1   (Wardd Multics)  07/01/81 1339.9 mst Wed */
/* Change: Dave Ward	07/01/81 include gcos_flags_. */
/* Change: Dave Ward	09/10/81 fib changed to fibs & likened to fib. */

dcl 1 save_data_entry  aligned based
,3 flgs                like flags	/* system wide flgs */
,3 actid               char(8)	/* activity no. and accnt i.d. */
,3 short_actid         bit(36) aligned	/* short form of activity id */
,3 ident               char(60)	/* holds ident info from snumb card */
,3 psw                 bit(36) aligned	/* program switch word */
,3 last_execute_act_no fixed bin(24)/* activity number of last $ EXECUTE card in job */
,3 activity_no         fixed bin(24)/* activity number */
,3 job_time_limit      fixed bin(71)	/* job time limit */
,3 job_sysout_limit    fixed bin(24)/* job sysout line limit */
,3 sysout_queue        (10) char(32)	/* sysout queue */
,3 sysout_queue_media  (10) fixed bin(24)/* medium (print,punch) of each file on queue */
,3 sqindex             fixed bin(24)/* curr offset in sysout queue */
,3 pathname_prefix     char(168)varying 	/* prefix for gcos cfdescs */
,3 skip_umc            aligned bit(1) 	/* flag to tell if we should skip umc names */
,3 job_deck            pointer	/* pointer to seg holding canonicalized job deck */
,3 jd_size             fixed bin(24)/* size in words of job deck */
,3 jd_position         fixed bin(24)	/* position of current block of job deck */
,3 jd_rem_block_len    fixed bin(24)/* words remaining in current block of job deck */
,3 syot_dir            char(168)varying	/* pathname of directory to hold sysout files */
,3 fibs		   (40) like fib
,3 param               (32) char(57)varying	/* parameters */
;

%include gcos_flags;

/*   END INCLUDE FILE gcos_save_data_entry.incl.pl1 */
