/*	BEGIN INCLUDE FILE gcos_fms_return_code_.incl.pl1	April 1977	MRJ	*/


dcl  fms_return_code_ptr ptr;

dcl 1 fms_return_code aligned based (fms_return_code_ptr),
    2 termination_indicator bit (1) unal,
    2 reason bit (11) unal,
    2 fill bit (6) unal,
    2 bad_name_loc bit (18) unal,
    2 err_mess_dcw unal,
      3 data_loc bit (18),
      3 character_position bit (3),
      3 character_tally bit (1),
      3 dcw_type bit (2),
      3 tally bit (12);


/*	END INCULDE FILE gcos_fms_return_code_.incl.pl1	*/
