/* BEGIN INCLUDE FILE gcos_control_tables_.incl.pl1   (Wardd Multics)  09/11/80 1439.7 mst Thu */

dcl  gcos_control_tables_$    ext static;
dcl  gcos_control_tables_$activity_table ext static	/* table of info on each activity */;
dcl  gcos_control_tables_$cardtable (151) char (8) ext static	/* card type table */;
dcl  gcos_control_tables_$comp_offset fixed bin ext static	/* offset in cardtable where compilation activities begin */;
dcl  gcos_control_tables_$exc_offset fixed bin (17) ext static	/* offset in card lookup table where activity def'ns begin */;
dcl  gcos_control_tables_$filecard_count fixed bin ext static	/* length of filecard section of cardtable */;
dcl  gcos_control_tables_$nonact fixed bin ext static	/* offset in card lookup table where activity cards end  */;
dcl  gcos_control_tables_$tablelen fixed bin (17) ext static	/* length of card lookup table */;
dcl  gcos_control_tables_$tabstops ext static	/* table of tabstops for canonicalizing ascii input lines */;
dcl  gcos_control_tables_$totallen fixed bin ext static	/* length of cardtable, including unimplemented cards */;

/*   END INCLUDE FILE gcos_control_tables_.incl.pl1 */
