/* BEGIN INCLUDE FILE gcos_dbs_names.incl.pl1   (Wardd Multics)  06/08/81 1626.9 mst Mon */

dcl dbs_names (11)char(14)var static int options(constant)init(
  /*  1 */ "attach_file"
, /*  2 */ "dollar"
, /*  3 */ "filecode"
, /*  4 */ "mme_call"
, /*  5 */ "mme_inos_trace"
, /*  6 */ "trace_mme"
, /*  7 */ "nondollar"
, /*  8 */ "open_file"
, /*  9 */ "msf_test"
, /* 10 */ "stop_mme"
, /* 11 */ "mme_inos_stop"
);

dcl (
 dbs_attach_file	defined(gcos_ext_stat_$dbs(1))
,dbs_dollar	defined(gcos_ext_stat_$dbs(2))
,dbs_filecode	defined(gcos_ext_stat_$dbs(3))
,dbs_mme_call	defined(gcos_ext_stat_$dbs(4))
,dbs_mme_inos_trace	defined(gcos_ext_stat_$dbs(5))
,dbs_trace_mme	defined(gcos_ext_stat_$dbs(6))
,dbs_nondollar	defined(gcos_ext_stat_$dbs(7))
,dbs_open_file	defined(gcos_ext_stat_$dbs(8))
,dbs_msf_test	defined(gcos_ext_stat_$dbs(9))
,dbs_stop_mme	defined(gcos_ext_stat_$dbs(10))
,dbs_mme_inos_stop	defined(gcos_ext_stat_$dbs(11))
		) bit(1);

/*   END INCLUDE FILE gcos_dbs_names.incl.pl1 */
