/* BEGIN INCLUDE FILE gfms_do_files.incl.pl1   (Wardd Multics)  10/19/80 2212.5 mst Sun */

/* Hash list of files specified in -file, -no_file
   control arguments and in the file designated by
   the -input_file.
*/
dcl 1 file_names		aligned based(inp)
,     3 number_names	fixed bin
,     3 cat_start		(0:1020)fixed bin
,     3 file_start		(0:1020)fixed bin
,     3 file_name		(4500)
,       4 not		bit(1)unal
,       4 fill		bit(17)unal
,       4 link		fixed bin(17)unal
,       4 name		char(168)var
;

/*   END INCLUDE FILE gfms_do_files.incl.pl1 */
