/* BEGIN INCLUDE FILE gfms_version.incl.pl1 */
dcl version char(3)static int options(constant) init(
    "3.0"		);

/*   END INCLUDE FILE gfms_version.incl.pl1 */
