/* BEGIN INCLUDE FILE gfms_record_type_values.incl.pl1  (Planalp Multics)  08/24/78 1122.0 mst Thu */

dcl  CAT_CONTIN_RECORD        bit(6) static int options(constant) init("01"b3);
dcl  CAT_RECORD               bit(6) static int options(constant) init("00"b3);
dcl  FILE_RECORD              bit(6) static int options(constant) init("02"b3);
dcl  FREE_RECORD              bit(6) static int options(constant) init("77"b3);
dcl  RESV_RECORD              bit(6) static int options(constant) init("76"b3)		/* reserved record */;
dcl  TYPE_6                   bit(6) static int options(constant) init("06"b3)		/* type 6 has many meanings, i just call it TYPE_6 */;

/*   END INCLUDE FILE gfms_record_type_values.incl.pl1 */
