/* BEGIN INCLUDE FILE gtss_ascii_file_names.incl.pl1 */
/*
  Created:  (Wardd Multics)  09/01/78 1447.3 mst Fri 
*/

/**	First parameter to gtss_expand_pathname_
 **/
dcl 1 ascii_cat_file,
    2 nn    fixed bin,	/* Number of names. */
    2 name  (7)char(12);	/* List of cat/filedescr name . */

/*   END INCLUDE FILE gtss_ascii_file_names.incl.pl1 */
