/* BEGIN INCLUDE FILE gtss_defil_arg.incl.pl1 */
/*
  Created:  (Wardd Multics)  07/26/78 1714.5 mst Wed 
*/

dcl 1 arg aligned		based (arg_ptr)
     , 3 ascii_file_name	char (8)
     , 3 arg2
     ,   4 a		bit (06)unal
     ,   4 zeroes1		bit (11)unal
     ,   4 b		bit (01)unal
     ,   4 c		bit (01)unal
     ,   4 zeroes2		bit (05)unal
     ,   4 d		bit (12)unal
     ;

/*   END INCLUDE FILE gtss_defil_arg.incl.pl1 */
