/* BEGIN INCLUDE FILE gtss_msub_args.incl.pl1 */
/*
  Created: (Wardd Multics)  05/08/79 1438.0 mst Tue 
*/
dcl  msub_arg_list_ptr        ptr;
dcl 1 msub_arg_list		aligned based(msub_arg_list_ptr)
,     2 L_status		bit(18)unal
,     2 version		char(2)unal
,     2 L_entry		bit(18)unal
,     2 en		fixed bin(18)unsigned unal
,     2 L_input		bit(18)unal
,     2 in		fixed bin(18)unsigned unal
,     2 L_output		bit(18)unal
,     2 on		fixed bin(18)unsigned unal
;
/*   END INCLUDE FILE gtss_msub_args.incl.pl1 */
