/* BEGIN INCLUDE FILE gtss_restor_arg_list1.incl.pl1 */
/*
  Created: (Wardd Multics)  06/26/78 1308.1 mst Mon 
*/

dcl 1 arg_list1		aligned based(arg_list_ptr)
,     2 ascii_program_name	char(4)
,     2 loc		bit(18)unal
,     2 loc_use		bit(18)unal
,     2 tra		bit(18)unal
,     2 restor_type		bit(18)unal
;
/*   END INCLUDE FILE gtss_restor_arg_list1.incl.pl1 */
