/* BEGIN INCLUDE FILE gtss_device_cmds.incl.pl1 */
/*
  Created:  (Wardd Multics)  07/08/78 1503.0 mst Sat 
*/
dcl  read_cmd		bit(6)static int options(constant)init("25"b3);
dcl  seek_cmd		bit(6)static int options(constant)init("34"b3);
dcl  write_cmd		bit(6)static int options(constant)init("31"b3);
/*   END INCLUDE FILE gtss_device_cmds.incl.pl1 */
