/* BEGIN INCLUDE FILE gtss_db_names.incl.pl1 */
/*
  Created:  (Wardd Multics)  03/29/79 1909.1 mst Thu 
*/

/* To provide a new debugging switch:

   1) Locate the comment "Insert next entry above this comment".

   2) Place a new declaration for a db_ variable just
      above this comment, in the same manner as the
      current declaration just above the comment, using
      the next integer gtss_ext_$db index.

   3) Execute the gtss|db_names ted macro (this updates
      the sorted name table).

   4) Example use:

      if db_drl_grow then do;
      .
      .
      .
      debug i/o statements using com_err_ or ioa_
      .
      .
      .
      end;

*/

dcl (
 db_		bit(1) defined(gtss_ext_$db(01))
,db_CFP_input	bit(1) defined(gtss_ext_$db(02))
,db_drl_addmem	bit(1) defined(gtss_ext_$db(03))
,db_drl_defil	bit(1) defined(gtss_ext_$db(04))
,db_drl_filact	bit(1) defined(gtss_ext_$db(05))
,db_drl_filsp	bit(1) defined(gtss_ext_$db(06))
,db_drl_grow	bit(1) defined(gtss_ext_$db(07))
,db_drl_rew	bit(1) defined(gtss_ext_$db(08))
,db_filact_funct02	bit(1) defined(gtss_ext_$db(09))
,db_filact_funct03	bit(1) defined(gtss_ext_$db(10))
,db_filact_funct04	bit(1) defined(gtss_ext_$db(11))
,db_filact_funct05	bit(1) defined(gtss_ext_$db(12))
,db_filact_funct10	bit(1) defined(gtss_ext_$db(13))
,db_filact_funct11	bit(1) defined(gtss_ext_$db(14))
,db_filact_funct14	bit(1) defined(gtss_ext_$db(15))
,db_filact_funct18	bit(1) defined(gtss_ext_$db(16))
,db_filact_funct19	bit(1) defined(gtss_ext_$db(17))
,db_filact_funct21	bit(1) defined(gtss_ext_$db(18))
,db_filact_funct22	bit(1) defined(gtss_ext_$db(19))
,db_interp_prim	bit(1) defined(gtss_ext_$db(20))
,db_ios		bit(1) defined(gtss_ext_$db(21))
,db_run_subsystem	bit(1) defined(gtss_ext_$db(22))
,db_drl_t_cfio	bit(1) defined(gtss_ext_$db(23))
,db_drl_switch	bit(1) defined(gtss_ext_$db(24))
,db_drl_dio	bit(1) defined(gtss_ext_$db(25))
,db_drl_retfil	bit(1) defined(gtss_ext_$db(26))
,db_drl_msub	bit(1) defined(gtss_ext_$db(27))
,db_drl_callss	bit(1) defined(gtss_ext_$db(28))
,db_drl_rstswh	bit(1) defined(gtss_ext_$db(29))
,db_drl_setswh	bit(1) defined(gtss_ext_$db(30))
,db_mcfc		bit(1) defined(gtss_ext_$db(31))
,db_dq		bit(1) defined(gtss_ext_$db(32))
,db_abs		bit(1) defined(gtss_ext_$db(33))
,db_attributes_mgr	bit(1) defined(gtss_ext_$db(34))
,db_expand_pathname bit(1) defined(gtss_ext_$db(35))
,db_drl_part	bit(1) defined(gtss_ext_$db(36))
,db_drl_morlnk	bit(1) defined(gtss_ext_$db(37))
,db_drl_kin	bit(1) defined(gtss_ext_$db(38))
/* Insert next entry above this comment. */
);

/* Table of sorted names. */
dcl 1 debug_bit_names (38) static int options(constant)
,     2 name char(18)var init(
         "" ,"CFP_input" ,"abs" ,"attributes_mgr" ,"dq" ,"drl_addmem"
         ,"drl_callss" ,"drl_defil" ,"drl_dio" ,"drl_filact" ,"drl_filsp"
         ,"drl_grow" ,"drl_kin" ,"drl_morlnk" ,"drl_msub" ,"drl_part"
         ,"drl_retfil" ,"drl_rew" ,"drl_rstswh" ,"drl_setswh" ,"drl_switch"
         ,"drl_t_cfio" ,"expand_pathname" ,"filact_funct02" ,"filact_funct03"
         ,"filact_funct04" ,"filact_funct05" ,"filact_funct10" ,"filact_funct11"
         ,"filact_funct14" ,"filact_funct18" ,"filact_funct19" ,"filact_funct21"
         ,"filact_funct22" ,"interp_prim" ,"ios" ,"mcfc" ,"run_subsystem"
			)
,     2 value fixed bin init(
         01 ,02 ,33 ,34 ,32 ,03 ,28 ,04 ,25 ,05 ,06 ,07 ,38 ,37 ,27 ,36 ,26 ,08
         ,29 ,30 ,24 ,23 ,35 ,09 ,10 ,11 ,12 ,13 ,14 ,15 ,16 ,17 ,18 ,19 ,20 ,21
         ,31 ,22
			);
/* End of table. */
/*   END INCLUDE FILE gtss_db_names.incl.pl1 */
