/* Begin include file host_table_dcls.incl.pl1 */

dcl  host_table_mgr_$address entry (char (*) var, char (*) var) returns (char (40) var);
dcl  host_table_mgr_$host_list entry (char (*) var) returns (ptr);
dcl  host_table_mgr_$name_given_address entry (char (*) var, char (*) var) returns (char (40) var);
dcl  host_table_mgr_$net_list entry (char (*) var) returns (ptr);
dcl  host_table_mgr_$primary_name entry (char (*) var) returns (char (40) var);
dcl  host_table_mgr_$shortest_name entry (char (*) var) returns (char (40) var);

dcl  nit_$get_forwarding_host entry (varying char (*), varying char (*)) returns (varying char (40));
dcl  nit_$get_service_list entry (varying char(*), varying char (*)) returns (ptr);

dcl  net_list_ptr ptr;
dcl  n_nets fixed bin;
dcl  NET_LIST_VERSION_2 char (8) aligned static options (constant) init ("hnetlst1");
dcl  1 net_list aligned based (net_list_ptr),
       2 version char (8),
       2 n_nets fixed bin,
       2 net (n_nets refer (net_list.n_nets)),
         3 number fixed bin,
         3 name varying char (40),
         3 address varying char (40);

dcl  host_list_ptr ptr;
dcl  n_hosts fixed bin;
dcl  HOST_LIST_VERSION_2 char (8) aligned static options (constant) init ("hostlst2");
dcl  1 host_list aligned based (host_list_ptr),
       2 version char (8),
       2 n_hosts fixed bin,
       2 host (n_hosts refer (host_list.n_hosts)),
         3 name varying char (40);

dcl  n_services fixed bin;
dcl  service_list_ptr ptr;
dcl  1 service_list aligned based (service_list_ptr),
       2 version char (4),
       2 n_services fixed bin,
       2 service (n_services refer (service_list.n_services)),
         3 type char (8),
         3 module varying char (168),
         3 argument varying char (168);

/* End include file host_table_dcls.incl.pl1 */
