/* BEGIN INCLUDE FILE ... installation_parms.incl.pl1 */

/* Modified 740723 by PG to add short AIM access names */
/* Modified Fall 1977 by T. Casey to add fatal loop and trm_ signal parameters */
/* Modified 04/03/78 by CDT to add rcp_init_flags structure */
/* Modified May 1978 by T. Casey to add resource timer and resource price list parameters */
/* Modified November 1978 by T. Casey for MR7.0, to add absentee control parameters */
/* Modified 17 September 1980 by G. Palter to add default absentee queue */
/* Modified April 1981 by E. N. Kittlitz for chn_wakeup_error_loop, chn_wakeup_error_count */
/* Modified June 1981 by E. N. Kittlitz for nrates/rate_structures UNCA rate_structure support.
     Version, expand foregound_cpu_default_limit and abs_cpu_max_limit to fixed bin (35) fields.
     nrscp & resource array moved from offset 2064 (octal) to 2400 (octal). */
/* Modified 1984-06-19 BIM to remove obsolete fields, and add 
		       strict_trusted_path. */
/* Modified 1984-10-24 BIM for default_pdir_quota. */
/* Modified 1984-12-05 BIM for require_operator_login. */
/* Modified 1985-03-01 by E. Swenson for password flags. */


/****^  HISTORY COMMENTS:
  1) change(86-01-27,MSharpe), approve(87-05-25,MCR7690),
     audit(87-03-29,GDixon), install(87-08-04,MR12.1-1056):
     added vchn_requires_accept parameter.
  2) change(87-02-17,GDixon), approve(87-05-25,MCR7680),
     audit(87-06-02,Parisek), install(87-08-04,MR12.1-1056):
     Correct formatting problems.
                                                   END HISTORY COMMENTS */


/* NOTE: rate_structure.incl.pl1 uses these declarations */


dcl 1 installation_parms based (ip) aligned,		/* describes installation parameters */
    2 part_1 like installation_parms_part_1 aligned,
    2 resource (0 refer (installation_parms.nrscp)) like installation_parms_resource_array_part aligned;

dcl  installation_parms_version_1 fixed bin init (1) static internal options (constant);
dcl  installation_parms_version_2 fixed bin init (2) static internal options (constant);

dcl 1 installation_parms_part_1 based aligned,		/* Used only by installation_parms and rate_structure */
    2 installation_id char (32),			/* Name printed at dialup and in who */
    2 company char (64),				/* company name */
    2 department char (64),				/* department */
    2 companyds char (120),				/* company, double spaced */
    2 departmentds char (120),			/* dpeartment double spaced */
    2 shifttab (336) bit (3) unal,			/* half-hrs from 0000 Mon, value is shift no */
    2 cpu_price (0: 7) float bin,			/* price for cpu hour, by shift */
    2 log_base_price (0: 7) float bin,			/* price for log hour, by shift */
    2 io_ops_price (0: 7) float bin,			/* price per 1000 terminal io ops */
    2 core_price (0: 7) float bin,			/* price for core page-hour, by shift */
    2 ndevices fixed bin,				/* number of devices to charge */
    2 devtab (16),					/* Maximum 16 */
      3 device_id char (8),				/* Name of device */
      3 device_price (0: 7) float bin,			/* Price by shift */
    2 inactive_time fixed bin,			/* seconds of inactivity permitted */
    2 warning_time fixed bin,				/* seconds from warning to logout */
    2 login_time fixed bin,				/* seconds in which to complete login */
    2 acct_update fixed bin,				/* seconds between acct update */
    2 login_tries fixed bin,				/* number of login tries allowed */
    2 disk_price float bin,				/* disk rate, in $/page-sec */
    2 registration_price float bin,			/* fee per month per user */
    2 dolsign char (1),				/* "dollar sign" */
    2 abs_cpu_price (4) float bin,			/* price for absentee cpu by queue */
    2 abs_mem_price (4) float bin,			/* Absentee memory charge */
    2 iod_rec_price (4) float bin,			/* price for io daemon lines, per K, by queue */
    2 abs_timax (4) fixed bin (35),			/* Absentee TIMAX parameter */
    2 abs_cpu_default_limit (4) fixed bin (35),		/* default absentee cpu limit in seconds (changed from usec.) */
    2 syserr_log_copy_threshold fixed bin (9),		/* Threshold (in PAGES) at which the
						   Initializer will copy the syserr_log */
    2 default_pdir_seg_quota fixed bin (17) unaligned,	/* if system and project say 0 */
    2 default_pdir_dir_quota fixed bin (17) unaligned,       /* Always used */
    2 fatal_error_loop_count fixed bin (17) unaligned,
    2 fatal_error_loop_seconds fixed bin (17) unaligned,
    2 term_real_time_seconds fixed bin (17) unaligned,
    2 term_cpu_time_seconds fixed bin (17) unaligned,
    2 rcp_init_flags like rcp_init_flags aligned,		/* one word long */
    2 rsc_timer_seconds fixed bin (17) unaligned,		/* time interval at which to check for resource availability */
    2 pad_old_fg_cpu_default_limit bit (18) unaligned,
    2 foreground_queue_position fixed bin (17) unal,	/* queue that foreground queue comes after */
    2 idle_time_constant_seconds fixed bin (17) unal,	/* how far back to maintain moving average of load */
    2 sus_cpu_time_seconds fixed bin (17) unal,		/* allow suspended process this much cpu time */
    2 sus_real_time_seconds fixed bin (17) unal,		/* and this much real time, before bumping it */
    2 foreground_cpu_default_limit fixed bin (35),	/* default cpu time limit (sec) for foreground absentee jobs */
    2 access_authorization_ceiling bit (72),		/* "System high" access authorization. */
    2 level_names (0:7) char (32),			/* Names for security levels. */
    2 category_names (18) char (32),			/* Names for security categories. */
    2 short_level_names (0:7) char (8),			/* Abbreviated level names. */
    2 short_category_names (18) char (8),		/* Abbreviated category names. */
    2 ncon fixed bin,				/* Number of config elements. */
    2 cona (51),					/* each entry is 5 words long */
      3 cpu fixed bin (5) unal,			/* Number of CPU's */
      3 shift fixed bin (5) unal,			/* Shift number */
      3 x1 fixed bin (23) unal,
      3 kmem fixed bin (17) unal,			/* Memory size */
      3 kbulk fixed bin (17) unal,			/* Bulk store size */
      3 x2 fixed bin (17) unal,
      3 maxa fixed bin (11) unal,			/* Max abs users */
      3 maxq fixed bin (5) unal,			/* Max abs q */
      3 maxu_base fixed bin (17) unal,
      3 response_high fixed bin (17) unal,
      3 response_low fixed bin (17) unal,
      3 x3 fixed bin (17) unal,

/* Absentee control parameters. New for MR7.0 */

    2 max_abs (0:7) fixed bin (17) unal,		/* per-shift upper limit on abs_maxu */
    2 min_abs (0:7) fixed bin (17) unal,		/* per-shift lower limit on abs_maxu */
    2 pct_abs (0:7) fixed bin (17) unal,		/* abs_maxu is this pct (per-shift) of idle units */

    2 max_qres (0:7, 4) fixed bin (17) unal,		/* per-shift-and-queue upper limit on reserved slots */
    2 min_qres (0:7, 4) fixed bin (17) unal,		/* per-shift-and-queue lower limit on reserved slots */
    2 pct_qres (0:7, 4) fixed bin (17) unal,		/* reserved slots are these pcts of abs_maxu */

    2 abs_cpu_max_limit (0:7, 4) fixed bin (35),		/* per-shift-and-queue upper limit (sec) on jobs' cpu times */

    2 default_absentee_queue fixed binary (17) unaligned,	/* default absentee queue for ear, etc. */

    2 chn_wakeup_error_loop_count fixed bin (17) unaligned, /* maximum number of channel wakeups in following interval */
    2 chn_wakeup_error_loop_seconds fixed bin (17) unaligned, /* works like fatal_error_loop_count/seconds */
    2 rate_structure_number fixed bin (17) unaligned,	/* rate_structure number of this RS */
    2 version fixed bin (35),				/* must be 2 */
    2 nrates fixed bin,				/* number of rate structures */
    2 rate_structures (0:9) char (32),			/* names of rate_structures */
    2 trusted_path_login bit (1) aligned,		/* forbid logout -hold and new_proc -auth */
    2 require_operator_login bit (1) aligned,		/* just what it says */
    2 operator_inactive_time fixed bin,			/* seconds between commands --> not logged in. */
    2 validate_daemon_commands bit (1) aligned,		/* force existence and adequate access to 
						   mcacs segments for operators */
    2 password_min_length fixed bin,			/* minimum length of passwords */
    2 password_gpw_length fixed bin,			/* length of generated passwords */
    2 password_change_interval fixed bin,		/* number of days until must change */
    2 password_expiration_interval fixed bin,		/* number of days that a password may remain unused */
    2 vchn_requires_accept bit (1) aligned,		/* "login personid -op -vchn foo" must be
						   "accepted" by operator if personid is not 
						   signed on system console */
    2 end_pad (219) bit (36) aligned,			/* leave plenty of pad before the variable length price list */
    2 nrscp fixed bin;				/* length of resource price array; must have offset 2400 (octal),
						   or someone miscounted when using part of pad2 */


/* Entries in the following array may be accessed via system_info_$resource_price.
   This array should not be accessed directly, since its format will change in subsequent releases of Multics. */

dcl 1 installation_parms_resource_array_part (0 refer (installation_parms.nrscp)) based,
      2 name char (32),
      2 price float bin;

%include rcp_init_flags;

/* END INCLUDE FILE ... installation_parms.incl.pl1 */
