/* Begin include file ..... io_log_status_info.incl.pl1 */

/* This include file defines a data base used to determine whether or not a
   particular I/O error should be logged, and whether or not detailed device
   status should be logged with it. */
/* Prepared December 1979 by Larry Johnson */

dcl  io_log_status_info$io_log_status_info ext;

dcl  io_log_infop ptr;

dcl 1 io_log_info aligned based (io_log_infop),
    2 ndev fixed bin,				/* Number of devices in table */
    2 log_entry (0 refer (io_log_info.ndev)) like log;

dcl  logp ptr;

dcl 1 log aligned based (logp),
    2 dev_name char (3) unal,				/* Tap, dsk, prt, etc. */
    2 status (0:15, 0:63) bit (1) unal,			/* For loggin status */
    2 detail (0:15, 0:63) bit (1) unal;			/* For logging detaied status */

/* End include file io_log_status_info.incl.pl1 */

