


	/* the include file for LCLIT */

declare 1 eb_data_$lclit ext aligned,
        2 (lplit,	lclit(2) ) fixed bin (17) aligned ;



	/* end of the include file for LCLIT */

