


	/* the include file for LCSECT */

declare 1 eb_data_$lcsect ext aligned,
        2 (lpsect,	lcsect(2) ) fixed bin (17) aligned ;



	/* end of the include file for LCSECT */

