/* BEGIN INCLUDE FILE linus_table_control.incl.pl1 */

/* HISTORY: written 9/8/82 Dave Schimke    */

dcl 1 table_control_info   based (table_control_ip),
      2 selection_expression_identifier fixed bin, /* current processed lila */
                                                   /*   expression           */
      2 row_info_ptr ptr init(null),               /* saved row_segs_ip      */
      2 component_ptrs_ptr ptr init(null),         /* ptr to array of        */
                                                   /*   component ptrs       */
      2 max_number_of_components fixed bin,        /* limit of msf_seg_count */
      2 msf_seg_count fixed bin init (0),          /* number of components in*/
                                                   /*  the msf               */
      2 max_number_of_rows_per_seg fixed bin(21),  /* number of rows that    */
                                                   /*  will fit in each      */
                                                   /*  component of the msf  */
      2 retrieval_id fixed bin init(0),            /* id of this retrieval   */
                                                   /*  (for sync)            */
      2 table_info_ptr     ptr init (null),	 /* table state info       */
      2 fcb_ptr      ptr init (null),	           /* ptr to file control    */
                                                   /*  block of table_msf    */
      2 table_msf	      char (27) init (""),	 /* name of table msf      */
      2 temp_directory    char (168) init (""),	 /* temp_dir for table     */
      2 info_area_ptr     ptr init (null),	 /* area for table_info    */
      2 work_area_ptr     ptr init (null),	 /* work area for all      */
                                                   /*   other needs          */
      2 incremental_retrieval_arg_ptr 
                          ptr init (null),         /* ptr to arg list used   */
                                                   /*  for "-another" calls  */
      2 incremental_retrieval_char_ptr
                          ptr init (null),         /* ptr to char descriptors*/
                                                   /*  for arg list          */
      2 char_output_string_ptr ptr init (null),    /* ptr to character string*/
      2 current_component_ptr ptr init (null),     /* ptr to the component   */
                                                   /*  currently being loaded*/
      2 current_seg_row_count fixed bin(35) init (0),
                                                   /* number of rows in      */
                                                   /*  current seg           */
      2 flags,
        3 permanent aligned bit(1),                /* "1"b if non-disposable */
        3 sorted    bit(1),                        /* has table been sorted? */
        3 mbz1      bit(34) unal;

dcl table_control_ip ptr;

/* END INCLUDE FILE linus_table_control.incl.pl1 */

