/* BEGIN INCLUDE FILE linus_scal_fn_info.incl.pl1 -- jaw 6/23/77 */

dcl 1 scal_fn_info aligned based (sclfi_ptr),		/* names of user-dcl scalar functions */
    2 fwd_ptr ptr,					/* pointer tonext name in list */
    2 name char (32);				/* function name */

dcl  sclfi_ptr ptr;

/* END INCLUDE FILE linus_scal_fn_info.incl.pl1 */
