/* BEGIN INCLUDE FILE linus_source.incl.pl1 -- jaw 7/12/77 */

dcl  source_str char (lcb.lila_chars) based (ls_header.src_ptr);
dcl  source_array (lcb.lila_chars) char (1) based (ls_header.src_ptr);

/* END INCLUDE FILE linus_source.incl.pl1 */
