/* lisp number format -- overlaid on standard its pointer. */


dcl 1 fixnum_fmt based aligned,
      2 type_info bit(36) aligned,
      2 fixedb fixed bin,

    1 flonum_fmt based aligned,
      2 type_info bit(36) aligned,
      2 floatb float bin,

    fixnum_type bit(36) aligned static init("000000000000000000000100000000100111"b),
    flonum_type bit(36) aligned static init("000000000000000000000010000000100111"b);

/* end of lisp number format */

