/***** BEGIN INCLUDE FILE lisp_string_fmt.incl.pl1 *****
   describes format of storage for lisp
   character strings.
   D. Reed 4/1/71 */

dcl 1 lisp_string based aligned,
      2 string_length fixed bin,
      2 string char(1 refer(string_length));

/***** END INCLUDE FILE lisp_string_fmt.incl.pl1 */
