	/* INCLUDE FILE lisp_io.incl.pl1   */

	/* data structures used by the lisp i/o system */

%include lisp_iochan;

	/* masks for checking iochan.flags, seeing if  lisp_io_control_$fix_not_ok_iochan should be called */

dcl not_ok_to_read bit(36) static init("0100010001"b),	/* mask for checking iochan.flags on input */
    not_ok_to_write bit(36) static init("0010010001"b);/* mask for checking iochan.flags on output */
dcl not_ok_to_read_fixnum bit(36) static init("0100010000"b),
    not_ok_to_write_fixnum bit(36) static init("0010010000"b);


	/* miscellaneous global, static variables and atoms used by the I/O system */

dcl lisp_static_vars_$read_print_nl_sync bit(36)  ext,
    read_print_nl_sync bit(36) defined (lisp_static_vars_$read_print_nl_sync),
    lisp_static_vars_$ibase ext fixed bin(71),
    ibase fixed bin(71) defined (lisp_static_vars_$ibase),

    lisp_static_vars_$quote_atom ext fixed bin (71),
    quote_atom fixed bin(71) defined (lisp_static_vars_$quote_atom),

    lisp_static_vars_$base ext fixed bin(71),
    base fixed bin(71) defined ( lisp_static_vars_$base),

    lisp_static_vars_$stnopoint ext fixed bin(71),
    stnopoint fixed bin(71) defined (lisp_static_vars_$stnopoint),

     lisp_static_vars_$tty_atom ext fixed bin(71),
     tty_atom fixed bin(71) defined (lisp_static_vars_$tty_atom),
     lisp_static_vars_$status_gctwa ext fixed bin(71),
     status_gctwa fixed bin(71) defined (lisp_static_vars_$status_gctwa),

    lisp_static_vars_$s_atom ext fixed bin(71),
    s_atom fixed bin(71) defined (lisp_static_vars_$s_atom),

    lisp_static_vars_$readtable ext fixed bin(71),
    readtable fixed bin(71) defined (lisp_static_vars_$readtable),

    lisp_static_vars_$plus_status ext fixed bin(71),
    plus_status fixed bin(71) defined (lisp_static_vars_$plus_status);

%include lisp_control_chars;
	/* END INCLUDE FILE lisp_io.incl.pl1 */

