/* BEGIN INCLUDE FILE ... ls_usage_types.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(86-06-30,Coren), approve(86-06-30,MCR7415),
     audit(86-07-02,Margolin), install(86-07-11,MR12.0-1092):
     Initial implementation.
  2) change(87-05-26,GDixon), approve(87-07-13,MCR7679),
     audit(87-07-16,Brunelle), install(87-08-04,MR12.1-1056):
      A) Add LS_USAGE_VALUES constant array.
                                                   END HISTORY COMMENTS */

/* Defines the permissible values for the "usage_type" field in the acctive_connection_list entry and elsewhere */

dcl (LS_ENDPOINT_USAGE initial (0),			/* an endpoint for logins, UFT, etc */
     LS_LOGIN_USAGE initial (1),			/* primary login connection */
     LS_DIAL_USAGE initial (2),			/* assigned to dial server */
     LS_DIAL_OUT_USAGE initial (3),			/* user did dial_out operation */
     LS_SLAVE_ATTACH_USAGE initial (4),			/* user did slave attachment */
     LS_MC_USAGE initial (5))				/* message coordinator channel */
        fixed bin internal static options (constant);

dcl  LS_USAGE_VALUES (0:5) char(16) varying int static options(constant) init(
	"endpoint",
	"login",
	"dial-in",
	"dial-out",
	"slave attach",
	"msg coord");

/* END INCLUDE FILE ... ls_usage_types.incl.pl1 */
