/* --------------- BEGIN include file lsm_entry_dcls.incl.pl1 --------------- */

dcl  lsm_$get_blk entry (ptr, fixed bin (18), fixed bin, fixed bin, ptr, fixed bin (35)),
     lsm_$make_blk entry (ptr, fixed bin (18), fixed bin, fixed bin, ptr, fixed bin (35)),
     lsm_$mk_char entry (ptr, char (*), fixed bin (18)),
     lsm_$replace_blk entry (ptr, fixed bin (18), fixed bin (18), fixed bin (35)),
     lsm_$replicate entry (ptr, fixed bin (18), fixed bin (18), fixed bin (35)),
     lsm_$set_blk entry (ptr, fixed bin (18), fixed bin, fixed bin, ptr, fixed bin (35));

dcl  lsm_fs_$compact entry (ptr, fixed bin (18), fixed bin (35)),
     lsm_fs_$free entry (ptr, fixed bin (35)),
     lsm_fs_$init entry (ptr, fixed bin (35)),
     lsm_fs_$init_seg entry (ptr, char (*), char (*), fixed bin, fixed bin (35)),
     lsm_fs_$merge_symbol entry (ptr, ptr, fixed bin (18), bit (1), fixed bin, fixed bin (35)),
     lsm_fs_$move_struc entry (ptr, ptr, fixed bin (18), fixed bin (18), fixed bin (35)),
     lsm_fs_$pull entry (ptr, char (*), char (*), fixed bin (35)),
     lsm_fs_$push entry (ptr, char (*), char (*), fixed bin (35));

dcl  lsm_sym_$find_table entry (pointer, fixed bin (18), fixed bin (35)),
     lsm_sym_$sym_list entry (ptr, (*) fixed bin (18), fixed bin, fixed bin (35)),
     lsm_sym_$symk entry (ptr, fixed bin, char (*), fixed bin (18), fixed bin (18), fixed bin (35)),
     lsm_sym_$symn entry (ptr, fixed bin, fixed bin (18), fixed bin (18), fixed bin (18), fixed bin (35));

dcl (Find_symbol initial (0),				/* op codes for lsm_sym_$symk and lsm_sym_$symn */
     Find_or_create_symbol initial (1),
     Create_symbol initial (2),
     Delete_symbol initial (3)) fixed bin static options (constant);

dcl (Find_seg initial (0),				/* Opcodes for lsm_fs_$init_seg */
     Create_seg initial (1),
     Clear_seg initial (2)) fixed bin static options (constant);

/* ---------------- END include file lsm_entry_dcls.incl.pl1 ---------------- */
