/* Begin mca_constants.incl.pl1 */




/****^  HISTORY COMMENTS:
  1) change(86-03-19,Fawcett), approve(86-03-19,MCR7374),
     audit(86-04-28,Lippard), install(86-09-16,MR12.0-1159):
     Constants used for values returned from MCA.
                                                   END HISTORY COMMENTS */

dcl  NO_CONFIG_PRESENT fixed bin init (0) static options (constant);
dcl  NOT_CONFIGED fixed bin init (1) static options (constant);
dcl  PH_NOT_PRESENT fixed bin init (2) static options (constant);
dcl  BASIC_ROM_FAILED fixed bin init (3) static options (constant);
dcl  JAM_FAILED fixed bin init (4) static options (constant);
dcl  SELF_FAILED fixed bin init (5) static options (constant);
dcl  HW_ID_NO_MATCH fixed bin init (6) static options (constant);
dcl  CON_SET_UP_FAILED fixed bin init (7) static options (constant);
dcl  RSO_FAILED fixed bin init (8) static options (constant);
dcl  FW_NOT_FOUND fixed bin init (9) static options (constant);
dcl  FW_LOAD_FAILED fixed bin init (10) static options (constant);
dcl  ALTER_NOT_FOUND fixed bin init (11) static options (constant);
dcl  ALTER_LOAD_FAILED fixed bin init (12) static options (constant);
dcl  FW_EXEC_FAILED fixed bin init (13) static options (constant);
dcl  OPERATIONAL fixed bin init (14) static options (constant);
dcl  STOP_ON_COND fixed bin init (15) static options (constant);

dcl  PSIA_2_TRIP fixed bin init (1) static options (constant);
dcl  IPC_PDSI fixed bin init (2) static options (constant);
dcl  IPC_CONS_2 fixed bin init (3) static options (constant);
dcl  IPC_DAI fixed bin init (4) static options (constant);
dcl  IPC_IDI fixed bin init (5) static options (constant);
dcl  IPC_TAPE_FIPS fixed bin init (6) static options (constant);
dcl  IPC_DISK_FIPS fixed bin init (7) static options (constant);
dcl  NDIC fixed bin init (9) static options (constant);
dcl  PSIA_4_TRIP fixed bin init (15) static options (constant);
 
dcl TYPE (0:15) char (9) init ("N/A","psia_2","ur-pdsi","cons_2","ur-dai",
			"idi","fips","fips","N/A","ndic",
			"N/A","N/A","N/A","N/A","N/A","psia_4");
	

/* End mca_constants.incl.pl1 */