/* Begin include file mcacs_access_modes.incl.pl1 BIM 1984-12-26 */

declare (
         MCACS_C_ACCESS     init ("1"b),		/* Control (login, logout, new_proc) */
         MCACS_D_ACCESS     init ("01"b),		/* Daemon (use this as login source) */
         MCACS_Q_ACCESS     init ("001"b),		/* Quit */
         MCACS_R_ACCESS     init ("0001"b)		/* Reply */
         ) bit (36) aligned internal static options (constant);

/* End include file mcacs_access_modes.incl.pl1 */
