/* BEGIN mdbm_comp_val_list.incl.pl1 -- jaw, 2/23/79 */


/****^  HISTORY COMMENTS:
  1) change(85-11-17,Dupuis), approve(85-12-16,MCR7314),
     audit(86-02-04,Brunelle), install(86-02-05,MR12.0-1013):
     This entry is being made to cover the change made on 85-10-13 by John
     Hergert. (see mrds #138, phx19901)
                                                   END HISTORY COMMENTS */

/* HISTORY:
   Modified by Al Kepner, June 22, 1979 to provide for comparing two
   values from the same tuple.

   82-10-12 Davids: changed rel_id from bit (12) to bit (36) aligned.

   82-10-26 Woodka: deleted fields attr_pos_ind and attr_pos_ind2, 
   no longer needed.

   84-08-07 Thanh Nguyen: Added c_ai_ptr and c_ai_ptr2 (ptr for 
   rm_attr_info).  These ptrs will be needed for checking of decoded proc
   if we only have an attribute and exp_ptr is null.

   85-10-13 John Hergert: removed c_ai_ptr for fixes for TRs phx19901
   and phx11536. c_ai_ptr2 is now used as a flag to tell mu_retrieve
   that the first comaparand is an expression and the second one should 
   be decoded.
 */

dcl 1 comp_val_list aligned based (cvl_ptr),		/* compar. list for hash search */
    2 nvals fixed bin,
    2 rel_id bit (36) aligned,			/* id of relation being searched */
    2 val (cvl_nvals_init refer (comp_val_list.nvals)),
      3 match_ptr ptr,				/* pointer to second comparison value
						   when it is not in the current tuple
						   or null (if both values are from the current tuple.) */
      3 exp_ptr ptr,				/* to expr to be evaluated, or null */
      3 exp_ptr2 ptr,				/* to expr to be evaluated, or null */
      3 c_ai_ptr2 ptr,                                      /* to rm_attr_info, and only be used when exp_ptr2 is not null. */
      3 erslt_ptr ptr,				/* to result of first expression */
      3 erslt_ptr2 ptr,				/* to result of second expression */
      3 op fixed bin,				/* 1 => =
						   2 => ^=
						   3 => <
						   4 => <=
						   5 => >
						   6 => >= */
      3 desc1 bit (36),				/* descriptor for first comparison value */
      3 desc2 bit (36),				/* descriptor for second comparison value */
      3 attr_ind fixed bin,				/* attr. index for first value */
      3 attr_ind2 fixed bin,				/* attr. index for 2nd value in same tuple or 0 */
      3 pad bit (36);				/* fill to double word boundary. */

dcl  cvl_ptr ptr int automatic init (null ());
dcl  cvl_nvals_init fixed bin;

dcl ((CVL_EQ init (1)),
    (CVL_NE init (2)),
    (CVL_LT init (3)),
    (CVL_LE init (4)),
    (CVL_GT init (5)),
    (CVL_GE init (6))) fixed bin int static options (constant);

dcl 1 cvl_array aligned based (cvla_ptr),		/* array of lists */
    2 nlists fixed bin,
    2 list_ptr (cvla_nlists_init refer (cvl_array.nlists)) ptr;

dcl  cvla_nlists_init fixed bin;
dcl  cvla_ptr ptr int automatic init (null ());

/* END mdbm_comp_val_list.incl.pl1 */

