/* BEGIN INCLUDE FILE mdbm_modes_uids.incl.pl1 -- jccj 5/1/78 */

dcl 1 modes_uids aligned based (mu_ptr),		/* mode/uid combination */
    2 mu_nargs fixed bin,				/* number of modes/user_ids specified */
    2 mu (mu_nargs_init refer (modes_uids.mu_nargs)),
      3 chars char (4),				/* mode character combinations
						   Input:  for set_acl
						   Output:  for delete_acl
						   Blank:  for list_acl   */
      3 name char (32);				/* access identifiers */

dcl  mu_ptr ptr;
dcl  mu_nargs_init fixed bin;

/* END INCLUDE FILE mdbm_modes_uids.incl.pl1 */

