/* BEGIN mdbm_change_bits.incl.pl1 -- jaw 12/04/78 */

dcl  change_bits (ncbs) bit (1) unal based (cbp);

dcl  ncbs fixed bin;
dcl  cbp ptr;

/* END mdbm_change_bits.incl.pl1 */

