/* BEGIN INCLUDE FILE mdbm_model_files.incl.pl1 -- jccj 9/29/78 */

dcl 1 model_files aligned based (model_files_ptr),
    2 nfiles fixed bin,
    2 name (model_files_init refer (model_files.nfiles)) char (30); /* file names */

dcl  model_files_init fixed bin;
dcl  model_files_ptr ptr;

/* END INCLUDE FILE mdbm_model_files.incl.pl1 */

