/* declaration of the misc charges file */

dcl 1 misc_file based (miscfilep) aligned,
    2 misc_ents fixed bin,
    2 padmisc (7) fixed bin,
    2 misctab (100),
      3 mdate fixed bin (71),
      3 mproj char (12),
      3 mamt float bin,
      3 mpad fixed bin (71),
      3 mdesc char (64);

/* end miscfile */
