/* BEGIN INCLUDE FILE ... mlsys_delete_error_info.incl.pl1 */
/* Created:  June 1983 by G. Palter */

/* Describes why the mail system could not delete a message which was marked for deletion: passed to the caller of
   mail_system_$close_mailbox or mail_system_$expunge_messages via sub_err_ */

dcl  1 delete_error_info aligned based (delete_error_info_ptr),
     2 version character (8) unaligned,
     2 message_number fixed binary,			/* set to index of message which couldn't be deleted */
     2 code fixed binary (35),			/* set to indicate why message could not be deleted */
     2 additional_info character (256) varying;		/* set to additional information to be displayed with the
						   error message for the above status code */

dcl  DELETE_ERROR_INFO_VERSION_1 character (8) static options (constant) initial ("mlsdel01");

dcl  delete_error_info_ptr pointer;

/* END INCLUDE FILE ... mlsys_delete_error_info.incl.pl1 */
