/* BEGIN INCLUDE FILE ... mlsys_data.incl.pl1 */
/* Created:  20 Decembber 1978 by G. Palter */
/* Modified: 1 July 1983 by G. Palter to merge with mlsys_internal_data_ */

/* Constants defined by the Multics mail system for external use */

dcl  mlsys_data_$system_directory character (168) external; /* directory containing per-system data (mail table/queues) */


/* Static data defined by the Multics mail system for external use */

dcl  mlsys_data_$user_default_mailbox_address pointer external;
						/* -> the address of the user's default mailbox */
dcl  mlsys_data_$user_mail_table_address pointer external;	/* -> the address of the user's entry in the mail table */
dcl  mlsys_data_$user_logbox_address pointer external;	/* -> the address of the user's logbox */

/* END INCLUDE FILE ... mlsys_data.incl.pl1 */
