/*  BEGIN INCLUDE FILE:	mowse.incl.pl1			  *  *  *  *  *  *  *  *  *  *  *  *  */

/****^  HISTORY COMMENTS:
  1) change(86-09-17,Flegel), approve(86-12-16,MCR7580),
     audit(86-12-15,Gilcrease), install(87-01-06,MR12.0-1255):
     Created.
  2) change(86-10-03,Flegel), approve(86-12-16,MCR7580),
     audit(86-12-15,Gilcrease), install(87-01-06,MR12.0-1255):
     Combined mowse_minor_caps.incl.pl1 and
     mowse.incl.pl1 so that programmer only needs include mowse.incl.pl1
  3) change(86-11-27,Flegel), approve(86-11-27,MCR7580),
     audit(86-12-15,Gilcrease), install(87-01-06,MR12.0-1255):
     Approved.
  4) change(87-07-31,Flegel), approve(87-07-31,MCR7580),
     audit(87-07-31,RBarstad), install(87-08-07,MR12.1-1075):
     Changes to support async call channels.
                                                   END HISTORY COMMENTS */

/* Name of MOWSE temp seg for data */

/* format: style4,indattr,ifthen,^indcomtxt,thendo,^indproc,^indblkcom,initcol1,declareind8,dclind4,struclvlind3,comcol55 */
dcl temp_seg_name	       char (6) init ("MOWSE_");

/* Version number */

dcl MOWSE_VERSION_	       char (8) int static options (constant) init ("version1");

/* System identification */

dcl LOCAL_SYSTEM	       fixed bin int static options (constant) init (32);
dcl REMOTE_SYSTEM	       fixed bin int static options (constant) init (33);

/* Status request return codes */

dcl STATUS_SUCCESS	       fixed bin (8) int static options (constant)
		       init (32);
dcl STATUS_FAILED	       fixed bin (8) int static options (constant)
		       init (33);

/* Input/output capability buffer size limits */

dcl MINIMUM_BUFFER_SIZE    fixed bin int static options (constant) init (128);
dcl MAXIMUM_BUFFER_SIZE    fixed bin int static options (constant) init (65536);
dcl MAXIMUM_BG_SIZE	       fixed bin int static options (constant) init (512);

/* Packet size (communication) constants */

dcl PACKET_SIZE	       fixed bin int static options (constant) init (124);
dcl MAXIMUM_PACKET_SIZE    fixed bin int static options (constant) init (118);

/* Query message constants */

dcl SEND_QUERY	       fixed bin int static options (constant) init (128);
dcl ACCEPT	       fixed bin int static options (constant) init (32);
dcl REJECT	       fixed bin int static options (constant) init (33);

/* Trace information constants */

dcl RECEIVE	       fixed bin int static options (constant) init (1);
dcl SEND		       fixed bin int static options (constant) init (0);

/* Limits on dedicated minor capabilities */

dcl MINIMUM_SYSTEM_MINOR   fixed bin int static options (constant) init (32);
dcl MAXIMUM_SYSTEM_MINOR   fixed bin int static options (constant) init (63);
dcl MINIMUM_USER_MINOR     fixed bin int static options (constant) init (64);
dcl MAXIMUM_USER_MINOR     fixed bin int static options (constant) init (127);

/* Dedicated Minor Capabilities */

dcl LAST		       fixed bin int static options (constant) init (0);
dcl EXECUTE_COMMAND_REPLY  fixed bin int static options (constant) init (32);
dcl EXECUTE_CAPABILITY_REPLY
		       fixed bin int static options (constant) init (33);
dcl FAIL_CAPABILITY	       fixed bin int static options (constant) init (33);
dcl INTERNAL	       fixed bin int static options (constant) init (32);
dcl EXECUTE_COMMAND	       fixed bin int static options (constant) init (34);
dcl ADD_TO_REMOTE_CAT      fixed bin int static options (constant) init (35);
dcl DELETE_FROM_REMOTE_CAT fixed bin int static options (constant) init (36);
dcl SUSPEND_APPLICATION    fixed bin int static options (constant) init (37);
dcl RESUME_APPLICATION     fixed bin int static options (constant) init (38);
dcl TERMINATE_APPLICATION  fixed bin int static options (constant) init (39);
dcl RESET_APPLICATION      fixed bin int static options (constant) init (40);
dcl RESET_REPLY	       fixed bin int static options (constant) init (41);
dcl WAKE_UP	       fixed bin int static options (constant) init (42);
dcl STATUS	       fixed bin int static options (constant) init (43);
dcl OVERFLOWED_BUFFER      fixed bin int static options (constant) init (44);
dcl SYSTEM_ERROR	       fixed bin int static options (constant) init (45);
dcl QUERY_REPLY	       fixed bin int static options (constant) init (46);
dcl RESPONSE_CONNECT       fixed bin int static options (constant) init (47);
dcl RESPONSE_DISCONNECT    fixed bin int static options (constant) init (48);
dcl REQUEST_CONNECT	       fixed bin int static options (constant) init (49);
dcl REQUEST_DISCONNECT     fixed bin int static options (constant) init (50);
dcl CONTINUE	       fixed bin int static options (constant) init (51);
dcl MORE		       fixed bin int static options (constant) init (52);
dcl SET_SLEEP_FLAG	       fixed bin int static options (constant) init (53);
dcl RESET_SLEEP_FLAG       fixed bin int static options (constant) init (54);
dcl SET_SUSPEND	       fixed bin int static options (constant) init (55);
dcl RESET_SUSPEND	       fixed bin int static options (constant) init (56);
dcl STATUS_REPLY	       fixed bin int static options (constant) init (57);

/* Foreground */

dcl FG_CONTROL_MESSAGE     fixed bin int static options (constant) init (33);
dcl FG_BREAK	       fixed bin int static options (constant) init (34);
dcl FG_TERMINAL_DATA       fixed bin int static options (constant) init (35);
dcl FG_MORE_DATA	       fixed bin int static options (constant) init (36);
dcl PUT_TO_BACKGROUND_BUFFER
		       fixed bin int static options (constant) init (37);
dcl PUT_TO_QUERY_MESSAGE_BUFFER
		       fixed bin int static options (constant) init (38);

/*  END INCLUDE FILE:	mowse.incl.pl1			  *  *  *  *  *  *  *  *  *  *  *  *  */
