/* BEGIN INCLUDE FILE mrds_scope_info.incl.pl1 -- jaw 8/30/77 */

dcl 1 scope_info aligned based (sci_ptr),		/* structure in which to pass out scope info */
    2 nrels fixed bin,				/* number of relations defined */
    2 scope (nrels_init refer (scope_info.nrels)),
      3 name char (32) unal,				/* relation name */
      3 flags,					/* scope flags for the relation */
        4 retrieve bit (1) unal,
        4 delete bit (1) unal,
        4 modify bit (1) unal,
        4 store bit (1) unal,
        4 retrieve_prevent bit (1) unal,
        4 delete_prevent bit (1) unal,
        4 modify_prevent bit (1) unal,
        4 store_prevent bit (1) unal;

dcl  sci_ptr ptr;
dcl  nrels_init fixed bin;

/* END INCLUDE FILE mrds_scope_info.incl.pl1 */

