/* BEGIN INCLUDE FILE mrds_parse.incl.pl1 -- oris, 6/28/78 */

dcl 1 parse based (p_ptr),				/* structure for args to be passed to parsing procs.. */
    2 start_pos fixed bin,				/* pos. where get_token is to start */
    2 line_no fixed bin,				/* current line number in source */
    2 token_len fixed bin,				/* length of current token */
    2 s_len fixed bin,				/* character length of source */
    2 lp_ptr ptr,					/* iocb_ptr for listing */
    2 token_ptr ptr,				/* ptr. to token required by mrds_cmdb_get_token */
    2 s_ptr ptr,					/* iocb_ptr for source file */
    2 end_sw bit (1) unal,				/* ON => end of clause has been reached */
    2 pad bit (35) unal,
    2 ls_path char (168);				/* path of listing */

dcl  p_ptr ptr;					/* ptr. to parse structure */
dcl  token char (parse.token_len) based (parse.token_ptr);	/* current token */
dcl  source char (parse.s_len) based (parse.s_ptr);	/* the source segment */
dcl  token_array (parse.token_len) char (1) unal based (parse.token_ptr);

dcl  DELIMS char (3) int static options (constant) init ("
	");
dcl  NON_SYN_ERR fixed bin int static options (constant) init (-1);
dcl  FATAL fixed bin int static options (constant) init (2);
dcl  WARN fixed bin int static options (constant) init (1);
dcl  SKIP bit (1) unal int static options (constant) init ("1"b);
dcl  NO_SKIP bit (1) unal int static options (constant) init ("0"b);

/* END INCLUDE FILE mrds_parse.incl.pl1 */

