/* BEGIN INCLUDE FILE  -  mrds_dsm_entry_dcls.incl.pl1 */
/* Written by Lindsey Spratt - - 80-10-24 */
/* Modified by Jim Gray - - 80-11-13, to remove  declarations of non-existant modules */

/* format: style2 */
dcl  mrds_dsm_close entry (ptr, fixed bin (35));
dcl  mrds_dsm_close$force entry (ptr);
dcl  mrds_dsm_copy entry (char (*), char (*), fixed bin (35));
dcl  mrds_dsm_set_db_path entry (ptr, char (*), fixed bin (35));
dcl  mrds_dsm_define_temp
     entry (char (*), ptr, fixed bin (35));
dcl  mrds_dsm_open_read entry (char (*), ptr, fixed bin (35));
dcl  mrds_dsm_read_header entry (ptr, ptr, ptr, fixed bin (35));
dcl  mrds_dsm_read_relation entry (char (*), ptr, ptr, ptr, fixed bin (35));
dcl  mrds_dsm_get_relation_names
     entry (ptr, ptr, ptr, fixed bin (35));
dcl  mrds_dsm_validate_header
     entry (ptr, fixed bin (35));
dcl  mrds_dsm_dmdsm entry (ptr, fixed bin (35));
dcl  mrds_dsm_valid_$validate
     entry (ptr, ptr, char (*), char (*), ptr, ptr, fixed bin (35));


/* END INCLUDE FILE  -  mrds_dsm_entry_dcls.incl.pl1 */
