/* BEGIN INCLUDE FILE ..... mrds_dsm_parse_table.incl.pl1 .....
 5/29/81  1008.0 mst Fr. From >udd>Demo>dbm_test>new_data_bases>Davids>submodels>s>mrds_dsm_parse.lrk */

dcl  1 mrds_dsm_parse_table$DPDA	ext static,
	  2 DPDAsize	fixed bin,
	  2 DPDA(822),
	    3(v1,v2)	fixed bin(17)unal;
dcl  DPDAp	ptr;

/*   END INCLUDE FILE ..... mrds_dsm_parse_table.incl.pl1 ..... */
