/* BEGIN INCLUDE FILE mrds_rst_parse_table.incl.pl1   (Davids Multics)  10/15/81 1622.8 mst Thu */

dcl  1 mrds_rst_parse_table$DPDA	ext static,
	  2 DPDAsize	fixed bin,
	  2 DPDA(705),
	    3(v1,v2)	fixed bin(17)unal;
dcl  DPDAp	ptr;

/*   END INCLUDE FILE mrds_rst_parse_table.incl.pl1 */
