/* BEGIN mrds_select_sets.incl.pl1		rdl,	2/27/79			*/

dcl 1 select_sets aligned based (ss_ptr),
    2 dup_retain bit (1) unal,			/* ON => duplicate selected tuples must be preserved */
    2 pad bit (35) unal,				/* Resevered for furture use */
    2 domains (mrds_data_$max_select_items) char (32),	/* domain name of each select item */
    2 nitems fixed bin,				/* Number of items in this structure */
    2 items (nitems_init refer (select_sets.nitems)),
      3 oper_flag bit (1) unal,			/* On => this item is an operator */
      3 pad bit (35) unal,				/* Reserved for future use */
      3 op_code fixed bin,				/* Valid only if oper_flag id on
						   1 -> union
						   2 => intersection
						   3 => Difference 			*/
      3 range_ptr ptr,				/* Valid only if oper_flag  is OFF, these pointers are */
      3 select_ptr ptr,				/* used by  mrds_dsl_search */
      3 so_ptr ptr,
      3 ti_ptr ptr;					/* to tuple info structure for this block */


dcl  ss_ptr ptr;					/* Pointer to the selected sets */
dcl  nitems_init fixed bin;

dcl  UNION fixed bin internal static options (constant) init (1);
dcl  INTERSECTION fixed bin internal static options (constant) init (2);
dcl  DIFFERENCE fixed bin internal static options (constant) init (3);

/* END mrds_dsl_select_sets.incl.pl1					*/

