/* BEGIN INCLUDE FILE ..... mrpg_tables_.incl.pl1 .....
 7/29/81  1740.9 mst We. From >udd>m>Falksenj>rgl>mrpg.lrk */

dcl  1 mrpg_tables_$TL	ext static,
	  2 TLsize	fixed bin,
	  2 TL(118),
	    3(pt,ln)	fixed bin(17)unal;

dcl  1 mrpg_tables_$TC	ext static,
	  2 TCsize	fixed bin,
	  2 TC	char(646);

dcl  1 mrpg_tables_$DPDA	ext static,
	  2 DPDAsize	fixed bin,
	  2 DPDA(3025),
	    3(v1,v2)	fixed bin(17)unal;
dcl  DPDAp	ptr;

/*   END INCLUDE FILE ..... mrpg_tables_.incl.pl1 ..... */
