


	/* the include file MXPRO */

declare 1 eb_data_$mxpro ext aligned,
        2 (nmxpro, mxpro(2) ) fixed bin (17) aligned ;


	/* end of the include file MXPRO */
