/* include file  ncp_info_order.incl.pl1 */
/* Contains declarations for the structures based on the argument
   "order_pr" involved in some of the calls to ncp_$ncp_priv_order */

/* ncp_priv_order call 33 - "get_net_survey" */

dcl 1 net_surv aligned based(order_pr),			/* output */
    2 ncp_ev_chan fixed bin(71),
    2 ncp_procid bit(36),
    2 ncp_up fixed bin,
    2 (htbl_size, rtbl_size, stbl_size) fixed bin,
    2 (htbl_gent, rtbl_gent, stbl_gent) fixed bin,
    2 (htbl_lock, rtbl_lock, stbl_lock) bit(36);

/* ncp_priv_order call 34 - "get_host_survey" */

dcl 1 host_surv aligned based(order_pr),
    2 tbl_len fixed bin,				/* input and output */
    2 host_tbl(1000) aligned,				/* output */
      3 index fixed bin,				/* index of this entry in the host table */
      3 hlock bit(36),
      3 (rlkidx, wlkidx) bit(18) unaligned,
      3 rlinkn(32) bit(1) unaligned,
      3 host_id bit(9);

/* ncp_priv_order call 35 - "get_rfc_survey" */

dcl 1 rfc_surv aligned based(order_pr),
    2 tbl_len fixed bin,				/* input and output */
    2 rfc_tbl(1000) aligned,				/* output */
      3 index fixed bin,				/* index of this entry in the rfc table */
      3 fsocq bit(41),
      3 linkq bit(18) unaligned,
      3 queuen bit(18) unaligned;

/* ncp_priv_order call 36 - "get_socket_survey" */

dcl 1 sock_surv aligned based(order_pr),
    2 tbl_len fixed bin,				/* input and output */
    2 sock_tbl(1000) aligned,				/* output */
      3 index fixed bin,				/* index of this entry in the socket table */
      3 lsoc bit(41),
      3 state bit(6),
      3 procid bit(36),
      3 oprocid bit(36);

/* ncp_priv_order call 37 - "get_socket_data" */

dcl 1 sock_data aligned based (order_pr),
    2 soct aligned,					/* output */
      3 evchn fixed bin(71),				/* event channel id of using process */
      3 oevchn fixed bin(71),				/* event channel id of overseer process */
      3 lock bit(36),				/* lock word for this socket entry */
      3 procid bit(36),				/* process id of using process */
      3 oprocid bit(36),				/* process id of overseer process */
      3 balloc fixed bin(32),				/* "read" or "write" bit transmission allocation */
      3 malloc fixed bin(16),
      3 lsoc bit(41),				/* identifier of this (local) socket */
      3 fsoc bit(41),				/* identifier of foreign socket in the connection */
      3 queue bit(18) unaligned,			/* RFC tbl index of block next on this queue. 0 if no queue. */
      3 linkn bit(18) unaligned,			/* link number assigned to this connection */
      3 ctl_idx bit(18) unaligned,			/* imp dim index of "read" control link to foreign NCP */
      3 com_idx bit(18) unaligned,			/* imp dim index of link implementing this connection */
      3 state bit(6) unaligned,			/* current state of this socket */
      3 byte bit(8) unaligned,
      3 r_w bit(1) unaligned,				/* = 0, this is a "read" socket;
						   = 1, this is a "write" socket */
      3 int_ok bit(1) unaligned,			/* = 0, interrupts prohibited;
						   = 1, interrupts permitted */
      3 deac_sw bit(1) unaligned,			/* = 0; socket not to be deactivated;
						   = 1, socket to be deactivated */
    2 tbl_len fixed bin,				/* input and output */
    2 rfc_tbl(1000) aligned,				/* output */
      3 index fixed bin,				/* index of this entry in the rfc table */
      3 fsocq bit(41),
      3 linkq bit(18) unaligned,
      3 queuen bit(18) unaligned;


/* end of "ncp_info_order.incl.pl1" */
