/*	BEGIN INCLUDE FILE ... od355_trace.incl.pl1 */

/* *	This include file describes the format of the messages
   *	used by online_355_dump_ when deciphering the
   *	355 trace table
   *
   *	written by Robert Coren 04/01/75
*/

dcl  od355_trace$ fixed bin ext static;

dcl  od355_trace$modtab (6) bit(18) aligned ext static;	/* list of offsets of per-module lists of message offsets */

dcl  message_offsets (1) bit(18) aligned based;		/* list of message offsets (per module) */

dcl  modp ptr;
dcl  tracep ptr;

dcl  1 trace_message aligned based,			/* format of an individual trace message */
	2 length fixed bin(8) unaligned,
	2 message char(0 refer (trace_message.length)) unaligned;

/*	END INCLUDE FILE ... od355_trace.incl.pl1 */
