/* BEGIN INCLUDE FILE ... entry_sequence_info.incl.pl1 */

/* coded 5/75 by M. Weaver */
/* changed 5/79 by G. Dixon to include entry_desc_info */
/* modified 6/82 by M. Weaver to include symbol_block_offset */

     declare 1 parm_desc_ptrs	      aligned based,
	     2 n_args	      fixed bin (18) unsigned unaligned,
	     2 descriptor_relp    (num_descs refer (parm_desc_ptrs.n_args)) bit (18) unaligned;

     declare num_descs	      fixed bin (18);

     declare 1 entry_sequence	      aligned based,
	     2 word0,
	       3 symbol_block_offset fixed bin (18) unsigned unaligned, /* relative to symbol tree */
	       3 component_number fixed bin (18) unsigned unaligned,
	     2 word1,
	       3 descr_relp_offset bit (18) unaligned,	/* offset of parm_desc_ptrs structure */
	       3 reserved	      bit (18) unaligned,
	     2 word2,
	       3 def_relp	      bit (18) unaligned,	/* offset of entry's definition */
	       3 flags	      unaligned like entry_desc_info.flags,
	     2 code_sequence      bit (36) aligned;

%include entry_desc_info;

/* END INCLUDE FILE ... entry_sequence_info.incl.pl1 */
