/* BEGIN INCLUDE FILE pascal_symbol_.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(86-09-15,JMAthane), approve(86-09-15,MCR7521),
     audit(86-09-15,Martinson), install(86-11-12,MR12.0-1208):
     Added for version 8.03 of pascal to support pascal_display tools.
                                                   END HISTORY COMMENTS */

/* format: style4,^linecom,^ifthendo,^indproc,^indblkcom,initcol1,declareind8,dclind4,struclvlind1 */

dcl pascal_symbol_$display_declaration entry
         (ptr,					/* ptr to Pascal symbol node */
         ptr,					/* ptr to Multics iocb for output */
         fixed bin (35),				/* nbr of spaces for left margin */
         fixed bin (35),				/* nbr of spaces for indentation */
         bit (5),					/* switches :
						   - name : if true, name of the symbol is printed.
						   - declaration : if true, declaration is printed.
						   - status : if true, place of declaration (proc name, etc..) is printed.
						   - long : if true, record types fields are described.
						   - nl : if true, new_line is printed at the end. */
         fixed bin (35));				/* standard error_code */


dcl pascal_symbol_$display_var_type entry
         (fixed bin (35),				/* type code for the Pascal variable or field */
         ptr,					/* type pointer for the Pascal variable or field (null if none) */
         ptr,					/* ptr to the Multics iocb for output */
         fixed bin (35),				/* nbr of spaces for left margin */
         fixed bin (35),				/* nbr of spaces for indentation */
         bit (2),					/* switches :
						   - long : not used
						   - nl : if true, new_Line is printed at the end */
         fixed bin (35));				/* standard error_code */


dcl pascal_symbol_$display_data entry
         (fixed bin (35),				/* type code for the Pascal data */
         ptr,					/* type ptr for the Pascal data (null if none) */
         ptr,					/* ptr to the Multics switch for output */
         fixed bin (35),				/* spaces count for left margin */
         fixed bin (35),				/* spaces count for indentation */
         bit (3),					/* switches :
						   - name : if true, name of the symbol is printed.
						   - long : not used
						   - nl : if true, new_Line is printed at the end */
         ptr,					/* ptr to stack frame (null if none) */
         ptr,					/* ptr to linkage section (null if none) */
         ptr,					/* ptr to "declared in" runtime block for the data */
         1 like pascal_subscript_info,			/* info about subarray bounds */
         ptr,					/* ptr to the data */
         char (256) var,				/* name of the data */
         fixed bin (35),				/* size of the data */
         fixed bin (35));				/* standard error code */

dcl pascal_symbol_$memorize_refs_on entry;

dcl pascal_symbol_$memorize_refs_off entry;

dcl pascal_symbol_$clear_references entry;

dcl pascal_symbol_$display_references entry
         (ptr,					/* ptr to the Multics switch for output */
         fixed bin (35),				/* spaces count for left margin */
         fixed bin (35),				/* spaces count for indentation */
         fixed bin (35));				/* standard error code */
dcl 1 pascal_subscript_info aligned based,
     2 number fixed bin,				/* number actually present */
     2 value (2, 16) fixed bin (24);			/* values for lower and upper bound for each */

/* END INCLUDE FILE pascal_symbol_.incl.pl1 */
