/* BEGIN INCLUDE FILE ... pl1_info.incl.pl1 */
/* This is intended to be used by all procedures raising pl1 conditions and by the default handler */
/* Created June 1981 by Benson I. Margulies from pl1_info_struc.incl.pl1 */
/* This include file must be used with condition_info_header.incl.pl1. Both must be %included */

declare pl1_info_ptr pointer;
declare 1 pl1_info aligned based (pl1_info_ptr),
            2 header aligned like condition_info_header,
	  2 id char(8) aligned,		/* init "pliocond"; indicates pl1 structure */
	  2 content_flags aligned,
	   (3 v1_sw,			/* on if raised by version 1 */
	    3 oncode_sw,			/* "1"b->valid oncode */
	    3 onfile_sw,			/* "1"b->file name is in structure */
	    3 file_ptr_sw,			/* "1"b->file is associated with this condition */
	    3 onsource_sw,			/* "1"b->valid onsource string for this condition */
	    3 onchar_sw,			/* "1"b->valid onchar index in this structure */
	    3 onkey_sw,			/* "1"b->valid onkey string in this structure */
	    3 onfield_sw) bit(1) unaligned,	/* "1"b->valid onfield string in this structure */
	  2 oncode fixed bin(35),		/* oncode for condition */
	  2 onfile char(32) aligned,		/* onfile string */
	  2 file_ptr ptr,			/* pointer to file value */
	  2 onsource char(256) var,		/* onsource string */
	  2 oncharindex fixed bin,		/* char offset in onsource of offending char */
	  2 onkey_onfield char(256) var;	/* either onkey string or onfield string */

/* END INCLUDE FILE ... pl1_info.incl.pl1 */
