dcl 1 plio_sb aligned ,
	2 fe(3)	,		/* cur, two more for the complex case */
		3 type	fixed bin(15),
		3 nval	fixed bin(15),
		3 val,
			4 val_1	fixed bin(15),
			4 val_2	fixed bin(15),
			4 val_3	fixed bin(15),
	2 cur_rep fixed bin(15),	/* octal offset 17  */
	2 cur_sfp	ptr,		/* octal offset 20,21   */
	2 cur_fep	ptr,
	2 format_len fixed  bin(35),
	2 saved_x0  fixed bin(35),
	2 stk_index fixed bin(15),
	2 space_ptr	ptr,
	2 real_parts_len	fixed bin(35),
	2 cplx_flags	fixed bin(35),
	2 pef_finish	ptr,
	2 extra_temp	fixed bin(35),
	2 extra(4),
		3 extra_word	fixed bin(35),
	2 frame(10),		/* push down for "(" in a format list */
		3 sf1p	ptr,
		3 sf2p	ptr,
		3 fe1p	ptr,
		3 fe2p	ptr,
		3 rep	fixed bin(15);
