/* BEGIN INCLUDE FILE ... polled_vip_mpx_data.incl.pl1 */
/* Created 12/20/78 by J. Stern */


dcl pvmdp ptr;
dcl pvmd_nchan fixed bin;				/* hbound of pvmd.subchan_table */

dcl 1 pvmd aligned based (pvmdp),			/* polled vip multiplexer data */
      2 devx fixed bin,				/* device (LCT) index */
      2 nchan fixed bin,				/* number of subchannels */
      2 name char (32) unal,				/* major channel name */
      2 writep ptr,					/* ptr to frame now being written */
      2 write_chan fixed bin,				/* subchan that owns current write frame */
      2 nstation fixed bin (17) unal,			/* number of stations initially configured */
      2 cur_nstation fixed bin (17) unal,		/* number of stations currently configured */
      2 station_to_subchan (0:31) unal,
        3 display fixed bin (8) unal,			/* display subchan for given station */
        3 printer fixed bin (8) unal,			/* printer subchan for given station */
      2 station_mask (0:35) bit (1) unal,		/* bit i ON if station i initially configured */
      2 cur_station_mask (0:35) bit (1) unal,		/* bit i ON if station i currently configured */
      2 load_proc_id bit (36),			/* bootload process id */
      2 load_ev_chan fixed bin (71),			/* bootload event channel */
      2 dialup_info bit (72),				/* dialup interrupt info */
      2 pause_time fixed bin,				/* pause time between polling cycles */
      2 max_text_len fixed bin,			/* max data chars in output text message */
      2 max_message_len fixed bin,			/* max number of characters in input message */
      2 function_codes,				/* chars having special meanings as function codes */
        3 quit char (1) unal,
        3 formfeed char (1) unal,
        3 pad char (2) unal,
      2 flags,
        3 send_output bit (1) unal,			/* ON if ok to send more output */
        3 mpx_started bit (1) unal,			/* ON if multiplexer started */
        3 mpx_loading bit (1) unal,			/* ON if multiplexer load in progress */
        3 mpx_loaded bit (1) unal,			/* ON if multiplexer loaded */
        3 polling_started bit (1) unal,			/* ON if polling started */
        3 controller_poll bit (1) unal,			/* ON if controller polling; OFF if station polling */
        3 partial_frame bit (1) unal,			/* ON if partial frame has been written */
        3 crlf_echo bit (1) unal,			/* ON to enable CRLF echoing */
        3 omit_nl bit (1) unal,			/* ON to omit adding NL to received msgs */
        3 omit_ff bit (1) unal,			/* ON to omit sending FF at top of page */
        3 gcos_break bit (1) unal,			/* ON to accept $*$BRK as quit indication */
        3 etb_mode bit (1) unal,			/* ON to terminate partial messages with ETB */
        3 unused bit (24) unal,
      2 error_counters like pvip_mpx_meters,		/* counters for errors reported by the FNP */
      2 saved_meters_ptr ptr,				/* pointer to target for copy_meters order */
      2 subchan_table (pvmd_nchan refer (pvmd.nchan)) like pvste; /* subchannel table */


dcl pvstep ptr;

dcl 1 pvste aligned based (pvstep),			/* polled vip subchannel table entry */
      2 station_addr fixed bin (9) unsigned unal,		/* station address (0 - 31) */
      2 name char (3) unal,				/* subchan component name */
      2 devx fixed bin (17) unal,			/* subchan device (LCT) index */
      2 write_chain fixed bin (18) unsigned unal,		/* offset of first write buffer */
      2 flags unal,
        3 printer bit (1) unal,			/* ON if printer;  OFF if display */
        3 hold_output bit (1) unal,			/* ON if waiting for FF (display) or ACK (printer) */
        3 eop bit (1) unal,				/* ON if next output must clear screen */
        3 hndlquit bit (1) unal,			/* ON if in hndlquit mode */
        3 listen bit (1) unal,			/* ON if listening for dialup */
        3 dialed bit (1) unal,			/* ON if subchan is dialed up */
        3 slave bit (1) unal,				/* ON for slave subchans */
        3 unused bit (2) unal,
      2 naks fixed bin (8) unal,			/* printer status NAK counter */
      2 baud_rate fixed bin (17) unal,			/* printer baud rate, 300 or 1200 */
      2 pgofs fixed bin (8) unal,			/* page overflow counter (display only) */
      2 writes fixed bin (8) unal,			/* count of frames written since first page overflow */
      2 pad fixed bin (17) unal,
      2 meters like pvip_subchan_meters,
      2 saved_meters_ptr ptr;

/* END INCLUDE FILE ... polled_vip_mpx_data.incl.pl1 */
