/*  Begin include file  ...  pps_control_block.incl.pl1  */


dcl  ppscb_ptr ptr;

dcl 1 ppscb aligned based (ppscb_ptr),
    2 version fixed bin,				/* should be 1 */
    2 name char (32),
    2 cv_ppscb_version fixed bin,
    2 job_name char (17),
    2 pause bit (1),
    2 pps_only bit (1),
    2 vfu_tape_code char (1),
    2 job_description char (40),
    2 stacker_algorithm fixed bin,
    2 primary_character_generator fixed bin,
    2 fixed_print_algorithm_code fixed bin,
    2 paper_width fixed dec (4, 1),
    2 sheet_length fixed dec (4, 1),
    2 lines_per_inch fixed bin,
    2 num_copies fixed bin,
    2 num_copies_before_blanking fixed bin,
    2 character_size fixed bin,
    2 code_conversion fixed bin,
    2 preprinted_form_number fixed bin,
    2 toner_configuration fixed bin,
    2 routing_placement_control fixed bin,
    2 punch_code fixed bin,
    2 forms_control (93) fixed bin (8) unal,
    2 page_format (210) aligned,
      3 operation fixed bin (3) unal,
      3 line_num fixed bin (8) unal,
      3 char_num fixed bin (8) unal,
    2 routing_count (29) fixed bin,
    2 routing_data char (1024);


dcl 1 DEFAULT_PPS_CONTROL_BLOCK aligned static internal options (constant),
    2 version fixed bin init (1),			/* should be 1 */
    2 name char (32) init (""),
    2 cv_ppscb_version fixed bin init (1),
    2 job_name char (17) init (""),
    2 pause bit (1) init ("0"b),
    2 pps_only bit (1) init ("0"b),
    2 vfu_tape_code char (1) init ("a"),
    2 job_description char (40) init (""),
    2 stacker_algorithm fixed bin init (0),
    2 primary_character_generator fixed bin init (0),
    2 fixed_print_algorithm_code fixed bin init (0),
    2 paper_width fixed dec (4, 1) init (11.0),
    2 sheet_length fixed dec (4, 1) init (8.5),
    2 lines_per_inch fixed bin init (8),
    2 num_copies fixed bin init (1),
    2 num_copies_before_blanking fixed bin init (0),
    2 character_size fixed bin init (0),
    2 code_conversion fixed bin init (3),
    2 preprinted_form_number fixed bin init (0),
    2 toner_configuration fixed bin init (0),
    2 routing_placement_control fixed bin init (2),
    2 punch_code fixed bin init (0),
    2 forms_control (93) fixed bin (8) unal init ((2)0, 1, (90)0),
    2 page_format (210) aligned,
      3 operation fixed bin (3) unal init ((210)0),
      3 line_num fixed bin (8) unal init ((210)0),
      3 char_num fixed bin (8) unal init ((210)0),
    2 routing_count (29) fixed bin init ((29)0),
    2 routing_data char (1024);


/*  End include file  ...  pps_control_block.incl.pl1  */
