/*     BEGIN INCLUDE FILE ... print_data.incl.pl1 ... last modified nov 1970 */

dcl print_data$output_cnt fixed bin(17) external,
    print_data$time_string char(24) aligned external,
    print_data$devx(0 : 1) fixed bin(12) external,
    print_data$curdevx fixed bin(17) external,
    print_data$linect fixed bin(17) external,
    print_data$output_ptr pointer external,
    print_data$bitcnt fixed bin(24) external,
    print_data$page_no fixed bin(17) external;


/*END INCLUDE FILE ... print_data.incl.pl1 */
