
/* Begin include file ...... prt_info.incl.pl1 */
/* last modified 6/12/75 by Noel I. Morris	*/

dcl  pip ptr;					/* pointer to printer info structure */

dcl 1 prt_info based (pip) aligned,			/* printer info structure */
    2 devname char (4),				/* name of device */
    2 devx fixed bin,				/* device index */
    2 model fixed bin,				/* printer model number */
    2 type fixed bin,				/* printer type number */
    2 train fixed bin,				/* print train ID */
    2 line_length fixed bin,				/* max length of printed line */
    2 print_idcw bit (36),				/* IDCW to print 1 line */
    2 term_idcw bit (36);				/* IDCW to stop printer channel */

/* End of include file ...... prt_info.incl.pl1 */

