/*	BEGIN INCLUDE FILE query_info.incl.pl1		TAC June 1, 1973 */
/*        Renamed to query_info.incl.pl1 and cp_escape_control added, 08/10/78 WOS */
/*	version number changed to 4, 08/10/78 WOS */
/* Version 5 adds explanation_(ptr len) 05/08/81 S. Herbst */
/* Version 6 adds literal_sw, prompt_after_explanation switch 12/15/82 S. Herbst */

dcl 1 query_info aligned,				/* argument structure for command_query_ call */
    2 version fixed bin,				/* version of this structure - must be set, see below */
    2 switches aligned,                                     /* various bit switch values */
      3 yes_or_no_sw bit (1) unaligned init ("0"b),		/* not a yes-or-no question, by default */
      3 suppress_name_sw bit (1) unaligned init ("0"b),	/* do not suppress command name */
      3 cp_escape_control bit (2) unaligned init ("00"b),   /* obey static default value */
                                                            /* "01" -> invalid, "10" -> don't allow, "11" -> allow */
      3 suppress_spacing bit (1) unaligned init ("0"b),     /* whether to print extra spacing */
      3 literal_sw bit (1) unaligned init ("0"b),		/* ON => do not strip leading/trailing white space */
      3 prompt_after_explanation bit (1) unaligned init ("0"b),  /* ON => repeat question after explanation */
      3 padding bit (29) unaligned init (""b),		/* pads it out to t word */
    2 status_code fixed bin (35) init (0),		/* query not prompted by any error, by default */
    2 query_code fixed bin (35) init (0),		/* currently has no meaning */

/*  Limit of data defined for version 2 */

    2 question_iocbp ptr init (null ()),		/* IO switch to write question */
    2 answer_iocbp ptr init (null ()),			/* IO switch to read answer */
    2 repeat_time fixed bin (71) init (0),		/* repeat question every N seconds if no answer */
						/* minimum of 30 seconds required for repeat */
						/* otherwise, no repeat will occur */
/* Limit of data defined for version 4 */

    2 explanation_ptr ptr init (null ()),		/* explanation of question to be printed if */
    2 explanation_len fixed bin (21) init (0);		/* user answers "?" (disabled if ptr=null or len=0) */

dcl  query_info_version_3 fixed bin int static options (constant) init (3);
dcl  query_info_version_4 fixed bin int static options (constant) init (4);
dcl  query_info_version_5 fixed bin int static options (constant) init (5);
dcl  query_info_version_6 fixed bin int static options (constant) init (6); /* the current version number */

/*	END INCLUDE FILE query_info.incl.pl1 */
