/*        Begin include file rcp_resource_states.incl.pl1
*
*         Created by M. M. Pozzo on 841005
*	Modified by Chris Jones, 12/84, to add volume states.
*
*/

declare FREE fixed bin static internal options (constant) init (0);
declare ASSIGNED fixed bin static internal options (constant) init (1);
declare DELETED fixed bin static internal options (constant) init (2);
declare STORAGE_SYSTEM fixed bin static internal options (constant) init (3);
declare RESERVED fixed bin static internal options (constant) init (4);

/* End include file ... rcp_resource_states.incl.pl1  */
