/*  START OF:	rcp_device_info_structs.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */

/****^  HISTORY COMMENTS:
  1) change(85-09-09,Fawcett), approve(85-09-09,MCR6979),
     audit(85-12-09,CLJones), install(86-03-21,MR12.0-1033):
     Support of MCA.
                                                   END HISTORY COMMENTS */

/* Written 03/04/85 by Chris Jones. */

/* This include file obsoletes the following include files:  rcp_device_info, rcp_disk_info,
   rcp_printer_info, and rcp_tape_info. */
/* Modified May 1985 by Rich Fawcett to add the 8th device MCA */
/* format: style4,delnl,insnl,indattr,ifthen,dclind10 */

dcl	device_info_ptr	   ptr;

dcl	1 device_info	   aligned based (device_info_ptr),
	  2 common	   like device_info_common,
	  2 qualifiers	   (4) fixed bin (35);	/* per device type info */

dcl	1 device_info_common   aligned based,
	  2 version_num	   fixed bin,		/* Version number of this structure. */
	  2 usage_time	   fixed bin,		/* Number of minutes device will/may be used. */
	  2 wait_time	   fixed bin,		/* Number of minutes user will/must wait. */
	  2 system_flag	   bit (1),		/* ON => user wants to be a system process. */
	  2 device_name	   char (8),		/* Device name. */
	  2 model		   fixed bin;		/* Device model number. */

dcl	1 tape_info	   based (device_info_ptr) aligned,
	  2 common	   like device_info_common,
	  2 tracks	   fixed bin,		/* 7 or 9 track */
	  2 density	   bit (36),		/* density capabilities: 200, 556, 800, 1600, 6250 */
	  2 speed		   bit (36),		/* speed: 75, 125, 200 */
	  2 pad		   bit (36),
	  2 volume_name	   char (32),		/* Tape reel name. */
	  2 write_flag	   bit (1),		/* ON => writing on tape reel. */
	  2 position_index	   fixed bin (35),		/* Counter used to determine tape reel position. */
						/* Limit of version 2 structure, info below returned if version 3 or greater */
	  2 volume_type	   fixed bin,		/* Use rcp_volume_formats.incl.pl1 for decodes */
	  2 volume_density	   fixed bin,		/* 1 - 5 = 200, 556, 800, 1600, or 6250 BPI */
	  2 opr_auth	   bit (1);		/* "1"b => Operator Authentication was required */

dcl  tape_info_version_2 fixed bin internal static options (constant) init (2);
dcl  tape_info_version_3 fixed bin internal static options (constant) init (3);

dcl	1 disk_info	   based (device_info_ptr) aligned,
	  2 common	   like device_info_common,
	  2 volume_name	   char (32),		/* disk volume name */
	  2 write_flag	   bit (1);		/* on => write_allowed */

dcl	1 printer_info	   based (device_info_ptr) aligned,
	  2 common	   like device_info_common,
	  2 print_train	   fixed bin,		/* print train type */
	  2 line_length	   fixed bin;		/* line length (-1 => not specified */

dcl device_info_size (8) fixed bin static options (constant) init
   (24, 16, 7, 9, 7, 7, 7, 7);

dcl	RCP_MAX_DEVICE_INFO_SIZE
			   fixed bin static options (constant) init (24);

/*  END OF:	rcp_device_info_structs.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
