


	/* the include file for RELOCN */

declare 1 eb_data_$relocn ext aligned,
        2 (mxpbit(2),	nslbit(5),	mxcbit(11),
	 mxlbit(7),	mxsbit(2),	mslbit(6),
	 mrtbit(3),	merbit(11) ) fixed bin (17) aligned ;
 
 
 
	/* end of the include file for relocn */
  
