/* BEGIN INCLUDE FILE reloc_lower.incl.pl1 */

/* See relocation_bits.incl.pl1 and relbts.incl.pl1 for other declarations of
   relocation information. */

dcl (	rc_a_lp18 	init("000000000000000000000000000000010010"b),
	rc_a_is18		init("000000000000000000000000000000011000"b),
	rc_a_t		init("000000000000000000000000000000010000"b))
			bit(36) aligned int static options(constant);

/* END INCLUDE FILE reloc_lower.incl.pl1 */
