dcl page_initialize_ret init(1);
dcl start_test_ret init(2);
dcl process_options_ret init(3);
dcl sequence_test_ret init(4);
dcl restart_ret init(5);
dcl force_ret init(6);
dcl skip_ret init(7);
dcl remove_ret init(8);
dcl busy_said_ret init(9);
dcl try_assign_ret init(10);
dcl wait_loop_ret init(11);
dcl io_dispatch_ret init(12);
dcl gespec_ret init(13);
dcl issue_io_ret init(14);
dcl tadio_ret_xfer init(15);
dcl wait_loop_xfer init(16);
dcl init_assign_ret init(17);
dcl itr_trace_ret init(18);
dcl firmware_trace_ret init(19);
dcl device_firmware_trace_ret init(20);
dcl ignore_ret init(21);
dcl special_itr_trace_ret init(22);
dcl itr_abort_question_ret init(23);
dcl attach_ok_ret init(24);
dcl gebort_ret_xfer init(25);
dcl load_rw_ret init(26);
