/* BEGIN INCLUDE FILE ... retv_data_.incl.pl1 ... 8/76 */



/****^  HISTORY COMMENTS:
  1) change(86-11-17,GWMay), approve(86-11-17,MCR7445), audit(86-11-19,GDixon),
     install(86-11-21,MR12.0-1223):
     Changed declaration of queue_dir from constant to just internal static so
     that the entrypoints "test" in the err and retrieve_from_volume requests
     are able to modify the value.
  2) change(88-08-10,GWMay), approve(88-10-05,MCR8005), audit(88-10-12,Farley),
     install(88-10-17,MR12.2-1173):
     Added pointer and length values for use as an input_buffer for
     intermediate reads.
                                                   END HISTORY COMMENTS */


dcl  retv_data_version_1 fixed bin static init (1) options(constant);	/* version of data base */

/* queue_dir should not be declared options (constant). $test entrypoints in */
/* enter_retrieval_request and retrieve_from_volume programs modify it.      */

dcl  queue_dir char (168) int static init (">daemon_dir_dir>volume_retriever");
dcl  user fixed bin static init (1) options (constant);
dcl  retriever fixed bin static init (2) options (constant);

dcl 1 retv_data_ external static aligned,
    2 version fixed bin,				/* version of structure */
    2 fixed,
      3 qidx (2) fixed bin,				/* indexs of queues */
      3 queue fixed bin,				/* mseg queue */
      3 nvol fixed bin,				/* number of volume control segments */
      3 spare fixed bin,
      3 input_buffer_len fixed bin (21),		/* length of the data in the read buffer */
      3 input_buffer_start fixed bin (21),		/* position in read buffer where new data begins */
    2 chars,
      3 sys_dir char (168),				/* system dir where files live */
      3 last_valid_vtoce_ename char (32),		/* last valid entry name from vtoce */
      3 last_volname char (32),			/* last volume mounted */
      3 io_module char (32),				/* name of io outer module */
      3 input_volume_desc char (256),			/* alternate input attach description */
    2 bits,
      3 last_valid_puid (16) bit (36),			/* last valid uid pathname */
      3 flags,
        4 manual bit (1) unal,			/* if on operator will tell us what tapes to use */
        4 arg_init bit (1) unal,			/* if on indicates that args have been processed */
        4 err_online bit (1) unal,			/* if on causes errors to be printed */
        4 disable_error_report bit (1) unal,		/* if on  - no errors are reported */
        4 all bit (1) unal,				/* if on indicates all queues are processed */
        4 accounting bit (1) unal,			/* if on  enable accounting */
        4 debug bit (1) unal,				/* if on, enable debugging features */
        4 long bit(1) unal,				/* if on enable long messages */
    2 ptrs,
      3 page_buffer_ptr ptr,                                /* ptr to paged read buffer */
      3 input_buffer_ptr ptr,				/* ptr to read buffer */
      3 skip ptr,					/* ptr to skip_list */
      3 rasp ptr,					/* ptr to accounting seg */
      3 input_iocbp ptr,				/* iocb ptr for input */
      3 error_iocbp ptr,				/* iocb ptr for error output */
      3 areap ptr,					/* ptr to system area */
      3 contentsp ptr,				/* ptr to most recent contents seg from input volume */
      3 nlp ptr,					/* ptr to name array for branch being retrieved */
      3 aclp ptr,					/* ptr to acl array for branch being retrieved */
      3 recordp ptr,				/* ptr to last read volume record */
      3 objectp ptr,				/* ptr to last read segmet or directory  */
      3 vlp ptr,					/* ptr to last reload group generated */
      3 rvcp (1000) ptr;				/* ptrs to volume control segments */

/* END INCLUDE FILE ... retv_data_.incl.pl1 */
