/* BEGIN INCLUDE FILE ... rldr_input_volume_list.incl.pl1 ... last modified March 1976 */

dcl 1 rldr_input_volume_list based (rldr_data_.input_vol_lstp) aligned,
    2 num_entries fixed bin,				/* number of input volumes in list */
    2 curn_entry fixed bin,				/* index of current input volume */
    2 array (100),					/* entry array */
      3 volname char (32),				/* input volume name */
      3 volid bit (36);				/* input volume id */

/* END INCLUDE FILE ... rldr_input_volume_list.incl.pl1 */
