/* BEGIN INCLUDE FILE ... rldr_skip_list.incl.pl1 ... 11/76 */

dcl skip ptr;

dcl 1 rldr_skip_list aligned based (skip),
    2 next fixed bin,
    2 array(1),
      3 volname char(32);

/* END INCLUDE FILE ... rldr_skip_list.incl.pl1 */
