/* BEGIN INCLUDE FILE ... rw_sort_info.incl.pl1

   Info structure used to provide sorting.
   Written: Dave Schimke 2/25/83
*/
%skip(3);
dcl 1 sort_info based (sort_info_ptr),
      2 number_of_columns_to_sort fixed bin (17),
      2 columns (no_of_candidate_columns refer(sort_info.number_of_columns_to_sort)),
        3 number fixed bin (17),
        3 modes,
          4 descending bit (1) unal,
          4 non_case_sensitive bit (1) unal,
          4 mbz1 bit(34) unal;
%skip(3);
dcl sort_info_ptr ptr;
dcl no_of_candidate_columns fixed bin;
%skip(3);

/* END INCLUDE FILE rw_sort_info.incl.pl1 */
