/*     BEGIN INCLUDE FILE ... salv_data.incl.pl1 ... last modified July 1982 */

dcl  salv_data$debug bit (1) aligned external;		/* ON, For additional debugging messages. */
dcl  salv_data$dump bit (1) aligned external;		/* ON, to dump bad directories and VTOC entries. */
dcl  salv_data$lock bit (36) external aligned;		/* lock to prevent more than one process from using salv_data. */
dcl  salv_data$on_line bit (1) aligned external;		/* ON, for online salvage. */
dcl  salv_data$print_path bit (1) aligned external;	/* ON, if pathname of each directory should be printed. */
dcl  salv_data$printer_delay fixed bin aligned external;	/* Number of minutes to wait for a not ready printer. */
dcl  salv_data$rpv bit (1) aligned external;		/* ON, for root physical volume salvage. */
dcl  salv_data$vol_read_ahead fixed bin external;


/*     END INCLUDE FILE ... salv_data.incl.pl1 ... */
