/* BEGIN INCLUDE FILE ... sat.incl.pl1 */




/****^  HISTORY COMMENTS:
  1) change(86-09-05,Parisek), approve(87-06-17,MCR7570),
     audit(87-06-15,Hirneisen), install(87-08-06,MR12.1-1066):
     Expand comment line of project.state to include the renamed state (state =
     3).
                                                   END HISTORY COMMENTS */



/* Modified 740723 by PG to add AIM info */
/* Modified 750604 by T. Casey to add priority scheduler parameters */
/* Modified May 1976 by T. Casey to add project cutoff limits */
/* Modified May 1978 by T. Casey to add pdir_quota */
/* Modified November 1978 by T. Casey to add max_(fore back)ground and abs_foreground_cpu_limit */
/* Modified July 1979 by J. N. R. Barnecut  to support multiple rate structures. (UNCA) */
/* Modified January 1982 by E. N. Kittlitz for user_attributes.incl.pl1 changes */
/* Modified 1984-07-05 BIM range of authorizations, version 3 */

dcl (SAT_version init (3),				/* version 2 of this declaration */

     SAT_header_lth init (466),			/* length in words of SAT header */
     SAT_entry_lth init (80), 			/* length in words of SAT entry */

     SAT_project_name_length init (9)			/* proper length of project.project_id */
     ) fixed bin internal static options (constant);

dcl 1 sat based (satp) aligned,

%include author;
    2 max_size fixed bin,				/* max number of entries table can grow */
    2 current_size fixed bin,				/* current size of table  (in entries) */
    2 version fixed bin,				/* version number of table (word 32) */
    2 freep fixed bin,				/* free chain ptr. 0 if no free entries */
    2 n_projects fixed bin,				/* number of entries actually used */
    2 pad_was_max_users bit (36) aligned,
    2 max_units fixed bin,				/* maximum number of login-units per session */
    2 pad_was_max_prim bit (36) aligned,	
    2 uwt_size fixed bin,				/* size of User Weight Table */
    2 uwt (24) aligned,				/* User Weight Table */
      3 initproc char (64) unaligned,			/* user's initial procedure  */
      3 units fixed bin,				/* weight of initial procedure */
    2 system_admin (2) char (32) unal,			/* system administrator ID */
    2 pad1 (4) fixed bin,				/* padding to 466 wds */
    2 project (3258),				/* The SAT entries. 255K segment. */
      3 pad (80) fixed bin;				/* each entry is 80 words long  */


dcl 1 project based (satep) aligned,			/* declaration of a single SAT entry  */
    2 state fixed bin,				/* state 1 = normal, 0 = free, 2 = deleted, 3 = renamed */
    2 project_id char (12) unaligned,			/* project's name */
    2 project_dir char (64) unaligned,			/* project's directory */
    2 pdt_ptr pointer,				/* pointer to current PDT */
    2 max_users fixed bin,				/* maximum number of users from project */
    2 n_users fixed bin,				/* current number */
    2 at like user_attributes aligned,			/* include user_attributes.incl.pl1 */
    2 admin (4) aligned,				/* list of project's administrators  */
      3 userid char (30) unal,			/* administrator's user-id (personid.projectid) */
      3 pad char (2) unal,
    2 cutoff char (1),				/* if project is cut off, why. */
    2 min_ring fixed bin,				/* lowest ring for project */
    2 max_ring fixed bin,				/* highest ring for project */
    2 alias char (8) unal,				/* project alias */
    2 group char (8) unal,				/* default group for this project */
    2 grace_max fixed bin,				/* maximum bump grace */
    2 audit bit (36),				/* audit flags for project */
    2 project_authorization (2) bit (72),		/* authorization of this project */
    2 groups (2) char (8) unal,			/* authorized groups for this project */
    2 days_to_cutoff fixed bin (17) unaligned,		/* these figures are as of last running of daily_summary */
    2 pct_balance fixed bin (17) unaligned,		/* they are used for warning message printing only */
    2 dollars_to_cutoff float bin,			/* and are not to be taken as up-to-date figures */
    2 pdir_quota fixed bin (17) unaligned,		/* max pdir quota allowed for project */
    2 max_foreground fixed bin (9) unsigned unaligned,	/* max simultaneous foreground and background */
    2 max_background fixed bin (9) unsigned unaligned,	/* processes that a user on this project can have */
    2 abs_foreground_cpu_limit fixed bin (17) unaligned,	/* time limit on foreground absentee jobs */
    2 rs_number fixed bin (9) unsigned unaligned,		/* rate structure number (0=default rates ) */
    2 satpad1 fixed bin (9) unsigned unaligned,
    2 satpad (1) bit (36) aligned,			/* pad to 80 words */
    2 chain fixed bin;				/* if free entry, chain */

/* END INCLUDE FILE ... sat.incl.pl1 */
