/*  START OF:	scavenger_data.incl.pl1   November 1982       *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */

/* format: style3 */
dcl	scavenger_data$	external;

dcl	scavenger_datap	ptr;
dcl	sc_metersp	ptr;
dcl	sc_process_tablep	ptr;
dcl	scavenger_blockp	ptr;
dcl	record_blockp	ptr;
dcl	scavenger_optionsp	ptr;

dcl	sc_n_processes	fixed bin;
dcl	scavenger_n_records fixed bin;
dcl	scavenger_n_ovfl	fixed bin;


dcl	1 scavenger_data	aligned based (scavenger_datap),
	  2 lock		aligned,			/* Lock on scavenger_data */
	    3 lock_word	bit (36) aligned,
	    3 wait_event	bit (36) aligned,
	    3 notify_sw	bit (1) aligned,
	  2 process_table_ptr
			ptr,			/* Pointer to scavenger process table */
	  2 error_severity	fixed bin,		/* Severity of unexpected error condition */
	  2 meters	aligned like sc_meters,
	  2 free		bit (1) aligned;		/* Available region */


dcl	1 sc_meters	aligned based (sc_metersp),	/* Meters */
	  2 n_scavenge	fixed bin (35),		/* Number of volume scavenges */
	  2 pf		fixed bin (35),		/* Total page faults */
	  2 vcpu		fixed bin (71),		/* Total virtual CPU time */
	  2 clock_time	fixed bin (71),		/* Total clock time */
	  2 n_vtoces	fixed bin (35),		/* Number VTOCEs examined */
	  2 n_vtoces_damaged
			fixed bin (35),		/* Number VTOCEs damaged by scavenge */
	  2 n_vtoces_per_proc
			fixed bin (35),		/* Number per-process VTOCEs freed */
	  2 n_vtoces_per_boot
			fixed bin (35),		/* Number per-bootload VTOCEs freed */
	  2 n_vtoces_freed	fixed bin (35),		/* Total number VTOCEs freed */
	  2 n_vtoces_fmd	fixed bin (35),		/* Number VTOCEs with fm_damaged reset */
	  2 n_records	fixed bin (35),		/* Number non-null filemap entries examined */
	  2 n_conflicts	fixed bin (35),		/* Number potential conflicts detected */
	  2 n_fmd_conflicts fixed bin (35),		/* Number potential conflicts due to fm_damaged */
	  2 n_real_conflicts
			fixed bin (35),		/* Number real conflicts */
	  2 n_lost_records	fixed bin (35);		/* Number lost records freed */


dcl	1 sc_process_table	aligned based (sc_process_tablep),
	  2 max_n_processes fixed bin,		/* Number of table entries */
	  2 n_processes	fixed bin,		/* Number active entries */
	  2 process	(sc_n_processes refer (sc_process_table.max_n_processes)) aligned,
	    3 processid	bit (36) aligned,		/* Owner. 0=>empty */
	    3 pvtep	ptr unal,			/* PVTE of volume being scavenged */
	    3 blockp	ptr unal,			/* Block w/i scavenger_data */
	    3 first_block_page
			fixed bin,		/* Index of first page of block */
	    3 n_block_pages fixed bin;		/* Number of pages in block */


dcl	1 scavenger_block	aligned based (scavenger_blockp),
	  2 n_records	fixed bin,		/* Number of record addresses */
	  2 n_ovfl	fixed bin,		/* Number of overflow blocks */
	  2 ovfl_free_ix	fixed bin,		/* Index of first free overflow block */
	  2 records	(scavenger_n_records refer (scavenger_block.n_records)) aligned like record_block,
	  2 overflow	(scavenger_n_ovfl refer (scavenger_block.n_ovfl)) aligned like record_block;


dcl	1 record_block	aligned based (record_blockp),/* One per record address */
	  2 vtocx		fixed bin (15) uns unal,	/* Owning VTOCE index */
	  2 pageno	fixed bin (8) uns unal,	/* Owning page number */
	  2 state		fixed bin (2) uns unal,	/* State */
	  2 lock		bit (1) unal,		/* Lock bit on this block */
	  2 ovflx		fixed bin (10) uns unal;	/* Index of first overflow block on chain */

dcl	1 scavenger_data_pages
			aligned based (scavenger_datap),
	  2 page		(0:255) aligned,
	    3 word	(1024) bit (36) aligned;

dcl	1 scavenger_options aligned based (scavenger_optionsp),
	  2 print_meters	bit (1) unaligned,		/* ON => meter each scavenge into the log */
	  2 debug		bit (1) unaligned,		/* ON => do special debugging things */
	  2 dump		bit (1) unaligned,		/* ON => dump bad VTOCEs into syserr log */
	  2 trap		bit (1) unaligned,		/* ON => trap to BOS for debug */
	  2 no_optimize	bit (1) unaligned,		/* ON => no VTOCE read-ahead */
	  2 fault_under_ast bit (1) unaligned,		/* ON => fault under AST lock, benign */
	  2 fault_under_volmap bit (1) unaligned,	/* ON => fault under volmap lock, benign */
	  2 fault_under_pt bit (1) unaligned;		/* ON => fault inder PTL, NOT BENIGN */

dcl	(
	STATE_UNSEEN	init (0),
	STATE_FREE	init (1),
	STATE_IN_USE	init (2),
	STATE_CONFLICT	init (3)
	)		fixed bin int static options (constant);




/*  END OF:	scavenger_data.incl.pl1		  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
