/* BEGIN INCLUDE FILE . . . sl_list.incl.pl1 */

     declare 1 sl_list	      based,
	     2 version	      fixed binary,		/* Must be 2 */
	     2 link	      pointer,		/* Pointer to structure for next list */
	     2 name_count	      fixed binary,		/* Number of synonyms of this search list */
	     2 pad	      (3) bit (36),		/* Must be zero */
	     2 names	      (sl_list_name_count refer (sl_list.name_count)) char (32);
						/* Synonyms of this search list */

     declare sl_list_name_count     fixed binary;
     declare sl_list_version_2      fixed binary internal static options (constant) initial (2);

/* END INCLUDE FILE . . . sl_list.incl.pl1 */
