
/*  BEGIN INCLUDE FILE ... str.incl.pl1 ... last modified March 1970 */

dcl str_seg$ ext,
    strp ptr;

dcl 1 str based (strp) aligned,		/* segment or process trailer declaration */

   (2 fp bit (18),				/* forward ast trailer rel pointer */
    2 bp bit (18),				/* backward ast trailer rel pointer*/

    2 segno bit (18),			/* segment number*/
    2 dstep bit (18)) unaligned;		/* rel pointer to ring 0 dste */
 
dcl stra (0:8000) bit (72) based (strp) aligned;

/*  END INCLUDE FILE ... str.incl.pl1 */

