
/* BEGIN INCLUDE ...... swd ...... */

	/* Mod B GIOC Status Word Declaration */

	dcl 1 swd based aligned,			/* GIOC status word declaration */
	     (2 event bit (4),			/* status event */
	      2 int_sig bit (2),			/* internal signal bits */
	      2 chan bit (12),			/* channel number */
	      2 status bit (12),			/* status bits */
	      2 mbz1 bit (12),			/* MBZ */
	      2 dcwt bit (12),			/* DCW tally residue */
	      2 lpwt bit (12),			/* LPW tally residue */
	      2 mbz2 bit (6)) unaligned;		/* MBZ */

/* END INCLUDE ...... swd ...... */

