/* BEGIN INCLUDE FILE sys_log_constants.incl.pl1 ... 82-09-24 E. N. Kittlitz */


/****^  HISTORY COMMENTS:
  1) change(87-04-22,GDixon), approve(87-06-10,MCR7708),
     audit(87-06-02,Parisek), install(87-08-04,MR12.1-1056):
     Added sl_info structure and associated named constants for use in calling
     sys_log_$general.
                                                   END HISTORY COMMENTS */


/* format: style4 */

dcl  (
     SL_TYPE_CRASH init (-3),				/* type message with banner & kill system */
     SL_TYPE_BEEP init (-2),				/* type message with banner */
     SL_TYPE init (-1),				/* type message */
     SL_LOG_SILENT init (0),				/* log message */
     SL_LOG init (1),				/* log & type message */
     SL_LOG_BEEP init (2),				/* log & type message with banner */
     SL_LOG_CRASH init (3)				/* log & type message with banner & kill system */
     ) fixed bin internal static options (constant);

dcl  1 sl_info aligned automatic,
       2 version char(8),			/* structure version       */
       2 arg_list_ptr ptr,			/* arg_list with values    */
       2 loc,
         3 (mode, severity, code, caller, data, class, ioa_msg) fixed bin,
           /* These flags control where the corresponding data item is found.*/
	 /*  -1: data appears in the corresponding structure element below */
	 /*   0: data is not present anywhere			       */
	 /*  +N: data is Nth item in argument list pointed to by 	       */
	 /*      sl_info.arg_list_ptr.  Upon return, data copied into      */
	 /*      corresponding structure element.		       */
	 /*  if data = +N:					       */
	 /*      argN is data_ptr, argN+1 is data_len		       */
	 /*  if ioa_msg = +N:				       */
	 /*      argN+1, ... argLAST are arguments substituted into the    */
	 /*      ioa_msg control string.  The formatted msg is returned.   */
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal,	/* ioa_ctl is error code.  */
         3 flags_pad bit(35) unal,
       2 mode fixed bin,			/* as-mode, command-mode   */
       2 severity fixed bin,			/* error severity	       */
       2 code fixed bin(35),			/* error table code        */
       2 caller char(65) varying,		/* caller refname$entryname*/
       2 data,				/* binary data ptr/length  */
         3 data_ptr ptr,
         3 data_lth fixed bin(21),
       2 class char(10) varying,		/* binary data class       */
       2 ioa_msg char(500) varying;		/* formatted message text  */

/* *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */
/*							       */
/* If data values (eg, sl_info.caller) are passed in the argument list,      */
/* their data types should be as shown in the structure above, except that   */
/* character strings should be char(*) nonvarying.		       */
/*							       */
/* *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */

/* value for sl_info.version */
dcl  SL_INFO_version_1 char (8) int static options(constant) init("sl_info1");

/* values for sl_info.mode */
dcl (SL_INFO_as_mode init(1),
     SL_INFO_command_mode init(2)) fixed bin int static options(constant);

/* values for sl_info.loc.(severity code caller data class ioa_ctl arg) */
dcl (SL_INFO_arg_given_in_structure init(-1),
     SL_INFO_arg_not_given init(0)) fixed bin int static options(constant);


/* *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */
/*							       */
/* The following static structures are commonly used in the Login Server     */
/* user control software.					       */
/*							       */
/* *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */

/* Syntax: call Abort (severity, code, ioa_ctl, args);		       */

dcl  1 sl_info_sev_code_msg		aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init ( 1),
	  code 			init ( 2),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 3)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("0"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");

/* Syntax: call Abort (severity, ioa_ctl, args);			       */

dcl  1 sl_info_sev_msg		aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init ( 1),
	  code 			init ( 0),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 2)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("0"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");

/* Syntax: call Abort (severity, ioa_ctl_as_error_code, args);	       */

dcl  1 sl_info_sev_coded_msg		aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init ( 1),
	  code 			init ( 0),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 2)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("1"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");


/* Syntax: call Abort (severity, code, error_return_label, ioa_ctl, args);   */

dcl  1 sl_info_sev_code_label_msg	aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init ( 1),
	  code 			init ( 2),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 4)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("0"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");

/* Syntax:  call Log_error (code, ioa_ctl, args);			       */

dcl  1 sl_info_code_msg		aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init (-1),
	  code 			init ( 1),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 2)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("0"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");


/* Syntax:  call Trace (ioa_ctl, args);				       */

dcl  1 sl_info_msg			aligned int static options(constant),
       2 version char(8)		init ("sl_info1"),
       2 arg_list_ptr ptr		init (null),
       2 loc,
         3 (mode			init (-1),
	  severity  		init (-1),
	  code 			init ( 0),
	  caller 			init (-1),
	  data 			init ( 0),
	  class 			init ( 0),
	  ioa_msg			init ( 1)) fixed bin,
       2 flags,
         3 ioa_msg_is_error_code bit(1) unal init ("0"b),
         3 flags_pad bit(35) unal	init ("0"b),
       2 mode fixed bin		init ( 1),
       2 severity fixed bin		init ( 0),
       2 code fixed bin(35)		init ( 0),
       2 caller char(65) varying	init (""),
       2 data,
         3 data_ptr ptr		init (null),
         3 data_lth fixed bin(21)	init ( 0),
       2 class char(10) varying	init (""),
       2 ioa_msg char(500) varying	init ("");

/* END INCLUDE FILE sys_log_constants.incl.pl1 */
