/* Declaration of the system log file.

   This file contains all error messages put out by the answering service */

dcl 1 sys_log_file based (sys_log_ptr) aligned,
    2 count fixed bin,				/* number of messages */
    2 max fixed bin,				/* maximum number */
    2 ttime fixed bin (71),				/* date & time of last message */
    2 lep fixed bin,				/* last entry processed by daily_log_process */
    2 lls char (12),				/* suffix on last log */
    2 array (8159),
      3 time fixed bin (71),				/* time of entry */
      3 svty fixed bin,				/* severity of entry */
      3 line char (116);				/* error message. entry is 32 words */

/* end of system log declaration */
