/* BEGIN INCLUDE FILE ... system_dft_sr.incl.pl1 */

dcl  xsp ptr;
dcl 1 dft_sr_arg based (xsp) aligned,
    2 ntags fixed bin,
    2 nrules fixed bin,
    2 tags (10),
      3 name char (32),
      3 flag bit (36),
    2 rules (50),
      3 name char (168),
      3 flag bit (36);

/* END INCLUDE FILE ... system_dft_sr.incl.pl1 */
