/* BEGIN INCLUDE FILE ... system_types.incl.pl1 ... 03/23/81 ... W. Olin Sibert */

dcl  L68_SYSTEM	fixed bin (17) internal static options (constant) init (1);
dcl  ADP_SYSTEM	fixed bin (17) internal static options (constant) init (2);

dcl  SYSTEM_TYPE_NAME (2) char (8) internal static options (constant) init
    ("Level68", "ADP");

/* END INCLUDE FILE ... system_types.incl.pl1 */
