/* BEGIN INCLUDE FILE ..... tedstk.incl.pl1 ..... 04/16/76 J Falksen	       */

dcl sv_p		ptr;
dcl 1 sv		based (sv_p),
      2 prev	ptr,		/* ->previous frame		       */
      2 bp	ptr,		/* ->buffer control block last used  */
      2 ex	like b.ex,	/* execution limits in buffer	       */
      2 a0	like b.a_,	/* "." in buffer		       */
      2 stackl	bit (18)aligned,	/* linked list of occurances of same */
				/*  buffer in the stack	       */
      2 fill	bit (36)aligned,
      2 this	fixed bin (21),	/* space index before this frame was */
				/*  allocated		       */
      2 pn	fixed bin (21),	/* parameter number		       */
      2 pv (0:sv.pn),
        3 pp ptr,			/* pointer to parameter	       */
        3 pl fixed bin (21);		/* length of parameter	       */

dcl  pstr		based char (256);

dcl 1 call_stk	based (dbase.seg_p (3)),
      2 space	(2000) ptr;	/* place to put stack frames	       */

/* END INCLUDE FILE ..... tedstk.incl.pl1 .....			       */
