/* BEGIN INCLUDE FILE ... term_type_protocols.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(87-03-09,LJAdams), approve(87-04-03,MCR7646),
     audit(87-05-05,Gilcrease), install(87-05-14,MR12.1-1029):
     Created
  2) change(87-05-20,LJAdams), approve(87-05-20,MCR7699),
     audit(87-06-30,RBarstad), install(87-08-04,MR12.1-1056):
     Added support for MOWSE_FANSI protocol.
  3) change(87-06-15,LJAdams), approve(87-06-15,MCR7699),
     audit(87-06-30,RBarstad), install(87-08-04,MR12.1-1056):
     Changed name to term_type_protocols.incl.pl1 from
     terminal_type_protocols.incl.pl1 which was too long.
                                                   END HISTORY COMMENTS */

dcl  NO_PROTOCOL fixed bin int static options (constant) init (0);
dcl  MOWSE_PROTOCOL fixed bin int static options (constant) init (1);
dcl  MOWSE_FANSI_PROTOCOL fixed bin int static options (constant) init (2);

dcl  protocol_names (0:2) char (32) int static options (constant) init (
     "",               /* 0 */
     "MOWSE",          /* 1 */
     "MOWSE_FANSI");   /* 2 */

dcl  protocol_values (0:2) fixed bin int static options (constant) init (
     0,                /* No Protocol */
     1,                /* MOWSE       */
     2);               /* MOWSE_FANSI */

/* END INCLUDE FILE ... term_type_protocols.incl.pl1 */
