/* BEGIN INCLUDE FILE timer_manager_constants.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(85-03-05,Sibert), approve(87-05-25,MCR7678),
     audit(87-04-02,GDixon), install(87-08-04,MR12.1-1056):
     Initially written.
                                                   END HISTORY COMMENTS */

/* Values for the flags arguments in timer_manager_ calls */

dcl ABSOLUTE_MICROSECONDS bit (2) int static options (constant) init ("00"b);
dcl ABSOLUTE_SECONDS bit (2) int static options (constant) init ("01"b);
dcl RELATIVE_MICROSECONDS bit (2) int static options (constant) init ("10"b);
dcl RELATIVE_SECONDS bit (2) int static options (constant) init ("11"b);

/* END INCLUDE FILE timer_manager_constants.incl.pl1 */
