/* BEGIN INCLUDE FILE ... tq_info.incl.pl1 */
/* created by J. A. Bush 10/03/79 */

dcl  tq_infop ptr;					/* ptr to structure below */

dcl 1 tq_info based (tq_infop) aligned,			/* structure defining terminal quota attributes */
    2 trp (0:1) fixed bin (71),			/* time record product (0 is seg quota) */
    2 tup (0:1) bit (36),				/* clock time of update */
    2 received (0:1) fixed bin (35),			/* quota moved down */
    2 pad (0:1) fixed bin;				/* inferier quota count */

/* END INCLUDE FILE ... tq_info.incl.pl1 */
