/* BEGIN INCLUDE FILE ... tty_types.incl.pl1 ... Written 750415 by Paul Green */

dcl (TYPE_UNKNOWN   initial (0),
     TYPE_1050	initial (1),
     TYPE_2741	initial (2),
     TYPE_TTY37	initial (3),
     TYPE_TN300	initial (4),
     TYPE_ARDS	initial (5),
     TYPE_CORR	initial (6),
     TYPE_TTY33	initial (7),
     TYPE_TTY38	initial (8),
     TYPE_G115	initial (9),
     TYPE_ASCII	initial (11)
     ) fixed bin internal static options (constant);

/* END INCLUDE FILE ... tty_types.incl.pl1 */
