/* BEGIN INCLUDE FILE ... tty_mode_names.incl.pl1 */

/* Defines internal static character strings for all legal tty modes */
/* Created 6/17/75 by Robert Coren */
/* modified 4/10/79 by J. Stern to add MPX_MODES */
/* modified 8/13/79 by Robert Coren to add iflow & oflow */
/* modified 1/21/80 by Robert Coren to add no_outp, oddp, & 8bit */
/* modified 03/30/82 by Richard Lamson to add "ll", "pl", and "can_type" 
   and to reorganize modestr to be defined on MODE_NAME */


/****^  HISTORY COMMENTS:
  1) change(88-07-05,Parisek), approve(88-07-05,MCR7928),
     audit(88-07-08,Beattie), install(88-07-19,MR12.2-1061):
     Changed declaration of modestr to use the "simple defining" technique
     thus fixing compilation errors resulting from the use of the "isub"
     value within a "isub defining" technique (defining techniques as
     described in Multics PL/I Reference Manual - AM83).
                                                   END HISTORY COMMENTS */


dcl  n_modes fixed bin int static init (29);		/* number of valid modes */

declare	MODE_NAME (-2:29) character (8) internal static options (constant) initial
    ("ll", "pl", "can_type",				/* -2 : 0  */
     "edited", "tabs", "can", "esc",			/*  1 : 4  */
     "erkl", "rawi", "rawo", "red",			/*  5 : 8  */
     "vertsp", "crecho", "lfecho", "tabecho",		/*  9 : 12 */
     "hndlquit", "fulldpx", "echoplex", "capo",		/* 13 : 16 */
     "replay", "polite", "ctl_char", "blk_xfer",		/* 17 : 20 */
     "breakall", "scroll", "prefixnl", "wake_tbl",	/* 21 : 24 */
     "iflow", "oflow", "no_outp", "8bit",		/* 25 : 28 */
     "oddp");					/* 29 : 29 */


declare	modestr (1:29) character (8) unaligned defined (MODE_NAME (1));

/* MPX_MODES (i) = "1"b => modestr (i) must be implemented by a multiplexer */

dcl  MPX_MODES (29) bit (1) int static options (constant) init
    ("0"b, "0"b, "0"b, "0"b, "0"b, "0"b, "0"b, "0"b,	/* edited -> red */
     "0"b, "1"b, "1"b, "1"b, "0"b, "1"b, "1"b, "0"b,	/* vertsp -> capo */
     "1"b, "1"b, "0"b, "1"b, "1"b, "0"b, "1"b, "0"b,	/* replay -> wake_tbl */
     "1"b, "1"b, "1"b, "1"b, "1"b);			/* iflow -> oddp */


/* END INCLUDE FILE ... tty_mode_names.incl.pl1 */
