/* Begin include file urfe.incl.pl1 */

declare  urfep pointer automatic;
declare 1 urf_entry aligned based (urfep),
        2 last_name character (32),
        2 first_name character (24),
        2 title character (8),
        2 address character (32),
        2 prog_number character (32),
        2 project character (32),
        2 notes character (32);

/* End include file urfe.incl.pl1 */
