/* BEGIN vrm_index.incl.pl1 -- jaw, 5/12/78 */

/* Renamed 9/29/82 by R. Harvey */

/* This structure defines the header that gets put onto the beginning of
   each key stored into a database */


dcl 1 index aligned based (index_ptr),			/* layout of mdbm_index for all file types */
    2 rel_id bit (12) unal,				/* relation id */
    2 index_id bit (8) unal,				/* id of index within rel */
    2 mbz bit (7) unal,				/* pad to char. */
    2 index_value char (index_value_length) unal;		/* index value; max 253 chars */

dcl  index_ptr ptr;
dcl  index_value_length fixed bin (35);

/* END vrm_index.incl.pl1 */

