/* BEGIN INCLUDE FILE ws_tty_data */

/****^  HISTORY COMMENTS:
  1) change(86-12-05,RBarstad), approve(86-12-11,MCR7585),
     audit(86-12-12,Gilcrease), install(87-08-07,MR12.1-1075):
     ws_tty_ external static
                                                   END HISTORY COMMENTS */

dcl 1 ws_tty_data$Flags	aligned external static,
      3 Debug		bit (1) unaligned,
      3 Trace		bit (1) unaligned,
      3 Pad 		bit (34) unaligned;

/* END INCLUDE FILE ws_tty_data */
