/*  START OF:	xforum_args.incl.pl1		  *  *  *  *  * */

/* written February 1984 by Deryk Barker			      */

dcl  1 xforum_args         based (xforum_args_ptr),
       2 arg_list_ptr      ptr,
       2 ptrs(2)	       ptr,
       2 meeting_list      bit (1),
       2 menu_always       bit (1),
       2 multics_mode      bit (1),
       2 force_mode        bit (1),
       2 handle_interactive_messages bit (1),
       2 escape_sequences  bit (1);

dcl xforum_args_ptr        ptr;

/*  END OF:	xforum_args.incl.pl1		  *  *  *  *  * */
