/* BEGIN INCLUDE FILE     xforum_error_info      84-06-19 Davids */

dcl 01 xforum_error_info based,
     02 name char (32),
     02 entry char (32),
     02 doing char (100),
     02 code fixed bin (35),
     02 reason char (512);

/* END INCLUDE FILE     xforum_error_info */
