dcl 1 dyn_menu_req aligned based(dyn_menu_reqp),
      2 options_per_menu fixed bin,
      2 options_last_menu fixed bin,
      2 n_menus fixed bin;

dcl dyn_menu_reqp ptr;