/* Created 06/17/81 by Suzanne Krupp */

dcl (xmail_err_$no_help_available,
     xmail_err_$unable_to_get_help,
     xmail_err_$invalid_range,
     xmail_err_$invalid_list,
     xmail_err_$some_msgs_exist,
     xmail_err_$no_msgs_exist,
     xmail_err_$mailbox_empty,
     xmail_err_$all_msgs_deleted,
     xmail_err_$int_prog_err)
    ext static fixed bin(35);