/* Created 06/17/81 by Suzanne Krupp */

dcl (SEARCH_LIST char(4) init("info"),
     XMAIL_DOC_DIR char(29) init(">doc>subsystem>executive_mail"),  
     HELP_SUFFIX char(10) init("info"))
    int static options(constant);
