/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */

/* format: off */

/* Sets the info directories list used by the send_mail subsystem */

/* Created:  3 October 1982 by G. Palter */
/* Modified: August 1983 by G. Palter to convert to new mail system interface */

/* format: style4,delnl,insnl,ifthenstmt,ifthen */


sdm_set_info_directories_:
     procedure (P_sdm_invocation_ptr, P_code);


/* Parameters */

dcl  P_sdm_invocation_ptr pointer parameter;
dcl  P_code fixed binary (35) parameter;


/* send_mail info directories */

dcl  1 sdm_info_dirs aligned,
       2 header like info_dirs_list.header,
       2 dirs (2) like info_dirs_list.info_dirs;		/* see below */


/* Remaining declarations */

dcl  sdm_data_$info_directory character (168) external;

dcl  ssu_$set_info_dirs entry (pointer, pointer, fixed binary (35));

dcl  (addr, null, rtrim) builtin;
%page;
/* sdm_set_info_directories_: entry (P_sdm_invocation_ptr, P_code); */

	sdm_invocation_ptr = P_sdm_invocation_ptr;

	sdm_info_dirs.version = INFO_DIRS_LIST_VERSION_1;

	sdm_info_dirs.dirs (1).info_dirname = sdm_data_$info_directory;
	sdm_info_dirs.n_info_dirs = 1;		/* always include standard info files */

	if sdm_invocation.rdm_invocation_ptr ^= null () then do;
	     sdm_info_dirs.dirs (2).info_dirname = rtrim (sdm_data_$info_directory) || ">original_requests";
	     sdm_info_dirs.n_info_dirs = 2;		/* include original requests info files */
	end;

	call ssu_$set_info_dirs (sdm_invocation.sci_ptr, addr (sdm_info_dirs), P_code);

	return;
%page;
%include sdm_invocation;
%page;
%include ssu_info_dirs_list;

     end sdm_set_info_directories_;
