/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1986 *
        *                                                         *
        *********************************************************** */

/****^  HISTORY COMMENTS:
  1) change(86-08-28,Smith), approve(87-07-15,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Created.
  2) change(86-10-22,Smith), approve(87-07-15,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Removed name of capability as an input parameter since it is not sent
     with a delete_from_remote_cat_message.
  3) change(86-11-27,Flegel), approve(86-11-27,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Approved.
  4) change(86-12-10,Flegel), approve(86-12-10,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Replaced signalling of mowse_fatal_error with a call to fatal_mowse_trap_.
                                                   END HISTORY COMMENTS */
/* format: style4,indattr,ifthen,^indcomtxt,thendo,^indproc,^indblkcom,initcol1,declareind8,dclind4,struclvlind3,comcol55 */
delete_from_remote_cat_:
     proc (p_mcb_ptr, p_major_capability_number, p_code);

/* : PROCEDURE FUNCTION

Handles DELETE_FROM_REMOTE_CAT messages sent to MOWSE from a remote system.
Since this is an internal function and no replys to such messages are given
any errors detected are fatal to  MOWSE.
*/

/* : NOTES
*/


/* INPUT PARAMETERS */
dcl p_mcb_ptr	       ptr;
dcl p_major_capability_number
		       fixed bin parameter;	    /* major capability number (system|cap_num) */


/* OUTPUT PARAMETERS */
dcl p_code	       fixed bin (35);	    /* return code */


/* MISC VARIABLES */
dcl mowse_info_ptr	       ptr;		    /* Pointer to mowse info structure */
dcl cap_numb	       fixed bin;		    /* major capability index (usable as index into CAT tables ) */
dcl sysid		       fixed bin;		    /* MOWSE system id */


/* STRUCTURES */


/* SYSTEM CALLS */
dcl capability_$unpack     entry (fixed bin, fixed bin, fixed bin,
		       fixed bin (35));


/* SYSTEM CALL SUPPORT */
dcl ws_error_$invalid_capability_number
		       fixed bin (35) ext static;

/* EXTERNAL CALLS */
dcl get_mowse_info_ptr_    entry (ptr, ptr, fixed bin (35));
dcl fatal_mowse_trap_      entry (fixed bin (35));

/* CONDITIONS */

/* BUILTINS */

/* CONSTANTS */
dcl FALSE		       bit (1) int static options (constant) init ("0"b);

/**/
/* INITIALIZATION */

	call get_mowse_info_ptr_ (p_mcb_ptr, mowse_info_ptr, p_code);
	if p_code ^= 0 then
	     return;

/* MAIN */

/* : Check the major_capability_number */

	if p_major_capability_number < MINIMUM_CAT_ENTRY |
	     p_major_capability_number > MAXIMUM_CAT_ENTRY
	then do;
	     call fatal_mowse_trap_ (ws_error_$invalid_capability_number);
	     return;
	end;

/* : Find the remote cat table entry associated with input parameters
     If it is not found then return ws_error_$invalid_capability_number */

	call capability_$unpack (sysid, cap_numb,
	     (mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number)
	     .major_capability), p_code);
	if p_code ^= 0 | cap_numb ^= p_major_capability_number then do;
	     call fatal_mowse_trap_ (ws_error_$invalid_capability_number);
	     return;
	end;

/* : re - initialize the remote cat entry */

	mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number)
	     .major_capability = 0;
	mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number)
	     .capability_name = "";
	mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number).flags
	     .reset = "0"b;
	mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number).flags
	     .suspended = "0"b;
	mowse_info_ptr
	     -> mowse_info.remote_cat (p_major_capability_number)
	     .sleep_time = FALSE;

	p_code = 0;
	return;

%page;
/* INCLUDE FILES */
%include mowse;
%include mowse_info;

/* : END */
     end;
