/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
/* sslt_init_.pl1 -- copies template slt from template_slt_ into temp segs */
/* for the checker. BIM 7/2/82 */
/* format: style2 */

sslt_init_:
     procedure (slt_ptr, name_table_ptr);

	declare (slt_ptr, name_table_ptr)
				 pointer parameter;

%include slt;

	declare addr		 builtin;

	declare template_slt_$slt_length
				 fixed bin ext;
	declare template_slt_$name_table_length
				 fixed bin ext;

	declare template_slt_$t_slt	 bit (36) aligned ext;
	declare template_slt_$t_name_table
				 bit (36) aligned ext;

	declare move_slt		 (template_slt_$slt_length) bit (36) aligned based;
	declare move_nt		 (template_slt_$name_table_length) bit (36) aligned based;

	declare (init_tox, init_fromx, x)
				 fixed bin;

	slt_ptr -> move_slt = addr (template_slt_$t_slt) -> move_slt;
	name_table_ptr -> move_nt = addr (template_slt_$t_name_table) -> move_nt;

	sltp = slt_ptr;

/*  It still remains to relocate the init segs in their proper place */

	init_fromx = slt.last_sup_seg + 1;
	init_tox = slt.first_init_seg;

	do x = 0 to slt.last_init_seg - slt.first_init_seg;
	     slt.seg (init_tox + x) = slt.seg (init_fromx + x);
	     slt.seg (init_fromx + x) = 0;
	end;

	slt_ptr -> slt.name_seg_ptr = name_table_ptr;
	return;
     end sslt_init_;
