/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
convert_word_char_: proc (word, hyphens, last, result);
dcl  i fixed bin;
dcl  result char (*) varying;
dcl  word char (*);
dcl  hyphens (*) bit (1) aligned;
dcl  last fixed bin;
	if last < 0
	then
	     do;
	     result = word || "**";
	     return;
	end;
	result = "";
	do i = 0 to length (word);
	     if i ^= 0
	     then
		do;
		result = result || substr (word, i, 1);
		if hyphens (i) then result = result || "-";
	     end;
	     if last > 0 & last = i+1
	     then result = result || "*";
	end;
     end;
