/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1985 *
   *                                                         *
   *********************************************************** */
/* format: style5 */

pnt_notify_as_:
        procedure (P_person_id, P_code);

/**** This entry is called by the Ring-1 PNT software when it wishes to
      inform the answering service of a PNT change.  It's only arguments
      are a user_id and a status code. */

/* Parameters */

        dcl     P_code		fixed bin (35) parameter;
					      /* status code */
        dcl     P_person_id		char (*) parameter;
					      /* person_id whose PNT entry changed */

/* Automatic */

        dcl     code		fixed bin (35) automatic;
					      /* status code */
        dcl     1 NPCI		structure aligned
				like asr_note_pnt_change_info;
					      /* info structure */

/* Entries */

        dcl     send_as_request_$no_block
				entry (pointer, fixed binary,
				bit (72) aligned, fixed binary (35));

/* Builtin */

        dcl     addr		builtin;
        dcl     size		builtin;
%page;
/* Program */

        code = 0;

        NPCI.header.version = as_request_version_1;
        NPCI.header.type = ASR_NOTE_PNT_CHANGE;
        NPCI.header.reply_channel = 0;		      /* we don't care about a reply */
        NPCI.version = ASR_NPC_INFO_VERSION_1;
        NPCI.person_id = P_person_id;

        call send_as_request_$no_block (addr (NPCI), size (NPCI), (""b), code);

        P_code = code;
        return;

/* format: off */
%page; %include as_request_header;
%page; %include as_requests;
/* format: on */

        end pnt_notify_as_;
