/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


set_epilogue_command: sec: proc;

dcl  command char (256) int static init ("");
dcl  code fixed bin (35);
dcl  argp ptr;
dcl  arglen fixed bin;
dcl  arg char (arglen) based (argp);

dcl  cu_$arg_ptr entry (fixed bin, ptr, fixed bin, fixed bin (35));
dcl  com_err_ entry options (variable);
dcl  default_error_handler_$add_finish_handler entry (entry, fixed bin (35));
dcl  cu_$cp entry (ptr, fixed bin, fixed bin (35));

	code = 0;
	call cu_$arg_ptr (1, argp, arglen, code);
	if code ^= 0 then goto ret;
	command = arg;
	call default_error_handler_$add_finish_handler (do, code);
ret:
	if code ^= 0 then call com_err_ (code, "set_epilogue_command");
	return;

do:	entry;
	call cu_$cp (addr (command), length (command), code);
	return;

     end set_epilogue_command;
