/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


available_slots_: proc (q, maxu, res, used) returns (fixed bin);

/* Procedure to return the number of absentee slots available to a given queue.
   Input parameters are the queue, the total abs maxu, and the arrays giving the
   number of slots reserved for each queue and the number in use by each queue.

   Written by T. Casey, May 1978

*/

dcl  q fixed bin;
dcl  maxu fixed bin;
dcl  res (4) fixed bin;
dcl  used (4) fixed bin;

dcl (i, temp_maxu) fixed bin;

	temp_maxu = maxu;				/* copy max abs users */

	do i = 1 to 4;				/* go through all queues */
	     temp_maxu = temp_maxu - used (i);		/* deduct slots in use */
	     if i < q then				/* if this is a higher priority queue */
		if res (i) > used (i) then		/* and slots must be reserved for it */
		     temp_maxu = temp_maxu - (res (i)-used (i)); /* deduct them */
	end;

	if temp_maxu < 0 then temp_maxu = 0;

/* if it goes negative, that means that not only this queue, but one or more higher priority queues,
   are shut off because their slots have been grabbed by jobs from even higher priority queues */

	return (temp_maxu);

     end available_slots_;
