/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */





/****^  HISTORY COMMENTS:
  1) change(86-03-06,Blair), approve(86-03-06,MCR7358),
     audit(86-04-18,RBarstad), install(86-05-28,MR12.0-1062):
     If user types "yes" to "Do you want to discard the file", then ask him
     whether or not he wishes to print the messages in the file.
                                                   END HISTORY COMMENTS */


/* Begin xmail_discard_file_ */
/* Created by R. Ignagni  Oct 1981
 
   83-06-27  DJ Schimke: Declared rtrim builtin. Deleted dcls for unreferenced
   ioa_$nnl, xmail_err_$int_prog_err, and xmail_error_$no_code.

   83-09-14  DJ Schimke: Modified to use xmail_data.mail_dir rather than 
   getting its own pathname to the xmail directory. Added xmail_data include
   file. Deleted dcls for person, project, and user_info_$whoami.

   83-10-06  DJ Schimke: Changed call to xmail_get_str_ to call 
   xmail_get_str_$yes_no.
*/

xmail_discard_file_: proc (P_mailbox_ptr, P_curr_msgsp, P_file_name, P_discarded);
	user_message1 = "Do you want to discard mail file ""^a""? ";
	user_message2 = "^/Mail file ""^a"" was discarded.";
	user_message3 = "Do you want to print the messages in ""^a""? ";
	delete_switches = "100111"b;
	go to START;

link: entry (P_mailbox_ptr, P_curr_msgsp, P_file_name, P_discarded);

	user_message1 = "Do you want to remove the link to mail file ""^a""? ";
	user_message2 = "^/Link to mail file ""^a"" was removed.";
	delete_switches = "100110"b;
	go to START;

/* Params */

	dcl     P_mailbox_ptr	 ptr;
	dcl     P_curr_msgsp	 ptr;
	dcl     P_file_name		 char (*);
	dcl     P_discarded		 bit (1) aligned;

/* Automatic */

	dcl     code		 fixed bin (35);
	dcl     delete_switches	 bit (6);
	dcl     prompt_string	 char (80) var;
	dcl     user_message1	 char (50) varying;
	dcl     user_message2	 char (40) varying;
          dcl     user_message3          char (50) varying;
	dcl     yes_sw		 bit (1) aligned;

/* Entries */

	dcl     delete_$path	 entry (char (*), char (*), bit (6), char (*), fixed bin (35));
	dcl     ioa_		 entry () options (variable);
	dcl     ioa_$rsnnl		 entry () options (variable);
	dcl     xmail_get_str_$yes_no	 entry (char (*) var, bit (1) aligned);
	dcl     xmail_dprint_msgs_	 entry (ptr, ptr);

/* Builtin */

	dcl     (null, rtrim)	 builtin;

/* Constant */

	dcl     ME_CHAR		 char (19) init ("xmail_discard_file_") int static options (constant);

/* Include */

%page;
%include xmail_data;

START:

	P_discarded = "0"b;

	call ioa_$rsnnl (user_message1, prompt_string, (0), P_file_name);
	call xmail_get_str_$yes_no (prompt_string, yes_sw);
	if yes_sw then do;
	     if P_curr_msgsp ^= null ()
	     then do;
		call ioa_$rsnnl (user_message3, prompt_string, (0), P_file_name);
		call xmail_get_str_$yes_no (prompt_string, yes_sw);
		if yes_sw then
		call xmail_dprint_msgs_ (P_mailbox_ptr, P_curr_msgsp);
		call ioa_ ("The messages in ""^a"" were ^[not ^]submitted for printing .", P_file_name, ^yes_sw);
	     end;

	     call delete_$path ((xmail_data.mail_dir), rtrim (P_file_name)
		|| ".sv.mbx", delete_switches, ME_CHAR, code);
	     call ioa_ (user_message2, P_file_name);
	     P_discarded = "1"b;
	end;
EXIT:

	return;

     end xmail_discard_file_;
