/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

create_cross_reference: proc returns(ptr) ;

/*	Modified on:	April 1977 by RHS for new allocation methods */

dcl	p ptr,
	null builtin;
dcl	pl1_stat_$node_uses(32) fixed bin ext;

%include pl1_tree_areas;
%include cross_reference;
%include nodes;

	pl1_stat_$node_uses(16) = pl1_stat_$node_uses(16) + 1;

	allocate cross_reference in(tree_area) set(p);
	p -> node_type = cross_reference_node;
	p -> next = null;
	return(p);

	end;
