/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

declare_integer:	proc(cur_block) returns(ptr);

declare	(cur_block,s) pointer;
declare	null builtin;
%include language_utility;
%include boundary;
%include declare_type;
%include symbol;
%include system;


	s = create_symbol(cur_block,(null),by_compiler);

	substr (string (s -> symbol.attributes), 1, 36) = integer_type;

	s->symbol.auto  ,
	s->symbol.allocate = "1"b;

	s->symbol.boundary=word_;
	s->symbol.c_word_size=1;
	s->symbol.c_bit_size=bits_per_word;
	s->symbol.c_dcl_size=default_fix_bin_p;

	return(s->symbol.reference);

	end declare_integer;
