/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

declare_pointer:	proc(cur_block) returns(ptr);

dcl	(cur_block,s) ptr;
dcl	null builtin;

%include language_utility;
%include boundary;
%include declare_type;
%include symbol;
%include system;


	s=create_symbol(cur_block,(null),by_compiler);

	s->symbol.ptr  ,
	s->symbol.auto  ,
	s->symbol.allocate = "1"b;

	s->symbol.boundary=mod2_;
	s->symbol.c_word_size=2;
	s->symbol.c_bit_size=bits_per_word+bits_per_word;

	return(s->symbol.reference);

	end declare_pointer;
