/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
gfms_serial_number_record_: proc ();

/* Display tape serial number record information.

   Author: Dave Ward	10/01/80
*/
	call iox_$read_record (
	     cbp					/* (input) pointer to control block. */
	     , addr (tsnr)				/* (input) record buffer. */
	     , size (tsnr)*4			/* (input) buffer length in bytes. */
	     , nbr				/* (output) number of bytes read. */
	     , code				/* (output) I/O system status. */
	     );
	if code ^= 0 then do;
	     call com_err_ (
		code
		, "gfms_serial_number_record_"
		, "Attempting to read tape serial number record."
		||"^/Tape status ^4.3b"
		||"^/buffer length ^i (bytes)."
		||"^/bytes read ^i."
		||"^/attach description ""^a"""
		, gfms_tape_status_ (cbp)
		, size (tsnr)*4
		, nbr
		, attach_description
		);
fail:	     ;
	     signal cond (gfms_fail);
	end;

	call ioa ("^|TAPE SERIAL NUMBER RECORD INFORMATION (block 1):");
	if word0.b00_17 = 1				/* Must be block 1 of record. */
	& word0.b18_35 = 65
	& word1.b00_17 = 64
	& word1.b18_35 = "000017"b3 then do;		/* Expected constants. */
	     call ioa ("serial number of copy this volume ^a", gfms_ascii_ ((word2)));
	     call ioa ("serial number of latest journal tape ^a", gfms_ascii_ ((word2)));
	end;
	else do;					/* Constant(s) improper. */
	     call com_err_ (
		0
		, "gfms_serial_number_record_"
		, "serial number record constants not as expected."
		);
	     call gfms_dump_rec_ (
		addr (tsnr)
		, divide (nbr+3, 4, 17)
		);
	     goto fail;
	end;
	return;
%page;
/*  Variables for gfms_serial_number_record_:			*/
/*   IDENTIFIER		ATTRIBUTES	*/
dcl  code                     fixed bin(35);
dcl  com_err_                 entry() options(variable);
dcl  gfms_ascii_              entry(bit(*))returns(char(*));
dcl  gfms_dump_rec_           entry (ptr, fixed bin);
dcl  gfms_fail                condition ext;
dcl  gfms_tape_status_        entry (ptr) returns(bit(12));
dcl  hbound                   builtin;
dcl  i                        fixed bin;
dcl  ioa_                     entry() options(variable);
dcl  ioa_$nnl                 entry() options(variable);
dcl  iox_$read_record         entry (ptr, ptr, fixed bin(21), fixed bin(21), fixed bin(35));
dcl  j                        fixed bin;
dcl  nbr                      fixed bin(21);
dcl  size                     builtin;
dcl  word                     (0:size(tsnr)-1)bit(36)aligned based(addr(tsnr));

/* See DD14, Rev 1 (June 1976) SYSTEM TABLES
   Page 16-24 TAPE SERIAL NUMBER RECORD (66 words)
*/
dcl 1 tsnr		aligned
,     3 word0		/* File and Record Control BCW. */
,       4 b00_17		fixed bin(18)unsigned unal
,       4 b18_35		fixed bin(18)unsigned unal
,     3 word1		/* File and Record Control RCW. */
,       4 b00_17		fixed bin(18)unsigned unal
,       4 b18_35		bit(18)unal
,     3 word2		bit(36) /* tape serial number of copy of vol. */
,     3 word3		bit(36) /* tape serial number of latest journal tape. */
,     3 words4_65		(4:65)bit(36) /* Reserved for GCOS. */
;
%page;
%include gfms_ext;
     end gfms_serial_number_record_;
