/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        *********************************************************** */
/* SET_SMIC_PATTERN - Procedure to Create SMIC Patttern from Interrupt Cell Number.
	coded 8/26/74 by Noel I. Morris	*/


/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */


set_smic_pattern: proc (cell) returns (bit (36) aligned);

dcl  cell fixed bin (5);				/* interrupt cell number */


dcl  smic_word bit (36) aligned;			/* SMIC pattern */

dcl (mod, substr) builtin;


		/*  */

	smic_word = "0"b;				/* Clear pattern initially. */
	substr (smic_word, mod (cell, 16) + 1, 1) = "1"b;	/* Turn on appropriate bit. */
	substr (smic_word, 36, 1) = (cell >= 16);	/* Set low-order bit appropriately. */

	return (smic_word);				/* Return completed pattern. */


     end set_smic_pattern;
