/* ***********************************************************
   *                                                         *
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1981 *
   *                                                         *
   *                                                         *
   *********************************************************** */

/* *************************************************************
   *						   *
   * Copyright (c) 1979 by Honeywell Information Systems, Inc. *
   *						   *
   ************************************************************* */
gtss_dump_program_stack_: dps: proc;

/* Program to dump program and callss stacks for debugging purposes.

	Authors:	Robert J. Grimes	Created
		Albert N. Kepner	  1978
		Robert M. May
		David B. Ward
*/

dcl  i fixed bin (24);
dcl  j fixed bin (24);
dcl  k fixed bin (24);
dcl  l fixed bin (24);
dcl  ioa_ entry options (variable);

	i = gtss_ust.lxxx.b0_17 - fixed (rel (addr (gtss_ust.lxxx)))
	     + fixed (rel (addr (gtss_ust)));
	call ioa_ ("^/Program Stack:");
	call ioa_ ("current depth = ^i.", i);
	do j = 1 to i;
	     k = lprgs.b0_17 (j);
	     l = lprgs.b18_35 (j);
	     call ioa_ ("Descriptor: ^a  Primitive: ^o", ss_name (k), l);
	end;
	call ioa_ ("^/CALLSS Stack:");
	i = divide (gtss_ust.lcals.b0_17 - fixed (rel (addr (gtss_ust.lcals))) +
	     fixed (rel (addr (gtss_ust))), 2, 24, 0);
	call ioa_ ("current depth = ^i.", i);
	do j = 1 to i;
	     call ioa_ ("Program stack reference = ^i; ss_flags = ^o.",
		subsystems (j).tally_address
		-fixed (rel (addr (gtss_ust.lxxx)))+fixed (rel (addr (gtss_ust))),
		fixed (subsystems (j).ss_flags));
	end;
	call ioa_ ("gtss_ext_$stack_level_ = ^i.",
	     gtss_ext_$stack_level_);
%include gtss_prgdes_;
%include gtss_ust_ext_;
%include gtss_ext_;
     end gtss_dump_program_stack_;
