/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


is_legal_proj: proc (name, ans);

/* IS_LEGAL_PROJ - answer whether a project is a legal one. looks in SAT */

dcl  name char (*) unal,
     name1 char (32) aligned,
     en char (32) aligned,
     ans char (*) varying,
     i fixed bin,
     ec fixed bin,
     satep ptr,
     satp ptr;

dcl (addr, null) builtin;

dcl  active_fnc_err_ entry options (variable),
     error_table_$wrong_no_of_args fixed bin ext,
     cu_$arg_count entry (fixed bin),
     hcs_$initiate entry (char (*) aligned, char (*) aligned, char (*) aligned,
     fixed bin, fixed bin, ptr, fixed bin),
     get_wdir_ entry () returns (char (168) aligned);

/* =============================================== */

	call cu_$arg_count (i);			/* check arg count */
	if i ^= 2 then do;
	     ec = error_table_$wrong_no_of_args;
	     en = "";
er:	     call active_fnc_err_ (ec, "is_legal_proj", en);
	     return;
	end;
	name1 = name;
	ans = "false";
	en = "smf.cur.sat";
	call hcs_$initiate ((get_wdir_()), en, "", 0, 1, satp, ec);
	if satp = null then go to er;
	do i = 1 to sat.current_size;
	     satep = addr (sat.project(i));
	     if satep -> project.state = 1 then
	     if name1 = satep -> project.project_id then go to yup;
	end;
	return;
yup:	ans = "true";

%page;
%include sat;
%page;
%include user_attributes;


     end is_legal_proj;
