/* ***********************************************************
   *                                                         *
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1981 *
   *                                                         *
   *                                                         *
   *********************************************************** */

/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

vrmu_add_indexes: proc (iocb_ptr, key_list_ptr, tuple_id, code);

/* NOTES:

   This procedure adds all keys in the list pointed to by key_list_ptr to the tuple
   specified by tuple id.  The key is associated with the tuple id,
   and not with the record directly.
*/

/* HISTORY:

   Initially written by JA Weeldreyer -- June, 1978.
   Renamed and modified for vfile_relmgr_ by R. Harvey -- 20 September 1982.

*/
%page;
/* vrmu_add_indexes: proc (iocb_ptr, key_list_ptr, tuple_id, code); */

/* Parameters */

	dcl     iocb_ptr		 ptr;		/* vfile iocb */

/*	dcl     key_list_ptr	 ptr;		/* key values to be added */
	dcl     tuple_id		 bit (36) aligned;	/* record keys are to be associated with */
	dcl     code		 fixed bin (35);	/* output error code */


	do i = 1 to key_list.number_of_keys;		/* add each key in list */

	     key_list.key_info.vf_info.input_key (i),	/* set up info for vfile_ */
		key_list.key_info.vf_info.input_desc (i) = "1"b;
	     addr (key_list.key_info.vf_info.vf_desc (i)) -> b36 = tuple_id; /* move in tuple id as descr. */

	     call iox_$control (iocb_ptr, "add_key", addr (key_list.key_info.vf_info (i)), icode); /* let vfile_ do the work */
	     if icode ^= 0 then call error (icode);

	end;					/* index additon loop */

	code = 0;
exit:
	return;
%page;
error: proc (cd);

/* Internal error procedure */

	dcl     cd		 fixed bin (35);

	code = cd;
	go to exit;

     end error;
%page;
%include vrm_key_list;



	dcl     i			 fixed bin;
	dcl     b36		 bit (36) based;

	dcl     icode		 fixed bin (35);	/* internal status code */

	dcl     addr		 builtin;

	dcl     iox_$control	 entry (ptr, char (*), ptr, fixed bin (35));

     end vrmu_add_indexes;
