/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */
od_idx:
online_doc_db_index:
     proc;

	dcl     online_doc_db_index	 fixed bin (35) int static init (0);

	dcl     p_index		 fixed bin (35);

set_index:
     entry (p_index);

	online_doc_db_index = p_index;

	return;

return_index:
     entry (p_index);

	p_index = online_doc_db_index;

	return;

     end online_doc_db_index;
