/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */




/****^  HISTORY COMMENTS:
  1) change(86-05-13,GJohnson), approve(86-05-13,MCR7387),
     audit(86-05-13,Martinson), install(86-05-14,MR12.0-1056):
     Correct error message documentation.
                                                   END HISTORY COMMENTS */


access_viol$am_fault:	proc (mc_ptr);

/* modified by E. Stone April 1974 to convert to v2 pl1 */
/* modified by THVV 8/77 to remove obsolete entry $ring_alarm */

dcl  mc_ptr ptr;				/* pointer to machine conditions */

dcl syserr entry options (variable);

	call syserr(1, "access_viol: associative memory fault.");
	return;

/* BEGIN MESSAGE DOCUMENTATION

Message:
access_viol: associative memory fault.

S:	$crash

T:	$run

M:	The processor associative memory has detected a usage count error.

A:	Notify Field Engineering personnel.



END MESSAGE DOCUMENTATION */

end;
