/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


mountedp: proc (a_lvid) returns (fixed bin (35));

/*

   Written 03/11/76 by R. Bratt to answer the question: is my process
   able to use a given logical volume

*/

dcl  a_lvid bit (36) aligned;
dcl  lvid bit (36) aligned,
     code fixed bin (35);
dcl  logical_volume_manager$lvtep entry (bit (36) aligned, ptr, fixed bin (35)),
     private_logical_volume$lvx entry (bit (36) aligned, fixed bin (8), fixed bin (35));

	lvid = a_lvid;
	call logical_volume_manager$lvtep (lvid, lvtep, code);
	if code ^= 0 then return (code);
	if lvtep -> lvte.public then return (0);
	call private_logical_volume$lvx (lvid, (0), code);
	return (code);

/*  */

%include lvt;

     end mountedp;
