/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

context: proc(name,cblock,type);

dcl	(name,cblock,d,p) ptr;
dcl	(type,n) fixed bin(15);
dcl	(null,string,substr) builtin;

%include language_utility;
%include context;
%include context_codes;
%include nodes;
%include block;

			/*      */

/* this item must be an identifier			*/

	if name->node.type ^= token_node then go to exit;

	/* cblock is only null inside a generic <arg selector>.
	   No <reference>s may be contained inside an <arg selector>. */

	if cblock = null
	then do;
	     call parse_error(439,name);
	     go to exit;
	     end;

	p=cblock->block.context;
	do while(p^=null);
		if p->context.token = name then go to record;
		p=p->context.next;
	end;

	p=create_context(cblock,name);

record:
	substr(string(p->context.bits),type,1) = "1"b;

exit:
	end context;
