/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/* DELETE_VOLUME_QUOTA - Command to delete a quota account from a logial volume */

/* Written March 1977 by Larry Johnson */

delete_volume_quota: dlvq: proc;

dcl  name char (19) int static options (constant) init ("delete_volume_quota");
dcl  code fixed bin (35);
dcl  arg_ptr ptr;
dcl  arg_len fixed bin;
dcl  arg char (arg_len) based (arg_ptr);
dcl  volume char (32);
dcl  account char (32);

dcl  cu_$arg_ptr entry (fixed bin, ptr, fixed bin, fixed bin (35));
dcl  com_err_ entry options (variable);
dcl  mdc_$delete_volume_quota entry (char (*), char (*), fixed bin (35));

	call cu_$arg_ptr (1, arg_ptr, arg_len, code);
	if code ^= 0 then do;
print_usage:   call com_err_ (0, name, "Usage: ^a volume account", name);
	     return;
	end;
	volume = arg;

	call cu_$arg_ptr (2, arg_ptr, arg_len, code);
	if code ^= 0 then go to print_usage;
	account = arg;

	call mdc_$delete_volume_quota (volume, account, code);
	if code ^= 0 then call com_err_ (code, name);
	return;

     end delete_volume_quota;
