/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/* SET_MDIR_ACCOUNT:  Command to change the quota account of a master directory */

/* Written March 1976 by Larry Johnson */

set_mdir_account: smda: proc;

dcl  code fixed bin (35);				/* System status code */
dcl  name char (16) int static options (constant) init ("set_mdir_account");
dcl  arg_ptr ptr;
dcl  arg_len fixed bin;
dcl  arg char (arg_len) based (arg_ptr);
dcl  dir char (168);
dcl  ename char (32);
dcl  account char (32);

dcl  ioa_ entry options (variable);
dcl  com_err_ entry options (variable);
dcl  mdc_$set_mdir_account entry (char (*), char (*), char (*), fixed bin (35));
dcl  expand_path_ entry (ptr, fixed bin, ptr, ptr, fixed bin (35));
dcl  cu_$arg_ptr entry (fixed bin, ptr, fixed bin, fixed bin (35));

dcl (addr) builtin;

	call cu_$arg_ptr (1, arg_ptr, arg_len, code);	/* Get path */
	if code ^= 0 then do;
	     call ioa_ ("Usage: ^a path -account-", name);
	     return;
	end;
	call expand_path_ (arg_ptr, arg_len, addr (dir), addr (ename), code);
	if code ^= 0 then do;
	     call com_err_ (code, name, "^a", arg);
	     return;
	end;

	call cu_$arg_ptr (2, arg_ptr, arg_len, code);	/* New account */
	if code ^= 0 then account = "";		/* Standard default */
	else account = arg;

	call mdc_$set_mdir_account (dir, ename, account, code);
	if code ^= 0 then call com_err_ (code, name);
	return;

     end set_mdir_account;
