/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1988                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */



/****^  HISTORY COMMENTS:
  1) change(88-09-07,WAAnderson), approve(88-09-30,MCR7952),
     audit(88-09-30,JRGray), install(88-10-24,MR12.2-1184):
     Added format control comment to make the source more readable.
                                                   END HISTORY COMMENTS */


/* format: style1,insnl,ifthendo,indthenelse,^indnoniterdo,^inditerdo,indcom,^indthenbegin,^indprocbody,ind2,ll78,initcol0,dclind4,idind24,struclvlind1,comcol41 */

/****  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */

probe_cv_stu_code_:
  proc (P_code);

  /* *	This procedure exists solely to convert the silly status code from stu_
   *	(called steps) into a more useful probe_et_ code. */

  dcl P_code		fixed bin (35) parameter;
				/* input and output */

  dcl (
      probe_et_$no_block,
      probe_et_$too_many_levels,
      probe_et_$too_long,
      probe_et_$no_dcl,
      probe_et_$ambiguous_ref
      )			fixed bin (35) external;

  if P_code >= 0
    then return;
  else if P_code < -5
    then return;
  else if P_code = -1
    then P_code = probe_et_$no_block;
  else if P_code = -2
    then P_code = probe_et_$too_many_levels;
  else if P_code = -3
    then P_code = probe_et_$too_long;
  else if P_code = -4
    then P_code = probe_et_$no_dcl;
  else if P_code = -5
    then P_code = probe_et_$ambiguous_ref;

  return;
  end;				/* probe_cv_stu_code_ external procedure */
