/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/* CHECK_MDCS: Command to validate the contents of a master direcotry control segment */

/* Written June 1976 by Larry Johnson */

check_mdcs: proc;

dcl  name char (10) int static options (constant) init ("check_mdcs");
dcl  code fixed bin (35);
dcl  arg_ptr ptr;
dcl  arg_len fixed bin;
dcl  arg char (arg_len) based (arg_ptr);
dcl  volume char (32);

dcl  cu_$arg_ptr entry (fixed bin, ptr, fixed bin, fixed bin (35));
dcl  ioa_ entry options (variable);
dcl  com_err_ entry options (variable);
dcl  mdc_priv_$validate_uidpaths entry (char (*), fixed bin (35));

dcl  error_table_$bad_uidpath ext fixed bin (35);

	call cu_$arg_ptr (1, arg_ptr, arg_len, code);
	if code ^= 0 then do;
	     call com_err_ (0, name, "Usage: ^a volume", name);
	     return;
	end;

	volume = arg;

	call mdc_priv_$validate_uidpaths (volume, code);
	if code = 0 then call ioa_ ("^a: No errors detected in ^a.mdcs", name, volume);
	else if code = error_table_$bad_uidpath then
	     call com_err_ (0, name, "One or more uidpaths in ^a.mdcs were invalid and were deleted.", volume);
	else call com_err_ (code, name, "^a", volume);
	return;

     end check_mdcs;
