/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* Modified 790328 by PG to let ioa_ line up the pointers, now that ^10p works. */
/* Modified 790705 by PG to fix bug in ioa_ format */

apl_display_symtab:
adst:
     procedure;

/* automatic */

dcl	arg_len		fixed bin (21);
dcl	arg_ptr		ptr;
dcl	brief		bit (1) aligned;
dcl	code		fixed bin (35);
dcl	flag		char (1);
dcl	meaning_ptr	ptr unal;
dcl	meaning_reference_count
			fixed bin (29);
dcl	symbol_bead_ptr	ptr unaligned;
dcl	(bucket_index, index_within_bucket)
			fixed bin;

/* based */

dcl	arg_string	char (arg_len) based (arg_ptr);

/* builtins */

dcl	(binary, fixed, hbound, lbound, max, null)
			builtin;

/* entries */

dcl	cu_$arg_ptr	entry (fixed bin, ptr, fixed bin (21), fixed bin (35));
dcl	ioa_		entry options (variable);

/* program */

	brief = "0"b;

	call cu_$arg_ptr (1, arg_ptr, arg_len, code);
	if code = 0
	then if arg_string = "-bf" | arg_string = "-brief"
	     then brief = "1"b;

	call ioa_ ("symbol table at ^p, ^d symbols", ws_info.symbol_table_ptr, ws_info.number_of_symbols);
	call ioa_ ("bucket^2xloc^xref ct^xsize^2xmeaning^2xref ct^2xname");
	do bucket_index = lbound (symbol_table.hash_bucket_ptr, 1) to hbound (symbol_table.hash_bucket_ptr, 1);
	     index_within_bucket = 1;
	     do symbol_bead_ptr = symbol_table.hash_bucket_ptr (bucket_index)
		repeat symbol_bead_ptr -> symbol_bead.hash_link_pointer while (symbol_bead_ptr ^= null);

		flag = " ";
		meaning_ptr = symbol_bead_ptr -> symbol_bead.meaning_pointer;

		if meaning_ptr ^= null
		then do;
			meaning_reference_count = meaning_ptr -> general_bead.reference_count;

			if meaning_reference_count < 1
			then flag = "*";
		     end;
		else meaning_reference_count = 0;

		if ^brief | flag = "*"
		then call ioa_ ("^2d.^d ^10p ^2d ^4o  ^[^10p  ^3d^;^2s^15x^]^1a ^a", bucket_index, index_within_bucket,
			symbol_bead_ptr, symbol_bead_ptr -> symbol_bead.reference_count,
			fixed (symbol_bead_ptr -> symbol_bead.size, 18), (meaning_ptr ^= null), meaning_ptr,
			meaning_reference_count, flag, symbol_bead_ptr -> symbol_bead.name);

		index_within_bucket = index_within_bucket + 1;
	     end;
	end;
	return;

/* include files */

%include apl_number_data;
%include apl_bead_format;
%include apl_ws_info;
%include apl_symbol_bead;
%include apl_symbol_table;
     end /* apl_display_symtab */;
