/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1984 *
        *                                                         *
        *********************************************************** */

/* procedure used to replace ssu_$get_subsystem_and_request_name */
/* format: style2,idind30 */

/* Created 1984-12, BIM */


/****^  HISTORY COMMENTS:
  1) change(87-02-07,GDixon), approve(87-05-25,MCR7680),
     audit(87-05-06,Parisek), install(87-08-04,MR12.1-1055):
     Modified to correct coding standard violations.
                                                   END HISTORY COMMENTS */


sc_get_error_name_:
     procedure (SCI_ptr) returns (char (72) varying);

	declare SCI_ptr		        pointer;

	dcl     (addr, rtrim)	        builtin;

	call ssu_check_sci (SCI_ptr);
	sci_ptr = SCI_ptr;
	if ^sci.executing_request
	then return ("system_control");
	else return (rtrim (sci.request_data_ptr -> request_data.full_name));

%include "_ssu_sci";

%include "_ssu_check_sci";

%include "_ssu_request_data";

     end sc_get_error_name_;
