/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1984 *
        *                                                         *
        *********************************************************** */

/* sc_shutdown_: procedure to shut down AS, SC; called from system_control_ */

/* format: style2,idind30 */

/**** This is a separate procedure so that the admin environment 
      can be completely unwound before it is called. */

/**** Written 1984-11-01 BIM */


/****^  HISTORY COMMENTS:
  1) change(86-08-01,Swenson), approve(87-05-25,MCR7680),
     audit(87-02-07,GDixon), install(87-08-04,MR12.1-1055):
     Avoid calling hphcs_$shutdown when running in system control test mode.
  2) change(87-02-07,GDixon), approve(87-05-25,MCR7680),
     audit(87-05-06,Parisek), install(87-08-04,MR12.1-1055):
     Repair comments, clarify code.
  3) change(87-02-07,GDixon), approve(87-05-25,MCR7678),
     audit(87-05-06,Parisek), install(87-08-04,MR12.1-1055):
     Use timer_manager_constants include file.
                                                   END HISTORY COMMENTS */


sc_shutdown_:
     procedure;

	declare as_$shutdown	        entry;
	declare hphcs_$shutdown	        entry;
	declare timer_manager_$sleep	        entry (fixed binary (71), bit (2));

	if sc_stat_$Multics
	then do;
		sc_stat_$shutdown_typed = "1"b;	/* publish our intention */
		call as_$shutdown;			/* turn off answering service. */
		call timer_manager_$sleep (2, RELATIVE_SECONDS);
						/* Let messages get typed */
	     end;
	if ^sc_stat_$test_mode
	then call hphcs_$shutdown;			/* Shut down file system and traffic control. */
	return;

 %include sc_stat_;
 %include timer_manager_constants;

     end sc_shutdown_;
