/* ***********************************************************
   *                                                         *
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1981 *
   *                                                         *
   *                                                         *
   *********************************************************** */

mrds_dsm_write_header: proc (iocb_ptr, db_path, code);

/*
   This routine writes the submodel header record. The record has  a
   key  of  32  nulls  which  should make it the first record in the
   vfile_. A temporary  header  record  with  the  submodel  version
   information must already exist.

   Known Bugs:

   Other Problems:

   HISTORY

   81-02-23 Davids: written

   81-06-01   Davids:   Changed   mrds_dsm_header_str.incl.pl1    to
   .        mrds_dsm_header.incl.pl1
   */

/* PARAMETERS */

	dcl     iocb_ptr		 ptr;		/* (input) pointer to the submodels iocb */
	dcl     db_path		 char (*);	/* (input) db_path submodel is defined for */
	dcl     code		 fixed bin (35);	/* (output) error code */

/* AUTOMATIC */

	dcl     01 header_str	 like mrds_dsm_header; /* automatic version of the header record */
	dcl     key		 char (256) var;	/* header record key */
	dcl     record_length	 fixed bin (21);	/* length of the header record */

/* BASED */

%include mrds_dsm_header;


/* BUILTIN */

	dcl     addr		 builtin;
	dcl     low		 builtin;

/* ENTRIES */

	dcl     clock_		 entry () returns (fixed bin (71));
	dcl     get_group_id_	 entry () returns (char (32));
	dcl     iox_$seek_key	 entry (ptr, char (256) varying, fixed bin (21), fixed bin (35));
	dcl     iox_$rewrite_record	 entry (ptr, ptr, fixed bin (21), fixed bin (35));
	dcl     mrds_dsm_get_relation_names$number_of_rels entry (ptr, fixed bin (35)) returns (fixed bin);

/* EXTERNAL */

	dcl     mrds_data_$dsmd_version_number fixed bin (35) external static;

	header_str.dsm_generator_version = mrds_data_$dsmd_version_number;
	header_str.date_time_generated = clock_ ();
	header_str.database_pn = db_path;
	header_str.creator_id = get_group_id_ ();
	header_str.name = "data_submodel_header";
	header_str.num_of_relations = mrds_dsm_get_relation_names$number_of_rels (iocb_ptr, code);


	if code = 0
	then do;
		key = low (32);
		call iox_$seek_key (iocb_ptr, key, record_length, code);
		if code = 0
		then do;
			call iox_$rewrite_record (iocb_ptr, addr (header_str), record_length, code);
		     end;
	     end;

	return;

     end /* mrds_dsm_write_header */;

