/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

bjm_get_default_bj:
     proc (p_bj_oid, p_code);

/*  DESCRIPTION:
     Procedure to return the opening ID of the current default BJ using the
   protocol for write_begin_mark:  user_set_oid if user has called
   bjm_set_default_bj and has not closed it since setting it, or the last
   opened BJ if no explicit setting.  If both these fail, the system default
   BJ will be opened.  p_bj_oid and p_code are output parameters.
*/

/*  HISTORY:
Written by Mike Pandolf, 08/19/82.
Modified:
10/04/82 by Lee A. Newcomb to change from one default BJ setting to
	  the two cell definition of bjm_write_begin_mark.
03/24/83 by L. A. Newcomb to use default bj dir and name defined
	  in dm_system_data_ by dm_load_configuration_.
03/28/83 by M. Pandolf:  to use changed dm_system_data_ names for default bj.
12/06/83 by L. A. Newcomb:  Renamed before_journal_manager_static_ to
            bjm_data_ and moved some cells from dm_data_ to bjm_data_.
*/
%page;
/* initialize parameters */

	p_code = 0;
	bj_ppt_ptr = bjm_data_$bj_ppt_ptr;		/* get it once */

/* if the current default journal is nominally null, then we must open a  before journal */

	if bj_ppt.default_bj.user_set_oid ^= ""b then	/* user has explicitly set the default */
	     bj_oid = bj_ppt.default_bj.user_set_oid;
	else if bj_ppt.default_bj.last_opened_oid ^= ""b then /* OK, then use the last opened one */
	     bj_oid = bj_ppt.default_bj.last_opened_oid;

	else do;					/* must use system default BJ */
	     call before_journal_manager_$open_bj (dm_system_data_$bj_default_dirname,
		dm_system_data_$bj_default_filename, bj_oid, p_code);
	     if p_code ^= 0 then
		go to exit;
	end;

/* now get the calculated default before journal opening ID */

	p_bj_oid = bj_oid;

exit:						/* get back */
	return;
%page;
/* DECLARATIONS */

dcl  (						/* Parameters */
     p_bj_oid		        bit (36) aligned,	/* before journal opening ID */
     p_code		        fixed bin (35)	/* status code */
     )			        parameter;

dcl						/* Automatic */
     bj_oid		        bit (36) aligned	/* for call to open_bj */
			        automatic;

dcl  (						/* Static, External */
     bjm_data_$bj_ppt_ptr	        ptr,
     dm_system_data_$bj_default_dirname char (168),
     dm_system_data_$bj_default_filename char (32)
     )			        external static;

dcl						/* Entries */
     dm_per_system_$find_bootload_dir entry (char (*), fixed bin (35)),
     before_journal_manager_$open_bj  entry (char (*), char (*), bit (36) aligned, fixed bin (35));

/* INCLUDE FILES start next page */
%include dm_bj_ppt;


     end bjm_get_default_bj;
