/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

casin_: proc (number) returns (complex float bin (27));

dcl (number, a, b, c) complex float bin (27);
dcl	(imag, log, real, sqrt) builtin;

	real (a) = -imag (number) + 0.0e0;
	imag (a) = real (number) + 0.0e0;

	b = 1.0e0;

trig:	
	c = -1.0e0i;

ret:	
	return (log (sqrt (a*a+b)+a)*c);

cacos_: entry (number) returns (complex float bin (27));

	a = number +0.0e0;
	b = -1.0e0;

	goto trig;

casinh_: entry (number) returns (complex float bin (27));

	b = 1.0e0;

hyper:	
	a = number +0.0e0;
	c = 1.0e0;

	goto ret;

cacosh_: entry (number) returns (complex float bin (27));

	b = -1.0e0;

	goto hyper;

     end casin_;
