/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

cexp_: proc (number) returns (complex float bin (27));

dcl (number, a, r) complex float bin (27);
dcl	(abs, cos, exp, imag, real, sin) builtin;
dcl  code_ ext entry (fixed bin (17));

	a = number + 0.0e0;

	if real (a)>88.028e0
	     then do;
	     call code_ (26);

	     real (a) = 170141182.0e30;
	end;
	else real (a) = exp (real (a));

	if abs (imag (a)) >= 134217728.0e0
	     then do;
	     call code_ (27);

	     return (0.0e0);
	end;

	imag (r) = sin (imag (a))*real (a);
	real (r) = cos (imag (a))*real (a);

	return (r);

     end cexp_;
