/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

cfdp_: proc (a, b) returns (complex float bin (27));

dcl	(a, b) complex float bin(27);

	return (a / b);

     end cfdp_;
