/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

cxp1_: proc (base, exponent) returns (complex float bin (27));

dcl base complex float bin (27),
     f complex float bin (63),
     exponent fixed bin (17);


	f = base;
	return (f ** exponent);

     end cxp1_;
