/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* calls to round_ removed on 07/16/73 by A. Downing */
dexp_: procedure (number) returns (float binary (63));

/*     compute the exponential of a double-precision floating-point number    */
declare (number) float binary (63),
	exp builtin;

	return(exp(number));
	end;
