/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* calls to round_ remove by A. Downing 07/16/73 */

exp_: procedure (number) returns (float binary (27));

/*    compute the exponential of a single-precision floating-point number    */
declare number float binary (27),
	exp builtin;

	return(exp(number));
	end;
