/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

iexp_: procedure (base, exponent) returns (fixed binary (35));

/*     compute integer base ** integer exponent     */
declare (base, exponent) fixed binary (35);

	return(base**exponent);
	end;
