/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

tan_: procedure (number) returns (float binary (27));

/*    compute the tangent of a single-precision floating-point number    */
declare number float binary (27),
	(tan, tand) builtin;

	return(tan(number));

tand_:	entry(number) returns(float bin(27));
	return(tand(number));
	end;
