/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        *********************************************************** */

/* format: style2 */

/* Routine for bce that runs (maps) a specified procedure over each entry of
   a bce ssu_-style request table.  Written in the past by Benson Margulies. */

bce_map_over_requests_:
     procedure (Procedure, Info_ptr, Request_table_ptr);

	declare Procedure		 entry (pointer, pointer) variable parameter;
	declare Info_ptr		 pointer;
	declare Request_table_ptr	 pointer;

	declare rq_idx		 fixed bin;

	declare addr		 builtin;

	rqt_ptr = Request_table_ptr;
	do rq_idx = 1 to rqt.n_requests;
	     rq_data_ptr = addr (rqt.requests (rq_idx));
	     call Procedure (rq_data_ptr, Info_ptr);
	end;
	return;

%include "_ssu_request_table";
%include "_ssu_request_data";
     end bce_map_over_requests_;
