/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

create_array: proc returns(ptr) ;

/*	Modified on:	April 1977 by RHS for new allocation methods */

dcl	1 pl1_nodes_template_$array_template external like array aligned;

dcl	p ptr;
dcl	null builtin;
dcl	pl1_stat_$node_uses(32) fixed bin ext;

%include pl1_tree_areas;
%include nodes;
%include array;


			/*      */

	pl1_stat_$node_uses(8) = pl1_stat_$node_uses(8) + 1;

	allocate array in(tree_area) set(p);

	p->array = pl1_nodes_template_$array_template;

	return(p);

	end create_array;
