/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/* This procedure merely allocates a block of N words */

create_storage: proc(n) returns(ptr) ;

/*	Modified on:	April 1977 by RHS for new allocation methods */

dcl	n fixed bin,
	p ptr;

dcl	pl1_stat_$node_uses(32) fixed bin ext;

dcl	storage(n) fixed based(p);

%include pl1_tree_areas;

	pl1_stat_$node_uses(14) = pl1_stat_$node_uses(14) + n;

	allocate storage in(tree_area) set(p);
	return(p);

	end;
