/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) BULL HN Information Systems Inc., 1989   *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */



/****^  HISTORY COMMENTS:
  1) change(89-07-10,RWaters), approve(89-07-10,MCR8118), audit(89-07-19,Vu),
     install(89-07-31,MR12.3-1066):
     Removed the obsolete parameter source_line from the call to error_().
                                                   END HISTORY COMMENTS */


/* format: style3,^indattr,ifthendo,ifthen,^indnoniterdo,indproc,^elsestmt,dclind9,idind23 */
error:
     proc (err_no, statement_pt, token_pt);

dcl      err_no fixed bin (15) parameter;
dcl      (statement_pt, token_pt) ptr parameter;

dcl      n fixed bin;
dcl      p pointer;

dcl      (null, string) builtin;

dcl      pl1_stat_$err_stm ptr ext;
%page;
%include language_utility;
%page;
%include source_id;
%page;
%include statement;
%page;
%include source_list;
%page;
/* program */
	pl1_stat_$err_stm, p = statement_pt;
	if p = null then do;
	     string (source_id) = "0"b;
	     call error_$no_text (err_no, source_id, token_pt);
	end;
	else
	     call error_ (err_no, p -> statement.source_id, token_pt, (p -> statement.source.segment),
		(p -> statement.source.start), (p -> statement.source.length));

	return;
%page;
/*
 *
 */
error$omit_text:
     entry (err_no, statement_pt, token_pt);

	pl1_stat_$err_stm, p = statement_pt;
	if p = null then do;
	     string (source_id) = "0"b;
	     call error_$no_text (err_no, source_id, token_pt);
	end;
	else
	     call error_$no_text (err_no, p -> statement.source_id, token_pt);
	return;
     end error;
