/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1984 *
   *                                                         *
   *********************************************************** */
expand_mos_msg_:
     procedure ();

/* *      EXPAND_MOS_MSG_
   *
   *      Expander for MOS EDAC messages logged by mos_memory_check.
   *
   *      84-12-05, W. Olin Sibert: Initial coding, after print_syserr_msg_
   */

declare   P_log_message_format_ptr pointer parameter;
declare   P_log_message_ptr pointer parameter;
declare   P_expand_mode_ptr pointer parameter;
declare   P_expansion char (*) varying parameter;
declare   P_code fixed bin (35) parameter;

declare   edit_mos_rscr_ entry (pointer, char (*) varying);

declare  (addr, dimension, length, rtrim, size, string, unspec) builtin;

/*  */

expand_mos_msg_$format:
     entry (P_log_message_format_ptr, P_log_message_ptr, P_expand_mode_ptr, P_expansion, P_code);

          log_message_ptr = P_log_message_ptr;

          call edit_mos_rscr_ (addr (log_message.data (1)), P_expansion);

          return;



/* This is a compatibility entrypoint-- it processes an old-format "syserr" class
   message, which has the syserr binary code in the first word of the data. */

expand_mos_msg_$syserr:
     entry (P_log_message_format_ptr, P_log_message_ptr, P_expand_mode_ptr, P_expansion, P_code);

          log_message_ptr = P_log_message_ptr;

          call edit_mos_rscr_ (addr (log_message.data (2)), P_expansion);

          return;

%page; %include log_message;

          end expand_mos_msg_;
