/* BEGIN INCLUDE FILE ... _abbrev_profile.incl.pl1 */
/* Created:  18 February 1982 by G. Palter */


/* Format of the profile maintained by the abbrev command */

dcl  1 abbrev_profile aligned based (ap_ptr),
       2 version fixed binary,
       2 next_free fixed binary (18),			/* offset of next free word (RTBOS) */
       2 garbage fixed binary (18),			/* # of words of unreferenced space: controls compaction */
       2 pad1 bit (36),
       2 old_cis_time fixed binary (71),		/* check_info_segs kept its time here: now uses value_ */
       2 pad2 (26) bit (36),
       2 hash_table (0 : 127) fixed binary (18),		/* offset first abbrev starting with given letter (RTBOS) */
       2 data_space (0 : 0) bit (36) aligned;		/* contains abbreviations */

dcl  ap_ptr pointer;

dcl  ABBREV_PROFILE_VERSION_1 fixed binary static options (constant) initial (1);


/* A single abbreviation */

dcl  1 ape aligned based (ape_ptr),
       2 header,
         3 flags unaligned,
	 4 bol bit (1) unaligned,			/* ON => expand only at beginning of line */
	 4 pad bit (17) unaligned,
         3 next fixed binary (18) unsigned unaligned,	/* to next abbreviation in this chain (RTBOS) */
         3 value_lth fixed binary (21),			/* # of characters int the expansion */
         3 name character (8),			/* name of the abbreviation */
       2 value character (0 refer (ape.value_lth));

dcl  ape_ptr pointer;

/* END INCLUDE FILE ... _abbrev_profile.incl.pl1 */
