/* BEGIN INCLUDE FILE ... _imft_check_acl.incl.pl1 */

/* format: style4 */

/****^  HISTORY COMMENTS:
  1) change(88-09-21,Beattie), approve(88-08-01,MCR7948),
     audit(88-10-14,Farley), install(88-10-14,MR12.2-1165):
     Created to support IMFT ACL checking.
                                                   END HISTORY COMMENTS */

dcl  1 imft_check_acl aligned based (imft_check_acl_ptr),
       2 version character (8),			/* version of this structure */
       2 flags,
         3 allow_transfer bit (1) unaligned,		/* indicates that transfer is allowed to start */
         3 objects_to_transfer bit (1) unaligned,		/* indicates that objects were found in subtree that passed all checks */
         3 check_aim bit (1) unaligned,			/* do aim checks */
         3 found_inner_ring_object bit (1) unaligned,	/* an inner ring object was detected */
         3 pad bit (32) unaligned,
       2 dirname character (168),			/* containing directory of object */
       2 ename character (32),			/* entry name of object */
       2 type character (32),				/* type of object */
       2 object_ring fixed binary (3),			/* first ring bracket of object */
       2 sys_auth_ceiling bit (72),			/* system auth ceiling */
       2 sys_auth_floor bit (72),			/* system auth floor */
       2 user_auth bit (72),				/* user's authorization */
       2 foreign_sys_name character (32),		/* for error message */
       2 gen_acl_ptr pointer,				/* ptr to general ACL array */
       2 dir_access bit (3),				/* desired ACL for directories */
       2 seg_access bit (3),				/* desired ACL for segments */
       2 effective_ring,				/* minimum ring for object to allow transfer */
       2 bad_acl_idx fixed bin,			/* index in ACL array which failed ACL checks */
       2 error_code fixed bin (35),			/* standard error code */
       2 error_message (2) character (512) varying,	/* contains an error message */
       2 accessfile_pathname character (168);		/* collect access error mesages here if subtree checking */

dcl  imft_check_acl_ptr pointer;

dcl  DRIVER_ACL_IDX fixed binary int static options (constant) initial (1);
dcl  USER_ACL_IDX fixed binary int static options (constant) initial (2);

dcl  IMFT_CHECK_ACL_VERSION_1 character (8) init ("IMFTCA01") internal static options (constant);

/* END INCLUDE FILE ... _imft_check_acl.incl.pl1 */
