/* BEGIN INCLUDE FILE --- acc.incl.pl1 

James R. Davis 21 Nov 78
*/

dcl 1 acc based aligned,
    2 num_chars fixed bin (9) unsigned unaligned,
    2 string char (0 refer (acc.num_chars)) unaligned;

/* END INCLUDE FILE --- acc.incl.pl1 */
