/* ====== BEGIN INCLUDE SEGMENT	apl_lexed_function_bead.incl.pl1 ========================== */

/* this is the format of a user-defined function after it has been run
   through apl_lex_, the first (left to right) parsing phase. */

dcl 1 lexed_function_bead based aligned,
    2 header like general_bead,			/* type bits, etc. */

    2 name pointer unaligned,				/* -> symbol bead which names the function */
    2 bits_for_parse unaligned like operator_bead.bits_for_parse,	/* so can treat like system function */
    2 number_of_statements fixed bin,
    2 number_of_localized_symbols fixed bin,		/* including labels and parameter variables, return var */
						/* even if they aren't there, thus >_ 3 */
    2 number_of_labels fixed bin,
    2 label_values_ptr pointer unaligned,			/* -> label_values below */
    2 statement_map_ptr pointer unaligned,			/* -> statement_map below */
    2 lexeme_array_ptr pointer unaligned,			/* -> lexeme_array below */

	/* the first 3 localized symbols are always reserved for ReturnSymbol, LeftArgSymbol, RighArgSymbol respectively.
	   If some of these symbols are not present (e.g. monadic or value-less function), null pointers are used.
	   So beware!, there can be null ptrs in the localized_symbols array. */

    2 localized_symbols(  (0) refer (lexed_function_bead.number_of_localized_symbols)) pointer unaligned,
						/* first localized vars from header line, then labels */
    2 label_values ( (0) refer (lexed_function_bead.number_of_labels)) pointer unaligned,
						/* ptrs to label-value beads for labels */
    2 statement_map ( (0) refer (lexed_function_bead.number_of_statements)) fixed bin(18),
						/* index in lexeme_array of rightmost lexeme of each stmt */
    2 lexeme_array ( (0) refer (lexed_function_bead.number_of_labels)	/* not really, but fake out compiler */ ) pointer unaligned;
			/* the actual lexemes.  Length of array is
							statement_map(number_of_statements)   */


/* manifest constants for first 3 localized symbols */

dcl (ReturnSymbol	init(1),
     LeftArgSymbol	init(2),
     RightArgSymbol	init(3)
    ) fixed binary static;


	/* the last three parts of this bead are referenced separately, though ptrs earlier in the bead.
	   Here are declarations for them as level-1 structures */

dcl 1 lexed_function_label_values_structure based aligned,
     2 lexed_function_label_values ( 500 /* or so */ ) pointer unaligned,

    statement_count fixed bin,
    lexed_function_statement_map (statement_count) fixed bin(18) aligned based,

    1 lexed_function_lexemes_structure based aligned,
     2 lexed_function_lexeme_array ( 500 /* or so */ ) pointer unaligned;

/* ------ END INCLUDE SEGMENT		apl_lexed_function_bead.incl.pl1 -------------------------- */
