/* Begin include file asr_daemon_command.incl.pl1 BIM 1985-02-18 */
/* format: style4 */
/* AS request structure for daemon commands. */

dcl  asr_daemon_command_info_ptr pointer;
dcl  1 asr_daemon_command_info aligned based (asr_daemon_command_info_ptr),
       2 header aligned like as_request_header,
       2 version char (8),
       2 action_code fixed bin,
       2 user_name char (32) unaligned,
       2 project_name char (32) unaligned,
       2 source_name char (32) unaligned,
       2 pad (10) bit (36) aligned, /* avoid adding after refer */
       2 command_length fixed bin (21),
       2 command char (asr_dc_length refer (asr_daemon_command_info.command_length)) unaligned; /* login control args here on login */

dcl  asr_dc_length fixed bin (21);
dcl  ASR_DC_INFO_VERSION_1 char (8) init ("asrdc001") int static options (constant);

dcl  (ASR_DC_LOGIN  init (1),
      ASR_DC_LOGOUT init (2),
      ASR_DC_QUIT init (3),
      ASR_DC_REPLY init (4)) fixed bin int static options (constant);

declare asr_reply_dc_ptr pointer;
dcl  1 asr_reply_daemon_command aligned based (asr_reply_dc_ptr),
       2 code fixed bin (35),
       2 flags aligned,
         3 command_refused bit (1) unaligned,   /* validate_daemon_commands OFF and no access to sac */
         3 no_such_daemon bit (1) unaligned,    /* nobody home */
         3 no_access_to_daemon bit (1) unaligned, /* validate_daemon_commands ON and no access to the specific victim */
         3 pad bit (33) unaligned;

/* END INCLUDE FILE ... asr_daemon_command.incl.pl1 */
