/* BEGIN INCLUDE FILE attribute_names.incl.pl1 */

/* Written October 1979 by T. Casey to centralize several separate lists of the attribute names. */

/* NOTE: these names must be in the same order as the corresponding bits in the attributes word,
   as defined in attributes.incl.pl1 */

dcl  attribute_names (0:24) char (20) int static options (constant) init
    ("none",					/* 0 */
     "administrator",				/* 1 */
     "primary_line",				/* 2 */
     "nobump",					/* 3 */
     "guaranteed_login",				/* 4 */
     "anonymous",					/* 5 */
     "nopreempt",					/* 6 */
     "nolist",					/* 7 */
     "dialok",					/* 8 */
     "multip",					/* 9 */
     "bumping",					/* 10 */
     "brief",					/* 11 */
     "vinitproc",					/* 12 */
     "vhomedir",					/* 13 */
     "nostartup",					/* 14 */
     "no_secondary",				/* 15 */
     "no_prime",					/* 16 */
     "no_eo",					/* 17 */
     "daemon",					/* 18 */
     "",						/* 19 vdim OBSOLETE */
     "no_warning",					/* 20 */
     "igroup",					/* 21 */
     "save_pdir",					/* 22 */
     "disconnect_ok",				/* 23 */
     "save_on_disconnect");				/* 24 */

dcl  alt_attribute_names (0:24) char (20) int static options (constant) init
    ("null",					/* 0 */
     "admin",					/* 1 */
     "", "",					/* 2 - 3 */
     "guar",					/* 4 */
     "anon",					/* 5 */
     "", "",					/* 6 - 7 */
     "dial",					/* 8 */
     "multi_login",					/* 9 */
     "preempting",					/* 10 */
     "",						/* 11 */
     "v_process_overseer",				/* 12 */
     "v_home_dir",					/* 13 */
     "no_start_up",					/* 14 */
     "no_sec",					/* 15 */
     "no_primary",					/* 16 */
     "no_edit_only",				/* 17 */
     "op_login",					/* 18 */
     "",						/* 19 */
     "nowarn",					/* 20 */
     "", "", "",					/* 21 - 23 */
     "save");					/* 24 */

/* END INCLUDE FILE attribute_names.incl.pl1 */
