/* BEGIN INCLUDE FILE ... backup_pvol_info.incl.pl1 */

dcl  bpvip ptr;

dcl 1 backup_pvol_info based (bpvip) aligned,
    2 label like label aligned,
    2 n_vtoce fixed bin,
    2 n_free_vtoce fixed bin,
    2 n_rec fixed bin,
    2 baseadd fixed bin,
    2 n_free_rec fixed bin;

/* END INCLUDE FILE ... backup_pvol_info.incl.pl1 */
