/* include backup_fs_times */
/* Created by R H Campbell. */
/* Modified 15 June 1970, R H Campbell. */
dcl 1 times, 					/* Structure of times for set$backup_times. */
    2 (dtem, 					/* Time entry last modified. */
     dtd, 					/* Time entry last dumped. */
     dtu, 					/* Time segment last used. */
     dtm) fixed binary (52); 				/* Time segment last modified. */
						/* end backup_fs_times */
