/* BEGIN INCLUDE FILE ... backup_static_variables.incl.pl1 ... March 1976 */


dcl  incr fixed bin init (1) internal static options (constant); /* incremental dump mode */
dcl  cons fixed bin init (2) internal static options (constant); /* consolidated dump mode */
dcl  comp fixed bin init (3) internal static options (constant); /* complete dump mode */
dcl  backup_version_1 fixed bin init (1) static internal options (constant); /* backup_version_1 of input/output structures */



/* END INCLUDE FILE ... backup_static_variables.incl.pl1 */
