dcl	bases(0:7) bit(3) aligned int static init("000"b, "010"b, "100"b,  "001"b, "011"b, "101"b, "111"b,"110"b)
	options(constant);

dcl (	ap	defined(bases(0)),
	bp	defined(bases(1)),
	lp	defined(bases(2)),
	sp	defined(bases(7))) bit(3) aligned;

dcl (	ab	defined(bases(3)),
	bb	defined(bases(4)),
	lb	defined(bases(5)),
	sb	defined(bases(6))) bit(3) aligned;

dcl	which_base(0:7) fixed bin int static init(0,3,1,4,2,5,7,6) options(constant);
