/* BEGIN INCLUDE FILE ... baud_rates.incl.pl1 */

/* Defines valid baud rate values for communications channels */

/* Created by somebody a long time ago */
/* Modified April 1982 by Robert Coren to add speeds above 9600 (up to 72000) */

dcl  baud_table (15) fixed bin int static options (constant) init
     (110, 133, 150, 300, 600, 1200, 1800, 2400, 4800, 7200,
      9600, 19200, 40800, 50000, 72000);

/* END INCLUDE FILE ... baud_rates.incl.pl1 */
