/* BEGIN INCLUDE FILE ... begin_block_entries */

dcl begin_block_entries (2) bit (36) aligned static internal options (constant) init
("000614272100"b3,			 /* tsp2 pr0|614 enter_begin_block */
 "001376272100"b3			 /* tsp2 pr0|1376 ss_enter_begin_block */);

/* END INCLUDE FILE ... begin_block_entries */
