dcl (	root_block		initial("000000001"b),
	external_procedure		initial("000000010"b),
	internal_procedure		initial("000000011"b),
	begin_block		initial("000000100"b),
	on_unit			initial("000000101"b))  internal static bit(9) aligned options(constant);
