/* BEGIN INCLUDE FILE ... boundary.incl.pl1 */

/* Modified: 26 Apr 1979 by PCK to implement 4-bit decimal */

dcl (	bit_		init(1),
	digit_		init(2),
	character_	init(3),
	half_		init(4),
	word_		init(5),
	mod2_		init(6),
	mod4_		init(7)) fixed bin(3) int static options(constant);

/* END INCLUDE FILE ... boundary.incl.pl1 */
