
/* Begin include file ...... card_sdb.incl.pl1 */

dcl  sdb_ptr ptr;					/* pointer to stream data block */

dcl 1 SDB aligned based (sdb_ptr),
    2 outer_module_name char (32),
    2 attachment_list_ptr ptr,			/* ptr to list of stream names to which this SDB is attached */
    2 stream_name,
      3 next_stream_ptr ptr,				/* always null, single attachments only */
      3 name_size fixed bin (17),			/* length of stream name */
      3 stream char (32),				/* the stream to which this SDB is attached */
    2 areaptr ptr,					/* pointer to allocation area for SDB */
    2 modes bit (36);				/* mode bits */

/* End of include file ...... card_sdb.incl.pl1 */

