
/* BEGIN INCLUDE FILE ... cobol_type17.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A mnemonic name token is created for each user-defined mnemonic name
specified in the special-names paragraph.
*/

/* dcl name_ptr ptr;  */

/* BEGIN DECLARATION OF TYPE17 (MNEMONIC NAME) TOKEN */
dcl	1 mnemonic_name based (name_ptr),
%include cobol_TYPE17;
/* END DECLARATION OF TYPE17 (MNEMONIC NAME) TOKEN */

/* END INCLUDE FILE ... cobol_type17.incl.pl1 */

