
/* BEGIN INCLUDE FILE ...   cobol_com2.incl.pl1 */
/**********NEW COM2 INCLUDE FILE*************************************************/
dcl 1 odo_rec based(com2_ptr),
     2 next char(5),
     2 descr char(5),
    2 seg_no fixed bin(15),
    2 offset_l fixed bin(31),
    2 offset_r fixed bin(31),
     2 info bit(8);
dcl 1 occ_key based(com2_ptr),
	2 next char(5),
	2 first_key char(5),
	2 rec_no char(5),
	2 ntble fixed bin(15),
	2 lineno fixed bin(15),
	2 info bit(8);
dcl 1 skey_rec based(com2_ptr),
     2 next char(5),
     2 qual char(5),
     2 key_number fixed bin(15),
   2 asc_dsc fixed bin(15),
     2 ref_line fixed bin(15),
   2 ref_column fixed bin(15),
     2 info bit(8),
     2 size fixed bin(7),
     2 name char(30);
dcl 1 rename_rec based(com2_ptr),
   2 repl_ptr ptr,
     2 next char(5),
     2 obj1 char(5),
     2 obj2 char(5),
     2 lineno_01 fixed bin(15),
     2 lineno_66 fixed bin(15),
     2 rec_no_66 char(5),
     2 info bit(8),
     2 size fixed bin(7),
     2 name char(30);
dcl 1 qual_rec based (com2_ptr),
      2 next char(5),
     2 line fixed bin(15),
     2 column fixed bin(15),
      2 size fixed bin (7),
      2 name char (30);
dcl 1 report_rec based(com2_ptr),
     2 next char(5),
     2 line fixed bin(15),
     2 column fixed bin(15),
     2 fileno fixed bin(7),
     2 defined bit(1),
     2 size fixed bin(7),
     2 name char(30);

dcl 1 occurs based(com2_ptr),
    2 keyed fixed bin(15),
    2 key_number fixed bin(15),
    2 dimensions fixed bin(15),
    2 level (occurs.dimensions),
	3 indexedno fixed bin(15),
	3 min fixed bin(15),
	3 max fixed bin(15),
	3 struclength fixed bin(15),
	3 cswdx fixed bin(15),
	3 csws fixed bin(31);
dcl 1 obj_rec based(com2_ptr),
     2 qual char(5),
     2 line fixed bin(15),
     2 column fixed bin(15),
     2 repl fixed bin(15),
     2 size fixed bin(7),
     2 name char(30);
dcl 1  linage_name_rec based(com2_ptr),     /* 1st record is pointed by linage_info */
     2 next char(5),
     2 line fixed bin(15),
     2 column fixed bin(15),
     2 fileno fixed bin(7),
     2 desc fixed bin(7),     /* body=1, footing=2, top=3, bottom=4 */
     2 unused fixed bin(15),
     2 size fixed bin(7),
     2 name char(30);

/* END INCLUDE FILE ...   cobol_com2.incl.pl1 */

