
/* BEGIN INCLUDE FILE ...   cobol_file_info.incl.pl1 */
/* Last modified Oct 17, 1974 by ORN */

dcl file_info_ptr ptr;
dcl 1 file_info based(file_info_ptr),
     2 n fixed bin,
     2 pt (1000) ptr;

/* END INCLUDE FILE ...   cobol_file_info.incl.pl1 */

