
/* BEGIN INCLUDE FILE ...   cobol_ciphase_data.incl.pl1 */
/*	<<<	DRASTICALLY REVISED ON 12/27/76 by fch	>>>	*/
/* Modified on 05/06/81 by FCH, BUG482(TR9781) */

dcl new_seg_bit  bit(1) ;  /*new segment allocated */



      dcl nu_line fixed bin ;  /*  introduce  for line  numerotation  */
dcl fst bit(32) ;
dcl infp ptr ;
dcl outfp ptr ;    /*newioversr*/
dcl on bit(1) internal static init("1"b);
dcl off bit(1) internal static init("0"b);
dcl ose_exists bit(1) ;
dcl  (   ptr1 ptr,
    input_ptr ptr,output_ptr ptr ) ;
dcl next_free_column fixed bin ;
dcl eof bit(1) ;

dcl curr_tbl_ptr ptr ;
dcl curr_table(  200000    ) char(1) based(curr_tbl_ptr);  /*[4.4-1]*/
dcl  curr_tbl_index fixed bin ;
dcl  tbl_item_ptr ptr ;
dcl (tbl_item_ptr1,tbl_item_ptr2) ptr ;

dcl dir_ptr ptr;
dcl 1 dir_struct  based (dir_ptr),
      2 dir1 (512) ,
	3 tbl fixed bin,
	3 dir fixed bin ,
      2 dir2 (512) ,
	3 tbl fixed bin,
	3 dir fixed bin ,
       2 table1 (200000) char(1),       /*[4.4-1]*/
       2 table2 (200000) char(1);      /*[4.4-1*/
dcl curr_dir_ptr ptr ;
dcl 1 curr_dir(512) based(curr_dir_ptr),
	2 tbl fixed bin,
	2 dir fixed bin ;
dcl curr_dir_index fixed bin ;
dcl end_dir1_index fixed bin ;
		declare	(loc1 , loc2)	fixed bin;
dcl (dir_ptr1,dir_ptr2) ptr ;

dcl 1 stack(50) ,
      2 stk_to_dir fixed bin,
      2 level fixed bin;
dcl curr_stk_index fixed bin ;

dcl gen_ptr (30) ptr ;

dcl 1 lc_stack(300) , /*[4.4-1]*/
	2 dcl_line char(4),
	2 dcl_col char(3) ;

dcl ( i,
    end_i ,
    recv_i ,
    begin_i ,
    ose_gen_begin_i ) fixed bin ;




dcl 1 key_tbl(10) internal static,
	2 key fixed bin	init(2,18,170,187,188,182,183,156,11,111),
	2 word char(9) init("add      ","move     ","to       ","(        ",")        ","+        ",
"-        ","rounded  ","subtract ","from     "),
	2 word_length fixed bin init(4,5,3,2,2,2,2,8,9,5);
         /*  suppress  3  lines
dcl key_index fixed bin ;
dcl max_key_index fixed bin internal static init(10);
dcl this_key fixed bin ;
                                     */
dcl blank_name char(32) internal static init((32)" ");
dcl (name1,name2) char(32) ;

dcl curr_level fixed bin ;
dcl move_swt bit(1) ;
dcl add_swt bit(1) ;
dcl subtract_swt bit(1) ;

dcl sending_op bit(1) ;
dcl no_of_subscr fixed bin ;
dcl subscr_cnt fixed bin ;
dcl dataname_subscr_sw bit(1) ;
dcl indexname_subscr_sw bit(1) ;
dcl orig_dimen fixed bin ;
dcl cvbd_1 char(4) ;
dcl cvindex fixed bin ;
dcl cv_string char(10) ;
dcl fixbin15 fixed bin ;
dcl fixbin24 fixed bin(24) ;

dcl null_match bit(1) ;
dcl record char(4095) based;
dcl record2 char(4095) based;
dcl any_item (300) char(1) based(input_ptr);
	/*used to set ptr1 to array extension*/

dcl  1  token_stack_tbl ,
    2 token_stack (20000)  char(1);      /*[4.4-1]*/
dcl top_token_stack fixed bin ;
dcl token_stack_ptr ptr ;
dcl n fixed bin ;
dcl first_pair bit(1) ;
dcl (ptr2,ptr3,ptr4) ptr ;
dcl main_item_subscripted bit(1) ;
dcl subscr_dir_index fixed bin ;
dcl 1 subscr_directory(300) , /*[4.4-1]*/
	2 sufx_ptr ptr,
	2 tokn_ptr ptr,
	2 index_ct fixed bin ;
dcl defaults bit(1) ;
dcl category fixed bin ;
dcl send_op_ptr ptr ;
dcl initlz_tbl_ptr ptr ;
dcl initlz_item_tbl (  200000 ) char(1) based(initlz_tbl_ptr); /*[4.4-1]*/
dcl table1_2_size fixed bin ;
		/* give max. size to stack items on table initlz_item_tbl */
dcl end_initlz_tbl_index fixed bin ;
dcl main_item_index fixed bin ;
dcl main_item_ptr ptr ;
dcl curr_dim fixed bin ;
dcl initlz_swt bit(1) ;
dcl initlz_items_allocated bit(1) ;
 dcl save_the_key bit(1) ; 
     dcl nt_key char(5);     
     dcl save_key char(5);     
dcl gen_item_allocated bit(1) ;
dcl alloc_seg fixed bin ;
dcl alloc_offset fixed bin(24) ;



dcl code fixed bin ;
dcl nxt fixed bin internal static init(0),
    bos fixed bin internal static init(1),
    eos fixed bin internal static init(2);

dcl lk_ahd_ptr(2) ptr ;	/* used to store ON,ON SIZE if not ON SIZE ERROR */
dcl lk_ahd_index fixed bin ;

/* used to initialize label array in corr_in */

/* interface between err_pro and callers */
dcl recov bit(1) ;
dcl err_num fixed bin ;
dcl err_image char(60) ;
dcl poss_prior_err bit(1) ;
dcl err_image_length fixed bin ;

/* interface between corr and source_gen */
dcl set_new_col bit(1) ;
         /*   suppress  2  lines
dcl this_word char(32) ;
dcl this_word_length fixed bin ;
                                       */

/*interface between err_pro and corr_in*/
dcl recovering bit(1) ;

dcl without_on_bit  bit(1) ;  /*  bit  add  for  syntax  ON SIZE ERROR  without  ON  */
dcl xst fixed bin ;        /*  add for same above */

dcl recursive_bit bit(1) ;  /*  bit  added  for  recursive  syntax  on  ADD  or  SUBTRACT  */
dcl relecture bit(1) ;                  /*  add for recursive array in INITIALIZE  */

dcl array_init_bit bit(1) ;   /*  add for INITIALIZE all array  */
dcl n_array fixed bin ;
dcl second_time bit(1) ;
dcl fixbin_diff bit(1) ;

/* END INCLUDE FILE ...   cobol_ciphase_data.incl.pl1 */

