
/* BEGIN INCLUDE FILE ... cobol_type2.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A type 2 numeric literal token is entered into the minpral file by the
lexical analysis phase for each numeric literal encountered in the source
program.
*/

dcl nlit_ptr ptr;

/* BEGIN DECLARATION OF TYPE2 (NUMERIC LITERAL) TOKEN */
dcl 1 numeric_lit based (nlit_ptr),
%include cobol_TYPE2;
/* END DECLARATION OF TYPE2 (NUMERIC LITERAL) TOKEN */

/* END INCLUDE FILE ... cobol_type2.incl.pl1 */

