
/* BEGIN INCLUDE FILE ...   cobol_cdtoken.incl.pl1 */

dcl 1 cdtoken based(ptr1),
%include cobol_CDTOKEN;

/* END INCLUDE FILE ...   cobol_cdtoken.incl.pl1 */

