
/* BEGIN INCLUDE FILE ...   cobol_linage_name_rec.incl.pl1 */
/*	Size (excluding variable length fields):
		645/6180	32 bytes
		p7	17 bytes		*/
dcl 1 linage_name_rec based(com2_ptr),
	2 next char(5),
	2 line fixed bin,
	2 column fixed bin,
	2 fileno fixed bin,
	2 desc fixed bin,
	2 unused fixed bin,
	2 size fixed bin,
	2 name char(31);
/* END INCLUDE FILE ...   cobol_linage_name_rec.incl.pl1 */

