
/* BEGIN INCLUDE FILE ...   cobol_skey_rec.incl.pl1 */
dcl 1 skey_rec based(skey_ptr),
     2 next char(5),
     2 qual char(5),
     2 keyno fixed bin,
     2 asc_des fixed bin,
     2 ref_line fixed bin,
     2 ref_column fixed bin,
     2 info bit(8),
     2 size fixed bin,
     2 name char(31);
/* END INCLUDE FILE ...  cobol_skey_rec.incl.pl1 */

