
/* BEGIN INCLUDE FILE ...   cobol_pdsyntax_1.incl.pl1 */

dcl 01 line ,
    02 scan_bit char (1),
    02 output_bit char (1),
    02 test_type fixed bin (15),
    02 test_field fixed bin (15),
    02 success_exit fixed bin (15),
    02 action_number fixed bin (15) ;

/* END INCLUDE FILE ...   cobol_pdsyntax_1.incl.pl1 */

