
/* BEGIN INCLUDE FILE ... cobol_type1.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A reserved word token is created in the minpral files for each occurrence
of a reserved word in the source program.  The value of the key field
indicates the specific reserved word which a type 1 token represents.
*/

dcl rw_ptr ptr;

/* BEGIN DECLARATION OF TYPE1 (RESERVED WORD) TOKEN */
dcl	1 reserved_word based (rw_ptr),
%include cobol_TYPE1;
/* END DECLARATION OF TYPE1 (RESERVED WORD) TOKEN */

/* END INCLUDE FILE ... cobol_type1.incl.pl1 */

