
/* BEGIN INCLUDE FILE ... cobol_type9.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A type 9 data name token is entered into the name table by the data
division syntax phase for each data name described in the data division.
The replacement phase subsequently replaces type 8 user word references
to data names in the procedure division minpral file with the corresponding
type 9 tokens from the name table.
*/

/* dcl dn_ptr ptr; */

/* BEGIN DECLARATION OF TYPE9 (DATA NAME) TOKEN */
dcl 1 data_name based (dn_ptr),
%include cobol_TYPE9;
/* END DECLARATION OF TYPE9 (DATA NAME) TOKEN */

/* END INCLUDE FILE ... cobol_type9.incl.pl1 */

