
/* BEGIN INCLUDE FILE ...   cobol_gns_tab.incl.pl1 */

/* Membership table for scans and character look-ups */
/* 	column 1:  alphanumeric characters [0->9 a->z A->Z -] */
/* 	column 2:  digits [0->9] */
/* 	column 3:  picture characters [all printable characters except " ;] */
/* 	column 4:  binary characters [0 1] */
/* 	column 5:  delimiters [nl space " ( ) , . ;] */
/* 	column 6:  delimiters [. ; ,] */
/* 	column 7:  delimiters [nl sp] */
/* 	column 8:  delimiters [nl sp . ; ,] */

dcl   mem_tab(0: 511) bit(8) static init(
     "00000000"b /* 	(NUL)	000	  0   */ ,
     "00000000"b /* 	(SOH)	001	  1   */ ,
     "00000000"b /* 	(STX)	002	  2   */ ,
     "00000000"b /* 	(ETX)	003	  3   */ ,
     "00000000"b /* 	(EOT)	004	  4   */ ,
     "00000000"b /* 	(ENQ)	005	  5   */ ,
     "00000000"b /* 	(ACK)	006	  6   */ ,
     "00000000"b /* 	BEL	007	  7   */ ,
     "00000000"b /* 	BS	010	  8   */ ,
     "00000000"b /* 	HT	011	  9   */ ,
     "00001011"b /* 	NL(LF)	012	 10   */ ,
     "00000000"b /* 	VT	013	 11   */ ,
     "00000000"b /* 	NP(FF)	014	 12   */ ,
     "00000000"b /* 	(CR)	015	 13   */ ,
     "00000000"b /* 	RRS(S0)	016	 14   */ ,
     "00000000"b /* 	BRS(S1)	017	 15   */ ,
     "00000000"b /* 	(DLE)	020	 16   */ ,
     "00000000"b /* 	(DC1)	021	 17   */ ,
     "00000000"b /* 	HLF(DC2)	022	 18   */ ,
     "00000000"b /* 	(DC3)	023	 19   */ ,
     "00000000"b /* 	HLR(DC4)	024	 20   */ ,
     "00000000"b /* 	(NAK)	025	 21   */ ,
     "00000000"b /* 	(SYN)	026	 22   */ ,
     "00000000"b /* 	(ETB)	027	 23   */ ,
     "00000000"b /* 	(CAN)	030	 24   */ ,
     "00000000"b /* 	(EM)	031	 25   */ ,
     "00000000"b /* 	(SUB)	032	 26   */ ,
     "00000000"b /* 	(ESC)	033	 27   */ ,
     "00000000"b /* 	(FS)	034	 28   */ ,
     "00000000"b /* 	(GS)	035	 29   */ ,
     "00000000"b /* 	(RS)	036	 30   */ ,
     "00000000"b /* 	(US)	037	 31   */ ,
     "00001011"b /* 	Space	040	 32   */ ,
     "00100000"b /* 	!	041	 33   */ ,
     "00001000"b /* 	"	042	 34   */ ,
     "00100000"b /* 	#	043	 35   */ ,
     "00100000"b /* 	$	044	 36   */ ,
     "00100000"b /* 	%	045	 37   */ ,
     "00100000"b /* 	&	046	 38   */ ,
     "00100000"b /* 	'	047	 39   */ ,
     "00101000"b /* 	(	050	 40   */ ,
     "00101000"b /* 	)	051	 41   */ ,
     "00100000"b /* 	*	052	 42   */ ,
     "00100000"b /* 	+	053	 43   */ ,
     "00101101"b /* 	,	054	 44   */ ,
     "10100000"b /* 	-	055	 45   */ ,
     "00101101"b /* 	.	056	 46   */ ,
     "00100000"b /* 	/	057	 47   */ ,
     "11110000"b /* 	0	060	 48   */ ,
     "11110000"b /* 	1	061	 49   */ ,
     "11100000"b /* 	2	062	 50   */ ,
     "11100000"b /* 	3	063	 51   */ ,
     "11100000"b /* 	4	064	 52   */ ,
     "11100000"b /* 	5	065	 53   */ ,
     "11100000"b /* 	6	066	 54   */ ,
     "11100000"b /* 	7	067	 55   */ ,
     "11100000"b /* 	8	070	 56   */ ,
     "11100000"b /* 	9	071	 57   */ ,
     "00100000"b /* 	:	072	 58   */ ,
     "00001101"b /* 	;	073	 59   */ ,
     "00100000"b /* 	<	074	 60   */ ,
     "00101010"b /* 	=	075	 61   */ ,
     "00100000"b /* 	>	076	 62   */ ,
     "00100000"b /* 	?	077	 63   */ ,
     "00100000"b /* 	@	100	 64   */ ,
     "10100000"b /* 	A	101	 65   */ ,
     "10100000"b /* 	B	102	 66   */ ,
     "10100000"b /* 	C	103	 67   */ ,
     "10100000"b /* 	D	104	 68   */ ,
     "10100000"b /* 	E	105	 69   */ ,
     "10100000"b /* 	F	106	 70   */ ,
     "10100000"b /* 	G	107	 71   */ ,
     "10100000"b /* 	H	110	 72   */ ,
     "10100000"b /* 	I	111	 73   */ ,
     "10100000"b /* 	J	112	 74   */ ,
     "10100000"b /* 	K	113	 75   */ ,
     "10100000"b /* 	L	114	 76   */ ,
     "10100000"b /* 	M	115	 77   */ ,
     "10100000"b /* 	N	116	 78   */ ,
     "10100000"b /* 	O	117	 79   */ ,
     "10100000"b /* 	P	120	 80   */ ,
     "10100000"b /* 	Q	121	 81   */ ,
     "10100000"b /* 	R	122	 82   */ ,
     "10100000"b /* 	S	123	 83   */ ,
     "10100000"b /* 	T	124	 84   */ ,
     "10100000"b /* 	U	125	 85   */ ,
     "10100000"b /* 	V	126	 86   */ ,
     "10100000"b /* 	W	127	 87   */ ,
     "10100000"b /* 	X	130	 88   */ ,
     "10100000"b /* 	Y	131	 89   */ ,
     "10100000"b /* 	Z	132	 90   */ ,
     "00100000"b /* 	[	133	 91   */ ,
     "00100000"b /* 	\	134	 92   */ ,
     "00100000"b /* 	]	135	 93   */ ,
     "00100000"b /* 	^	136	 94   */ ,
     "00100000"b /* 	_	137	 95   */ ,
     "00100000"b /* 	`	140	 96   */ ,
     "10100000"b /* 	a	141	 97   */ ,
     "10100000"b /* 	b	142	 98   */ ,
     "10100000"b /* 	c	143	 99   */ ,
     "10100000"b /* 	d	144	100   */ ,
     "10100000"b /* 	e	145	101   */ ,
     "10100000"b /* 	f	146	102   */ ,
     "10100000"b /* 	g	147	103   */ ,
     "10100000"b /* 	h	150	104   */ ,
     "10100000"b /* 	i	151	105   */ ,
     "10100000"b /* 	j	152	106   */ ,
     "10100000"b /* 	k	153	107   */ ,
     "10100000"b /* 	l	154	108   */ ,
     "10100000"b /* 	m	155	109   */ ,
     "10100000"b /* 	n	156	110   */ ,
     "10100000"b /* 	o	157	111   */ ,
     "10100000"b /* 	p	160	112   */ ,
     "10100000"b /* 	q	161	113   */ ,
     "10100000"b /* 	r	162	114   */ ,
     "10100000"b /* 	s	163	115   */ ,
     "10100000"b /* 	t	164	116   */ ,
     "10100000"b /* 	u	165	117   */ ,
     "10100000"b /* 	v	166	118   */ ,
     "10100000"b /* 	w	167	119   */ ,
     "10100000"b /* 	x	170	120   */ ,
     "10100000"b /* 	y	171	121   */ ,
     "10100000"b /* 	z	172	122   */ ,
     "00100000"b /* 	{	173	123   */ ,
     "00100000"b /* 	|	174	124   */ ,
     "00100000"b /* 	}	175	125   */ ,
     "00100000"b /* 	~	176	126   */ ,
     "00000000"b /* 	DEL	177	127   */ ,
     (384)(1)"00000000"b
     );

dcl  x(0: 511) fixed bin (8) static init (
     10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,12 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,
     10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,10 ,12 ,10 ,3 ,10 ,
     10 ,8 ,10 ,4 ,11 ,13 ,7 ,6 ,5 ,18 ,14 ,9 ,2 ,2 ,2 ,2 ,2 ,2 ,2 ,2 ,2 ,2 ,
     10 ,5 ,16 ,15 ,17 ,10 ,10 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,
     1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,10 ,10 ,10 ,
     10 ,10 ,10 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,1 ,
     1 ,1 ,1 ,1 ,1 ,1 ,10 ,10 ,10 ,10 ,10,
     (384)10
     );						/* end switch */

/* END INCLUDE FILE ...   cobol_gns_tab.incl.pl1 */

