
/* BEGIN INCLUDE FILE ... cobol_type10.incl.pl1 */
/* Last modified on 11/19/76 by ORN */
/*
A type 10 index name token is entered into the name table by the data
division syntax phase for each index name appearing in the data division.
An index name is declared in the indexed by phrase of an occurs clause.
maintain the binary byte offset, within the array, corresponding to the
current setting of the index name.  The right-most two bytes contain the
binary occurrence number to which the index name is set.
When the replacement phase processes the procedure division minpral file,
each reference to an index name is replaced with the type 10 token created
for that index name.
*/

dcl ind_ptr ptr;

/* BEGIN DECLARATION OF TYPE10 (INDEX NAME) TOKEN */
dcl	1 index_name based (ind_ptr),
%include cobol_TYPE10;
/* END DECLARATION OF TYPE10 (INDEX NAME) TOKEN */

/* END INCLUDE FILE ... cobol_type10.incl.pl1 */

