
/* BEGIN INCLUDE FILE ... cobol_type12.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A type 12 file name token is entered into the name table by the data
division syntax phase for each file name appearing in the data division.
When the replacement phase processes the procedure division minpral file,
each reference to a file name is replaced with the type 12 token created
for that file name.
*/

/* dcl name_ptr ptr; */

/* BEGIN DECLARATION OF TYPE12 (FILE NAME) TOKEN */
dcl 	1 fd_token based (name_ptr),
%include cobol_TYPE12;
/* END DECLARATION OF TYPE12 (FILE NAME) TOKEN */


/* END INCLUDE FILE ... cobol_type12.incl.pl1 */

