
/* BEGIN INCLUDE FILE ... cobol_occurs.incl.pl1 */
/* Last Modified on 01/19/77 by ORN */

dcl 1 occurs based (ptr1),
%include cobol_OCCURS;

/* END INCLUDE FILE ... cobol_occurs.incl.pl1 */

