
/*     <<<   INITIAL VALUE EXTENSION INCLUDE FILE   >>>     */
/*     <<<   LAST MODIFIED ON 08-16-74   >>>     */

/*
An initial value extension is included in a type 9 data name token when the
description of the data name includes a value clause.  An initial value
extension is also included in a type 11 condition name token for each
value specified for the condition name.
An initial value extension has one of two formats, depending on the class
of the literal specified as a value.  The first seven bits of each of the
two formats have the same meaning, and identify the format.
*/

/* The Numeric Initial Value Structure */


/*	***STRUCTURE SIZE INFORMATION***	*/
/*     THE SIZE OF THIS STRUCTURE IN BYTES, (EXCLUDING VARIABLE
       LENGTH ENTITIES), FOR EACH HARDWARE IMPLEMENTATION IS:

	HARDWARE	|	SIZE (BYTES)
	---------------------------------
	6180	|	20
	P7	|	12
	---------------------------------
*/

dcl num_init_ptr ptr;

dcl	1 num_init based (num_init_ptr),
		2 numeric bit (1),
		2 non_numeric bit (1),
		2 fig_con bit (1),
		2 all_lit bit (1),
		2 single bit (1),
		2 thru1 bit (1),
		2 thru2 bit (1),
		2 filler1 bit (1),
		2 integral bit (1),
		2 floating bit (1),
		2 filler2 bit (6),
		2 sign char (1),
		2 exp_sign char (1),
		2 exp_places fixed bin (15),
		2 places_left fixed bin (15),
		2 places_right fixed bin (15),
		2 places fixed bin (15),
		2 literal char (30);


/*

FIELD		CONTENTS

numeric		"1"b
non_numeric	"0"b
fig_con		Set to "1"b when this literal is a figurative constant.
		If the literal is of the form ALL literal, this field
		is set to "1"b only when the literal following ALL is
		itself a figurative constant.
all_lit		Set to "1"b when this literal is a figurative constant
		of the form ALL literal.
single		Set to "1"b when this literal is a value of a condition
		name but is not part of a thru phrase.
thru1		Set to "1"b when this is the first literal in a thru
		phrase.
thru2		Set to "1"b when this is the second literal in a thru
		phrase.
filler1		Available for future use.
integral		Set to "1"b when this literal is an integer.
floating		Set to "1"b when this is a floating-point literal.  Set
		to "0"b when this is a fixed-point literal.
filler2		Available for future use.
sign		The sign of the fixed-point part (as opposed to the
		exponent) of the literal.  The possible values of this
		field are "+", "-", and a space.
exp_sign		The sign of the exponent of the literal.  The possible
		values of this field are "+", "-", and a space.  This
		field is significant only when floating is "1"b.
exp_places	The number of digits in the exponent of the literal.
places_left	The number of digits to the left of the decimal point
		in the fixed-point part of the literal.
places_right	The number of digits to the right of the decimal point
		in the fixed-point part of the literal.
places		The number of digits in the literal, including the
		exponent.
literal		The digits of the literal.

*/




/* The Alphanumeric Initial Value Structure */

/*	***STRUCTURE SIZE INFORMATION***	*/
/*     THE SIZE OF THIS STRUCTURE IN BYTES, (EXCLUDING VARIABLE
       LENGTH ENTITIES), FOR EACH HARDWARE IMPLEMENTATION IS:

	HARDWARE	|	SIZE (BYTES)
	---------------------------------
	6180	|	8
	P7	|	4
	---------------------------------
*/

dcl alp_init_ptr ptr;

dcl	1 alpha_init based (alp_init_ptr),
		2 numeric bit (1),
		2 non_numeric bit (1),
		2 fig_con bit (1),
		2 all_lit bit (1),
		2 single bit (1),
		2 thru1 bit (1),
		2 thru2 bit (1),
		2 filler1 bit (1),
		2 bit_string bit (1),
		2 fig_con_index bit (7),
		2 lit_size fixed bin (15),
		2 string char (770);


/*

FIELD		CONTENTS

numeric		"0"b
non_numeric	"1"b
fig_con		Set to "1"b when this literal is a figurative constant.
all_lit		Set to "1"b when this literal is a figurative constant
		of the form ALL literal.
single		Set to "1"b when this literal is a value of a condition
		name but is not part of a thru phrase.
thru1		Set to "1"b when this is the first literal in a thru
		phrase.
thru2		Set to "1"b when this is the second literal in a thru
		phrase.
filler1		Available for future use.
bit_string	Set to "1"b when this is a boolean literal.
fig_con_index	A binary value identifying this figurative constant.
		This field is significant only when fig_con is "1"b.
		1 = zero, zeros, zeroes
		2 = space, spaces
		3 = upper-bound, upper-bounds
		4 = lower-bound, lower-bounds
		5 = high-value, high-values
		6 = low-value, low-values
		7 = quote, quotes
lit_size		The number of characters in the literal, excluding
		delimiting quotation marks.
string		The literal character-string.

*/

/*     <<<   END OF INITIAL VALUE EXTENSION INCLUDE FILE   >>>     */
