
/*  BEGIN INCLUDE FILE ...   cobol_in_token.incl.pl1		  */

/*  Last modified August 22, 1974 by AEG		  */


declare in_token_ptr ptr;

declare 1 in_token aligned based(in_token_ptr),
	2 n fixed bin aligned,
	2 code fixed bin aligned,
	2 token_ptr(0 refer(in_token.n)) ptr aligned;


/*  END INCLUDE FILE ...   cobol_in_token.incl.pl1		  */

