
/* BEGIN INCLUDE FILE ...   cobol_error_info.incl.pl1 */
/* Last modified  July 8, 1974 by ORN */

dcl 1 error_info,
     2 name char(32),
     2 message_len fixed bin,
     2 message char(128);


/*
name		the name of the program signalling the error.

message_len	the number of valid characters in message.

message		the text of the message to be issued.
*/

/* END INCLUDE FILE ...   cobol_error_info.incl.pl1 */

