
/*  BEGIN INCLUDE FILE ...   cobol_mcdb.incl.pl1   */
/*  Last modified on 10/31/74 by tlf  */

/*  DECLARATION OF MCOBOL DEBUGGING SWITCHES  */

dcl   cobol_mcdb_enable bit (1) ext static;
dcl   cobol_mcdb_flag (1:100) bit (1) ext static;

/*  ASSIGNMENT OF DEBUGGING SWITCHES  */


dcl mcdb_compare_gen fixed bin int static 	init (1);
dcl mcdb_compute_gen fixed bin int static	init (2);
dcl mcdb_bldresop fixed bin int static		init (3);


/*  END INCLUDE FILE...   cobol_mcdb.incl.pl1  */

