
/* BEGIN INCLUDE FILE ... cobol_type40.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

/*
A type 40 token is entered into the name table by the IDED syntax.
This token contains the information for the alphabet name.
*/

dcl	alpha_name_ptr	ptr;

/* BEGIN DECLARATION OF TYPE40 (ALPHABET NAME) TOKEN */
dcl 1 alphabet_name based (alpha_name_ptr),
%include cobol_TYPE40;
/* END DECLARATION OF TYPE40 (ALPHABET NAME) TOKEN */

/* END INCLUDE FILE ... cobol_type40.incl.pl1 */

