
/* BEGIN INCLUDE FILE ...   cobol_special_dcls.incl.pl1 */
/*	last modified on 11/20/74			*/
dcl bits_per_char fixed bin static internal init  (9);
dcl bits_per_word fixed bin static internal init  (36);  
dcl one_word_in_bits bit  (36) static internal;
dcl chtbl (343) fixed bin(24) based(ptr4);
dcl cma (14) fixed bin(24) based(ptr4);
dcl cntbuf (250) fixed bin(24) based(ptr4);
dcl cntbuf2 (125) fixed bin(24) based(ptr4);
dcl chtbl_item (7) fixed bin(24) based; 
/* END INCLUDE FILE ...   cobol_special_dcls.incl.pl1 */

