
/* BEGIN INCLUDE FILE ...   cobol_fd_token.incl.pl1 */
/*	last modified on 2/21/74			*/
dcl 1 fd_token based(w2_ptr),
%include cobol_FD_TOKEN;
/* END INCLUDE FILE ...   cobol_fd_token.incl.pl1 */

