
/* BEGIN INCLUDE FILE ... cobol_type13.incl.pl1 */
/* Last modified on 11/19/76 by ORN */

dcl cdtoken_ptr ptr;

/* BEGIN DECLARATION OF TYPE13 (CD NAME) TOKEN */
dcl 1 cdtoken based(cdtoken_ptr),
%include cobol_TYPE13;
/* END DECLARATION OF TYPE13 (CD NAME) TOKEN */


/* END INCLUDE FILE ... cobol_type13.incl.pl1 */

