
/* BEGIN INCLUDE FILE ...   cobol_perform_stuff.incl.pl1 */

dcl c26 char (28) based;	/* used to move perform range entry */

dcl fb26 fixed bin (15) static init (28);	/* used to write perform range entry */

dcl convalue fixed bin (15) static init (48);   /* used for range check in set verb */

/* END INCLUDE FILE ...   cobol_perform_stuff.incl.pl1 */

