
/* BEGIN INCLUDE FILE ...   cobol_obj_rec.incl.pl1 */

dcl 1 obj_rec based(com2_ptr),
     2 qual char(5),
     2 line fixed bin,
     2 column fixed bin,
     2 repl fixed bin,
     2 size fixed bin,
     2 name char(31);

/* END INCLUDE FILE ...   cobol_obj_rec.incl.pl1 */

