
/* BEGIN INCLUDE FILE ...   cobol_eln_table.incl.pl1 */

dcl 1 eln_tab(20000)	based(  cobol_$eln_ptr),
     2 fno		fixed bin(17) unaligned,
     2 lno		fixed bin(17) unaligned;

dcl eln_index		fixed bin;

dcl 1 statement_info(20000)	based(  cobol_$statement_info_ptr),
     2 start		fixed bin(24) unaligned,
     2 length		fixed bin(8) unaligned;

/* END INCLUDE FILE ...   cobol_eln_table.incl.pl1 */

