
/* BEGIN INCLUDE FILE ... cobol_.incl.pl1 */
/* last modified Feb 4, 1977 by ORN  */

/* This file defines all external data used in the generator phase of Multics Cobol */

/* POINTERS */
dcl cobol_$text_base_ptr ptr  ext;
dcl text_base_ptr ptr  defined (cobol_$text_base_ptr);
dcl cobol_$con_end_ptr ptr  ext;
dcl con_end_ptr ptr  defined (cobol_$con_end_ptr);
dcl cobol_$def_base_ptr ptr  ext;
dcl def_base_ptr ptr  defined (cobol_$def_base_ptr);
dcl cobol_$link_base_ptr ptr  ext;
dcl link_base_ptr ptr  defined (cobol_$link_base_ptr);
dcl cobol_$sym_base_ptr ptr  ext;
dcl sym_base_ptr ptr  defined (cobol_$sym_base_ptr);
dcl cobol_$reloc_text_base_ptr ptr  ext;
dcl reloc_text_base_ptr ptr  defined (cobol_$reloc_text_base_ptr);
dcl cobol_$reloc_def_base_ptr ptr  ext;
dcl reloc_def_base_ptr ptr  defined (cobol_$reloc_def_base_ptr);
dcl cobol_$reloc_link_base_ptr ptr  ext;
dcl reloc_link_base_ptr ptr  defined (cobol_$reloc_link_base_ptr);
dcl cobol_$reloc_sym_base_ptr ptr  ext;
dcl reloc_sym_base_ptr ptr  defined (cobol_$reloc_sym_base_ptr);
dcl cobol_$reloc_work_base_ptr ptr  ext;
dcl reloc_work_base_ptr ptr  defined (cobol_$reloc_work_base_ptr);
dcl cobol_$pd_map_ptr ptr  ext;
dcl pd_map_ptr ptr  defined (cobol_$pd_map_ptr);
dcl cobol_$fixup_ptr ptr  ext;
dcl fixup_ptr ptr  defined (cobol_$fixup_ptr);
dcl cobol_$initval_base_ptr ptr  ext;
dcl initval_base_ptr ptr  defined (cobol_$initval_base_ptr);
dcl cobol_$initval_file_ptr ptr  ext;
dcl initval_file_ptr ptr  defined (cobol_$initval_file_ptr);
dcl cobol_$perform_list_ptr ptr  ext;
dcl perform_list_ptr ptr  defined (cobol_$perform_list_ptr);
dcl cobol_$alter_list_ptr ptr  ext;
dcl alter_list_ptr ptr  defined (cobol_$alter_list_ptr);
dcl cobol_$seg_init_list_ptr ptr  ext;
dcl seg_init_list_ptr ptr  defined (cobol_$seg_init_list_ptr);
dcl cobol_$temp_token_area_ptr ptr  ext;
dcl temp_token_area_ptr ptr  defined (cobol_$temp_token_area_ptr);
dcl cobol_$temp_token_ptr ptr  ext;
dcl temp_token_ptr ptr  defined (cobol_$temp_token_ptr);
dcl cobol_$token_block1_ptr ptr  ext;
dcl token_block1_ptr ptr  defined (cobol_$token_block1_ptr);
dcl cobol_$token_block2_ptr ptr  ext;
dcl token_block2_ptr ptr  defined (cobol_$token_block2_ptr);
dcl cobol_$minpral5_ptr ptr  ext;
dcl minpral5_ptr ptr  defined (cobol_$minpral5_ptr);
dcl cobol_$tag_table_ptr ptr  ext;
dcl tag_table_ptr ptr  defined (cobol_$tag_table_ptr);
dcl cobol_$map_data_ptr ptr  ext;
dcl map_data_ptr ptr  defined (cobol_$map_data_ptr);
dcl cobol_$ptr_status_ptr ptr  ext;
dcl ptr_status_ptr ptr  defined (cobol_$ptr_status_ptr);
dcl cobol_$reg_status_ptr ptr  ext;
dcl reg_status_ptr ptr  defined (cobol_$reg_status_ptr);
dcl cobol_$misc_base_ptr ptr ext;
dcl misc_base_ptr ptr defined (cobol_$misc_base_ptr);
dcl cobol_$misc_end_ptr ptr ext;
dcl misc_end_ptr ptr defined (cobol_$misc_end_ptr);
dcl cobol_$list_ptr ptr ext;
dcl list_ptr ptr defined (cobol_$list_ptr);
dcl cobol_$allo1_ptr ptr ext;
dcl allo1_ptr ptr defined (cobol_$allo1_ptr);
dcl cobol_$eln_ptr ptr ext;
dcl eln_ptr ptr defined (cobol_$eln_ptr);
dcl cobol_$diag_ptr ptr ext;
dcl diag_ptr ptr defined (cobol_$diag_ptr);
dcl cobol_$xref_token_ptr ptr ext;
dcl xref_token_ptr ptr defined (cobol_$xref_token_ptr);
dcl cobol_$xref_chain_ptr ptr ext;
dcl xref_chain_ptr ptr defined (cobol_$xref_chain_ptr);
dcl cobol_$statement_info_ptr ptr ext;
dcl statement_info_ptr ptr defined (cobol_$statement_info_ptr);
dcl cobol_$reswd_ptr ptr ext;
dcl reswd_ptr ptr defined (cobol_$reswd_ptr);
dcl cobol_$op_con_ptr ptr ext;
dcl op_con_ptr ptr defined (cobol_$op_con_ptr);
dcl cobol_$ntbuf_ptr ptr ext;
dcl ntbuf_ptr ptr defined (cobol_$ntbuf_ptr);
dcl cobol_$main_pcs_ptr ptr ext;
dcl main_pcs_ptr ptr defined (cobol_$main_pcs_ptr);
dcl cobol_$include_info_ptr ptr ext;
dcl include_info_ptr ptr defined (cobol_$include_info_ptr);

/* FIXED BIN */
dcl cobol_$text_wd_off fixed bin  ext;
dcl text_wd_off fixed bin  defined (cobol_$text_wd_off);
dcl cobol_$con_wd_off fixed bin  ext;
dcl con_wd_off fixed bin  defined (cobol_$con_wd_off);
dcl cobol_$def_wd_off fixed bin  ext;
dcl def_wd_off fixed bin  defined (cobol_$def_wd_off);
dcl cobol_$def_max fixed bin  ext;
dcl def_max fixed bin  defined (cobol_$def_max);
dcl cobol_$link_wd_off fixed bin  ext;
dcl link_wd_off fixed bin  defined (cobol_$link_wd_off);
dcl cobol_$link_max fixed bin  ext;
dcl link_max fixed bin  defined (cobol_$link_max);
dcl cobol_$sym_wd_off fixed bin  ext;
dcl sym_wd_off fixed bin  defined (cobol_$sym_wd_off);
dcl cobol_$sym_max fixed bin  ext;
dcl sym_max fixed bin  defined (cobol_$sym_max);
dcl cobol_$reloc_text_max fixed bin(24)  ext;
dcl reloc_text_max fixed bin(24)  defined (cobol_$reloc_text_max);
dcl cobol_$reloc_def_max fixed bin(24)  ext;
dcl reloc_def_max fixed bin(24)  defined (cobol_$reloc_def_max);
dcl cobol_$reloc_link_max fixed bin(24)  ext;
dcl reloc_link_max fixed bin(24)  defined (cobol_$reloc_link_max);
dcl cobol_$reloc_sym_max fixed bin(24)  ext;
dcl reloc_sym_max fixed bin(24)  defined (cobol_$reloc_sym_max);
dcl cobol_$reloc_work_max fixed bin(24)  ext;
dcl reloc_work_max fixed bin(24)  defined (cobol_$reloc_work_max);
dcl cobol_$pd_map_index fixed bin  ext;
dcl pd_map_index fixed bin  defined (cobol_$pd_map_index);
dcl cobol_$cobol_data_wd_off fixed bin  ext;
dcl cobol_data_wd_off fixed bin  defined (cobol_$cobol_data_wd_off);
dcl cobol_$stack_off fixed bin  ext;
dcl stack_off fixed bin  defined (cobol_$stack_off);
dcl cobol_$max_stack_off fixed bin  ext;
dcl max_stack_off fixed bin  defined (cobol_$max_stack_off);
dcl cobol_$init_stack_off fixed bin  ext;
dcl init_stack_off fixed bin  defined (cobol_$init_stack_off);
dcl cobol_$pd_map_sw fixed bin  ext;
dcl pd_map_sw fixed bin  defined (cobol_$pd_map_sw);
dcl cobol_$next_tag fixed bin  ext;
dcl next_tag fixed bin  defined (cobol_$next_tag);
dcl cobol_$data_init_flag fixed bin  ext;
dcl data_init_flag fixed bin  defined (cobol_$data_init_flag);
dcl cobol_$seg_init_flag fixed bin  ext;
dcl seg_init_flag fixed bin  defined (cobol_$seg_init_flag);
dcl cobol_$alter_flag fixed bin  ext;
dcl alter_flag fixed bin  defined (cobol_$alter_flag);
dcl cobol_$sect_eop_flag fixed bin  ext;
dcl sect_eop_flag fixed bin  defined (cobol_$sect_eop_flag);
dcl cobol_$para_eop_flag fixed bin  ext;
dcl para_eop_flag fixed bin  defined (cobol_$para_eop_flag);
dcl cobol_$priority_no fixed bin  ext;
dcl priority_no fixed bin  defined (cobol_$priority_no);
dcl cobol_$compile_count fixed bin ext;
dcl compile_count fixed bin defined (cobol_$compile_count);
dcl cobol_$ptr_assumption_ind fixed bin ext;
dcl ptr_assumption_ind fixed bin defined (cobol_$ptr_assumption_ind);
dcl cobol_$reg_assumption_ind fixed bin ext;
dcl reg_assumption_ind fixed bin defined (cobol_$reg_assumption_ind);
dcl cobol_$perform_para_index fixed bin ext;
dcl perform_para_index fixed bin defined (cobol_$perform_para_index);
dcl cobol_$perform_sect_index fixed bin ext;
dcl perform_sect_index fixed bin defined (cobol_$perform_sect_index);
dcl cobol_$alter_index fixed bin ext;
dcl alter_index fixed bin defined (cobol_$alter_index);
dcl cobol_$list_off fixed bin ext;
dcl list_off fixed bin defined (cobol_$list_off);
dcl cobol_$constant_offset fixed bin ext;
dcl constant_offset fixed bin defined (cobol_$constant_offset);
dcl cobol_$misc_max fixed bin ext;
dcl misc_max fixed bin defined (cobol_$misc_max);
dcl cobol_$pd_map_max fixed bin ext;
dcl pd_map_max fixed bin defined (cobol_$pd_map_max);
dcl cobol_$map_data_max fixed bin ext;
dcl map_data_max fixed bin defined (cobol_$map_data_max);
dcl cobol_$fixup_max fixed bin ext;
dcl fixup_max fixed bin defined (cobol_$fixup_max);
dcl cobol_$tag_table_max fixed bin ext;
dcl tag_table_max fixed bin defined (cobol_$tag_table_max);
dcl cobol_$temp_token_max fixed bin ext;
dcl temp_token_max fixed bin defined (cobol_$temp_token_max);
dcl cobol_$allo1_max fixed bin ext;
dcl allo1_max fixed bin defined (cobol_$allo1_max);
dcl cobol_$eln_max fixed bin ext;
dcl eln_max fixed bin defined (cobol_$eln_max);
dcl cobol_$debug_enable fixed bin ext;
dcl debug_enable fixed bin defined (cobol_$debug_enable);
dcl cobol_$non_source_offset fixed bin ext;
dcl non_source_offset fixed bin defined (cobol_$non_source_offset);
dcl cobol_$initval_flag fixed bin ext;
dcl initval_flag fixed bin defined (cobol_$initval_flag);
dcl cobol_$date_compiled_sw fixed bin ext;
dcl date_compiled_sw fixed bin defined (cobol_$date_compiled_sw);
dcl cobol_$include_cnt fixed bin ext;
dcl include_cnt fixed bin defined (cobol_$include_cnt);
dcl cobol_$fs_charcnt fixed bin ext;
dcl fs_charcnt fixed bin defined (cobol_$fs_charcnt);
dcl cobol_$ws_charcnt fixed bin ext;
dcl ws_charcnt fixed bin defined (cobol_$ws_charcnt);
dcl cobol_$coms_charcnt fixed bin ext;
dcl coms_charcnt fixed bin defined (cobol_$coms_charcnt);
dcl cobol_$ls_charcnt fixed bin ext;
dcl ls_charcnt fixed bin defined (cobol_$ls_charcnt);
dcl cobol_$cons_charcnt fixed bin ext;
dcl cons_charcnt fixed bin defined (cobol_$cons_charcnt);
dcl cobol_$value_cnt fixed bin ext;
dcl value_cnt fixed bin defined (cobol_$value_cnt);
dcl cobol_$cd_cnt fixed bin ext;
dcl cd_cnt fixed bin defined (cobol_$cd_cnt);
dcl cobol_$fs_wdoff fixed bin ext;
dcl fs_wdoff fixed bin defined (cobol_$fs_wdoff);
dcl cobol_$ws_wdoff fixed bin ext;
dcl ws_wdoff fixed bin defined (cobol_$ws_wdoff);
dcl cobol_$coms_wdoff fixed bin ext;
dcl coms_wdoff fixed bin defined (cobol_$coms_wdoff);

/* CHARACTER */
dcl cobol_$scratch_dir char (168)   aligned ext;
dcl scratch_dir char (168)   aligned defined (cobol_$scratch_dir);			/* -42- */
dcl cobol_$obj_seg_name char (32)   aligned ext;
dcl obj_seg_name char (32)   aligned defined (cobol_$obj_seg_name);		/* -8- */

/* BIT */
dcl cobol_$xref_bypass bit(1) aligned ext;
dcl xref_bypass bit(1) aligned defined (cobol_$xref_bypass);			/* -1- */
dcl cobol_$same_sort_merge_proc bit(1) aligned ext;
dcl same_sort_merge_proc bit(1) aligned defined (cobol_$same_sort_merge_proc);		/* -1- */


/* END INCLUDE FILE ... cobol_incl.pl1*/


