/* BEGIN INCLUDE FILE ... comm_meters_disp_flags.incl.pl1 */


/* This include file defines named values for the bits in the flags argument passed
   to the various MPX_meters_$display entries.
*/

/* Created April 1981 by Robert Coren */

dcl  DISPLAY_MPX_BRIEF bit (36) internal static options (constant) init ("1"b);
dcl  DISPLAY_MPX_ERROR bit (36) internal static options (constant) init ("01"b);
dcl  DISPLAY_MPX_SUMMARY bit (36) internal static options (constant) init ("001"b);
dcl  DISPLAY_MPX_SINCE_BOOT bit (36) internal static options (constant) init ("0001"b);

/* END INCLUDE FILE  ... comm_meters_disp_flags.incl.pl1 */
