/* BEGIN INCLUDE FILE comp_entries.incl.pl1 */

/* format: style2,ind2,ll79,dclind4,idind15,comcol41,linecom */

     dcl compose_severity_
		    fixed bin (35) ext static;
     dcl comp_	    entry;
     dcl comp_art_	    entry (ptr, bit (1));
     dcl comp_block_ctls_
		    entry (fixed bin);
     dcl comp_break_    entry (fixed bin, fixed bin);
     dcl comp_break_ctls_
		    entry (fixed bin);
     dcl comp_ctls_	    entry (bit (1) aligned);
     dcl comp_eject_page_
		    entry;
     dcl comp_expr_eval_
		    entry (char (*) var, fixed bin (21), ptr, fixed bin,
		    fixed bin, bit (1), fixed bin (31), char (*) var,
		    bit (9), fixed bin (35));
     dcl comp_extr_str_ entry (bit (1), char (*) var, fixed bin (21),
		    fixed bin (21), fixed bin (21), ptr)
		    returns (char (*) var);
     dcl comp_fill_	    entry;
     dcl comp_font_	    entry (bit (1), char (*) var, char (8) aligned);
     dcl comp_format_ctls_
		    entry (fixed bin);
     dcl comp_get_file_$find
		    entry (char (*), ptr, char (*), bit (1), char (*) var,
		    fixed bin (35));
     dcl comp_get_file_$open
		    entry (ptr, bit (1), fixed bin (35));
     dcl comp_head_page_
		    entry (fixed bin (31));
     dcl comp_hft_ctls_ entry (fixed bin);
     dcl comp_hft_ctls_$title
		    entry (ptr, ptr, char (*) var, fixed bin (31));
     dcl comp_init_$one entry;
     dcl comp_init_$two entry;
     dcl comp_init_$three
		    entry;
     dcl comp_insert_ctls_
		    entry (fixed bin);
     dcl comp_make_page_
		    entry (fixed bin, bit (1));
     dcl comp_make_page_$cleanup
		    entry;
     dcl comp_measure_  entry (char (1020) var, ptr, bit (1), bit (1), bit (6),
		    fixed bin (31), ptr, ptr, ptr);
     dcl comp_read_$name
		    entry (char (*) var, fixed bin (21), fixed bin (21),
		    ptr) returns (char (*) var);
     dcl comp_read_$number
		    entry (char (*) var, (*) fixed bin (31),
		    fixed bin (21), fixed bin (21), ptr, fixed bin (35))
		    returns (fixed bin (31));
     dcl comp_read_$line
		    entry (ptr, char (*) var, bit (1));
     dcl comp_report_   entry (fixed bin, fixed bin (35), char (*), ptr,
		    char (*) var);
     dcl comp_report_$ctlstr
		    entry options (variable);
/****		 (sev, code, info, line, ctl_str, args... */
     dcl comp_report_$exact
		    entry (char (*), ptr);
     dcl comp_space_    entry (fixed bin (31), ptr, bit (1), bit (1), bit (1),
		    bit (1));
     dcl comp_tbl_ctls_ entry (fixed bin);
     dcl comp_title_block_
		    entry (ptr);
     dcl comp_update_symbol_
		    entry (bit (1), bit (1), bit (1), char (32),
		    char (*) var);
     dcl comp_use_ref_  entry (char (*) var, bit (1), bit (1), ptr);
     dcl comp_util_$add_text
		    entry (ptr, bit (1), bit (1), bit (1), bit (1), ptr);
     dcl comp_util_$display
		    entry (char (*) var, fixed bin, bit (1))
		    returns (char (*) var);
     dcl comp_util_$escape
		    entry (char (*) var, ptr);
     dcl comp_util_$getblk
		    entry (fixed bin, ptr, char (2), ptr, bit (1));
     dcl comp_util_$num_display
		    entry (ptr, fixed bin) returns (char (256) var);
     dcl comp_util_$pageno
		    entry (fixed bin, char (*) var);
     dcl comp_util_$pictures		/* emit pending pictures */
		    entry		/**/
		    (ptr);	/* current text block */
     dcl comp_util_$pop entry (char (32));
     dcl comp_util_$push
		    entry (char (32));
     dcl comp_util_$relblk
		    entry (fixed bin, ptr);
     dcl comp_util_$replace_text
		    entry (ptr, bit (1), ptr, ptr);
     dcl comp_util_$search_tree
		    entry (char (32), bit (1));
     dcl comp_util_$set_bin
		    entry (fixed bin (31), char (32) var, fixed bin (31),
		    fixed bin (31), fixed bin (31), (*) fixed bin (31),
		    fixed bin (31));
     dcl comp_util_$set_net_page
		    entry (bit (1));
     dcl comp_util_$translate
		    entry (char (*) var) returns (char (*) var);
     dcl comp_write_block_
		    entry (fixed bin);
     dcl comp_write_page_
		    entry;

/*	END INCLUDE FILE comp_entries.incl.pl1	*/
