/*	BEGIN INCLUDE FILE comp_hdrftr.incl.pl1			*/

dcl 1 spcl_blk	aligned like text based (shared.spcl_blkptr);
dcl 1 tc_block	aligned like text based (shared.tc_blkptr);
dcl 1 th_block	aligned like text based (shared.th_blkptr);

/*	END INCLUDE FILE comp_hdrftr.incl.pl1	*/
