/* BEGIN INCLUDE FILE ..... comp_outproc.incl.pl1 ..... 11/05/78 J Falksen */

/* compose INCLUDE FILES NEEDED BY ALL OUTPUT WRITERS */

%include translator_temp_alloc;
%include comp_areas;
%include comp_metacodes;
%include comp_DCdata;
%include comp_dvid;
%include comp_dvt;
%include comp_entries;
%include comp_fntstk;
%include comp_font;
%include comp_option;
%include comp_output;
%include comp_page;
%include comp_shared;
%include comp_text;
%include compstat;

/* END INCLUDE FILE ..... comp_outproc.incl.pl1 ..... */
