/*	BEGIN INCLUDE FILE comp_blank_page.incl.pl1	*/

dcl 1 blank_footer	aligned like text based (shared.blank_footer_ptr); /* single page footer for blank pages */
dcl 1 blank_header	aligned like text based (shared.blank_header_ptr); /* single page header for blank pages */
dcl 1 blank_text	aligned like text based (shared.blank_text_ptr); /* blank page text block */

/*	END INCLUDE FILE comp_blank_page.incl.pl1	*/
