/* BEGIN INCLUDE FILE ... config_tcd_card.incl.pl1 ... 11/27/80 W. Olin Sibert */

dcl  tcd_cardp pointer;				/* pointer to TCD card */

dcl 1 tcd_card aligned based (tcd_cardp),		/* TCD card declaration */
    2 word char (4),				/* "tcd" */
    2 no_apt fixed bin,				/* Number of APT entries */
    2 no_itt fixed bin,				/* Number of ITT entries */

    2 pad (12) bit (36) aligned,			/* Pad to 15 fields */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl  TCD_CARD_WORD char (4) aligned internal static options (constant) init ("tcd");

/* END INCLUDE FILE ... config_tcd_card.incl.pl1 */
