/* BEGIN INCLUDE FILE ... config_parm_card.incl.pl1 ... 11/27/80 W. Olin Sibert */

dcl parm_cardp pointer;				/* pointer to PARM card */

dcl 1 parm_card aligned based (parm_cardp),		/* PARM card declaration */
    2 word char (4),				/* "parm" */
    2 options (14) char (4),				/* Parameters and their values */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl 1 parm_card_array based (parm_cardp),		/* Overlay for counting options */
    2 pad bit (36) aligned,
    2 options (parm_card.n_fields) bit (36) aligned;


dcl  parm_ptr pointer;				/* For use with config$find_parm */

dcl 1 numeric_parm aligned based (parm_ptr),		/* Overlay into middle of card for looking */
    2 name char (4),				/* at a parameter found by config$find_parm */
    2 value fixed bin (35);

dcl 1 string_parm aligned based (parm_ptr),
    2 name char (4),
    2 value char (4);

dcl  PARM_CARD_WORD char (4) aligned internal static options (constant) init ("parm");

/* END INCLUDE FILE ... config_parm_card.incl.pl1 */
