/* BEGIN INCLUDE FILE ... config_iom_card.incl.pl1 ... 11/37/80 W. Olin Sibert */

dcl  iom_cardp pointer;				/* pointer to IOM card */

dcl 1 iom_card aligned based (iom_cardp),		/* IOM card declaration */
    2 word char (4),				/* "iom" */
    2 tag fixed bin (3),				/* One more than IOM tag set in maintenance panel switches */
    2 port fixed bin (3),				/* Controller port to which IOM is connected */
    2 model char (4),				/* IOM model number: "iomb", "nsa", "iioc" */
    2 state char (4),				/* State: "on" or "off" */

    2 pad (10) bit (36) aligned,			/* Pad to 15 fields */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl  IOM_CARD_WORD char (4) aligned internal static options (constant) init ("iom");

/* END INCLUDE FILE ... config_iom_card.incl.pl1 */
