/* BEGIN INCLUDE FILE ... config_sst_card.incl.pl1 ... 11/27/80 W. Olin Sibert */

dcl  sst_cardp pointer;				/* pointer to SST card */

dcl 1 sst_card aligned based (sst_cardp),		/* SST card declaration */
    2 word char (4),				/* "sst" */
    2 no_aste (0:3) fixed bin,			/* Size of the four ASTE pools */

    2 pad (10) bit (36) aligned,			/* Pad to 15 fields */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (4) unsigned unaligned;	/* number of fields used on card */

dcl  SST_CARD_WORD char (4) aligned internal static options (constant) init ("sst");

/* END INCLUDE FILE ... config_sst_card.incl.pl1 */
