/* BEGIN INCLUDE FILE ... config_prph_opc_card.incl.pl1 ... 11/27/80, W. Olin Sibert */

/* Modified 830613 to add state and line_leng fields to card... -E. A. Ranzenbach */
/* Modified 841205 to add mask field... -E. A. Ranzenbach */

dcl  prph_opc_cardp ptr;				/* pointer to PRPH OPC card */

dcl 1 prph_opc_card based (prph_opc_cardp) aligned,	/* PRPH OPC card declaration */
    2 word char (4),				/* "prph" */
    2 name char (4),				/* "opc" */
    2 iom fixed bin (3),				/* IOM number */
    2 chan fixed bin (8),				/* channel number */
    2 model fixed bin,				/* console model number */
    2 line_leng fixed bin,				/* line length of the console... */
    2 state char (4),				/* "io", "on", "alt", "off" or "inop"... */
    2 mask char (4),				/* "mask" means read_unechoed option is not installed... */
    2 pad (7) bit (36) aligned,			/* pad to 15 fields */

    2 type_word aligned,
      3 field_type (14) bit (2) unaligned,		/* type of each field; see config_deck.incl.pl1 */
      3 pad1 bit (4) unaligned,
      3 n_fields fixed bin (5) unsigned unaligned;	/* number of fields used on card */

/* END INCLUDE FILE ... config_prph_opc_card.incl.pl1 */
