


	/* the include file CURLC */

declare 1 eb_data_$curlc ext aligned,
        2 curlc fixed bin (17) aligned ;



	/* end of the include file CURLC */
