dcl tedstatus_	entry (		/* display saved environments        */
		char (*), 	/* name of temp dir 	       */
		fixed bin (35)	/* status code		       */
		);

