dcl tedpseudo_	entry (		/* make a pseudo (read-only) buffer  */
		ptr,		/* -> to buffer to convert	       */
		fixed bin,	/* segno of data (-1 if ^read)       */
		ptr,		/* -> the data		       */
		fixed bin (21)	/* the length of it 	       */
		);

