dcl tedcount_lines_ entry (		/* return # lines in string	       */
		ptr,		/* -> buffer in which to count       */
		fixed bin (21),	/* where string begins in segment    */
		fixed bin (21),	/* where string ends in segment      */
		fixed bin (21)	/* # lines		 [OUT] */
		);

