dcl tedpromote_	entry (		/* get a larger data buffer	       */
		ptr,		/* -> buffer to promote	       */
		fixed bin (21)	/* amount not fitting	       */
		);

