	/* BEGIN dm_bj_static.incl.pl1 */
/*
Modified: 
10/04/82 by Lee A. Newcomb:  To change from internal static to external
	  static.
*/

dcl dm_system_data_$bj_max_n_journals		fixed bin ext static;
dcl dm_system_data_$bj_max_n_processes		fixed bin ext static;
dcl dm_system_data_$max_n_transactions     fixed bin ext static;

	/* END dm_bj_static.incl.pl1 */

