/* BEGIN INCLUDE FILE:	dm_bj_check_in_table.incl.pl1	*/
/*
Table for fast checking of who's got what BJ open

Written by Andre Bensoussan June/July 1982
Modified:
08/30/82 by Lee A. Newcomb:  To use dm_system_data_ for max length of
	  vector and array bounds.
*/
/* format: style4,indattr,idind33,^indcomtxt */

dcl  bj_check_in_table_ptr	        ptr;

dcl  1 bj_check_in_table	        based (bj_check_in_table_ptr) aligned,
       2 max_n_processes	        fixed bin,
       2 max_n_journals	        fixed bin,
       2 process_id		        dim (dm_system_data_$bj_max_n_processes refer
			        (bj_check_in_table.max_n_processes)) bit (36),
       2 cross_proc_bj	        dim (dm_system_data_$bj_max_n_processes refer
			        (bj_check_in_table.max_n_processes),
			        dm_system_data_$bj_max_n_journals refer (bj_check_in_table.max_n_journals))
			        bit (1) unaligned;

/* END INCLUDE FILE:	dm_bj_check_in_table.incl.pl1	*/
