/* BEGIN INCLUDE FILE dm_bj_global_error_info.incl.pl1 */

/* Originally found in before journal primitives written by */
/* A. Bensoussan.  Gathered into an include file for ease of use. */
/* See the bjm_data_.alm source for details of use. */

/* HISTORY:
Written by Mike Pandolf, 07/14/82.
Modified:
12/06/83 by L. A. Newcomb:  Renamed before_journal_manager_static_ to
            bjm_data_ and moved some cells from dm_data_ to bjm_data_.
*/

/* format: style4,indattr,ifthenstmt,ifthen,^indcomtxt,idind33 */
dcl  bjm_data_$bj_operation	        char (32) external static;

dcl  bjm_data_$bj_exit_err	        label variable external;

dcl  bjm_data_$bj_code	        fixed bin (35) external;

dcl  bjm_data_$bj_default_error_label label external static;


/* END INCLUDE FILE dm_bj_global_error_info.incl.pl1 */
