/* BEGIN INCLUDE FILE - dm_fast_lock_alm_strucs.incl.pl1 */

%include dm_fast_lock_strucs;
%include dm_lock_list_strucs;

/* END INCLUDE FILE - dm_fast_lock_alm_strucs.incl.pl1 */
