/*  START OF:	dm_tm_ops.incl.pl1		*/

/* Transaction Manager operation codes */

/* Written 08/04/82 Steve Herbst */


dcl (DONE_OPERATION init (0),
     BEGIN_OPERATION init (1),
     COMMIT_OPERATION init (2),
     ABORT_OPERATION init (3),
     ROLLBACK_OPERATION init (4),
     ADJUST_OPERATION init (5)) fixed bin int static options (constant);


/*  END OF:	dm_tm_ops.incl.pl1		*/
