/*  START OF:	dump_segment_format.incl.pl1		  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */

/* Describes the output format understood by the dump_segment_ and
   dump_segment_$return_string subroutines. */

/* Created: 10/25/83 by C Spitzer */

dcl dump_segment_format bit (36) based (addr (dump_segment_format_structure));

dcl 1 dump_segment_format_structure aligned,		/* if = "1"b, then */
      2 address bit (1) unaligned,			/* display address part */
      2 offset bit (1) unaligned,			/* display offset part */
      2 short bit (1) unaligned,			/* format display to have 4 words per line */
      2 bcd bit (1) unaligned,			/* interpret data as BCD */
      2 ascii bit (1) unaligned,			/* interpret data as ASCII */
      2 long bit (1) unaligned,			/* format display to have 8 words per line */
      2 ebcdic9 bit (1) unaligned,			/* interpret data as EBCDIC (9 bits) */
      2 ebcdic8 bit (1) unaligned,			/* interpret data as EBCDIC (8 bits) */
      2 bit4 bit (1) unaligned,			/* interpret data as 4 bit data */
      2 hex8 bit (1) unaligned,			/* raw data is hexadecimal (8 bit) */
      2 hex9 bit (1) unaligned,			/* raw data is hexadecimal (9 bit) */

/* Beginning of MR11 understood items */

      2 octal bit (1) unaligned,			/* raw data is octal */
      2 header bit (1) unaligned,			/* display header */
      2 raw_data bit (1) unaligned,			/* display raw data */
      2 interpreted_data bit (1) unaligned,		/* display interpreted data */
      2 suppress_duplicates bit (1) unaligned,		/* replace duplicate lines with equal signs */
      2 command_output bit (1) unaligned,		/* if returning output, return in command-type output format */
      2 mbz bit (19) unaligned;			/* future expansion */

/*  END OF:	dump_segment_format.incl.pl1		  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
