/* BEGIN INCLUDE FILE ... encoded_precision.incl.pl1

   This is the format used by assign_ to encode the precision and scale of
   arithmetic data into one word.  This structure should be assigned (use unspec)
   to a fixed bin (35).
*/

dcl 1 encoded_precision based aligned,
      2 scale fixed bin (17) unal,
      2 prec fixed bin (18) unsigned unal;

/* END INCLUDE FILE ... encoded_precision.incl.pl1 */
