
/* Last modified by EBush on 2/5/81 to add prnta */


 declare 1 eb_data_$erflgs ext aligned,
          2 flgvec (36) fixed bin  (17) aligned ;
  
  
  declare 1 eb_data_$erflgs_overlay ext aligned,	/* overlays the FLGVEC */
          2 (prnte, prntf, prntm, prntn, prnto, prntp,
  	 prntr, prnts, prntt, prntu, prntx, prntb,
  	 prntc, prntd, prnta, prnt5, prnt6, prnt7,
  	 tstsw(18)	) fixed bin (17) aligned ;
  
  
   