/* BEGIN INCLUDE FILE ... eurc_model_numbers.incl.pl1 ... 11/13/81 E. N. Kittlitz */

dcl  eurc_model_numbers (4) fixed bin internal static init (8001, 8002, 8003, 8004);

/* END INCLUDE FILE ... eurc_model_numbers.incl.pl1 ... */
