
/* BEGIN INCLUDE FILE ... exponent_control_info.incl.pl1 */

/* Created by Benson I. Margulies 2-80 */

declare Default_exponent_control_overflow_value float bin (63) aligned
          internal static options (constant) init
	(0.111111111111111111111111111111111111111111111111111111111111111e+127b);

declare Default_hex_exponent_control_overflow_value float bin (63) aligned
	internal static options (constant) init
	(0.111111111111111111111111111111111111111111111111111111111111111e+127b);

/* END INCLUDE FILE ... exponent_control_info.incl.pl1 */

