
/*   BEGIN INCLUDE FILE fm.incl.pl1     4/08/75     B. Greenberg, for NSS */

/* This ffle defines the format of a file map as it appears in a VTOC */

dcl  fmp ptr;

dcl  1 file_map aligned based (fmp),			/* Outer level file map structure */
       2 fm (0 : 255) bit (18) unaligned;		/* Address components of file map */

/*   END INCLUDE FILE fm.incl.pl1 */
