/* Begin include file ...... fs_dev_types.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(85-09-09,Farley), approve(85-09-09,MCR6979),
     audit(86-01-17,CLJones), install(86-03-21,MR12.0-1033):
     Add support for FIPS
     3380.
  2) change(86-04-21,Fawcett), approve(86-04-21,MCR7383),
     audit(86-05-15,Coppola), install(86-07-18,MR12.0-1098):
     Add the support for subvolumes for the MSU3380 and MSU3390.
  3) change(86-10-02,Fawcett), approve(86-10-02,PBF7383),
     audit(86-10-23,Farley), install(86-10-28,MR12.0-1200):
     Changed 3390 to 3381, "d338" to "3380" & "d339" to "3381".
                                                   END HISTORY COMMENTS */

/* Modified 5/19/76 by N. I. Morris */
/* Modified 12/27/78 by Michael R. Jordan to correct MSS0500 information */
/* Modified 4/79 by R.J.C. Kissel to add msu0501 information. */
/* Modified '82 by BIM for needs_alt_part */
/* Modified 4/84 by Chris Jones for FIPS disks */
/* Modified 12/84 by Paul Farley for FIPS disks formatted for 512wd sectors */
/* Modified 1/85 by Paul Farley to decrease the size of the 3380, until the
   volmap and record stock can be expanded. */

/*
*******************************************************************************
*							        *
*                           WARNING:                                          *
*							        *
*   There exists fs_dev_types.incl.alm that must me updated when a new device *
*   type is added.						        *
*							        *
*   There are other include files that contain arrays indexed by the device   *
*   index obtained by references to MODELX or MODELN in this include file.    *
*   These must be modified when a new device type is added:		        *
*   disk_pack.incl.pl1					        *
*   fs_dev_types_sector.incl.pl1 (included in this include)		        *
*							        *
*******************************************************************************
*/


dcl (maxdevt init (9),				/* maximum legal devt */
     bulkdevt init (1),				/* bulk store devt */
     msu0500devt init (2),				/* MSU0500 device type */
     msu0451devt init (3),				/* MSU0451 device type */
     msu0450devt init (3),				/* MSU0450 device type */
     msu0400devt init (4),				/* MSU0400 device type */
     dsu191devt init (4),				/* DSU191 device type */
     dsu190devt init (5),				/* DSU190 device type */
     dsu181devt init (6),				/* DSU181 device type */
     msu0501devt init (7),				/* MSU0501 device type */
     fips3380devt init (8),				/* 3380D FIPS device type */
     fips3381devt init (9)				/* 3380E FIPS device type */
     ) fixed bin (4) static options (constant);

dcl  MODEL (12) fixed bin static options (constant) init	/* Known device model numbers */
     (0, 500, 451, 450, 400, 402, 191, 190, 181, 501, 3380, 3381);

dcl  MODELX (12) fixed bin static options (constant) init	/* translation from model number to device type */
     (1, 2, 3, 3, 4, 4, 4, 5, 6, 7, 8, 9);

dcl  MODELN (9) fixed bin static options (constant) init	/* translation from device type to model number */
     (0, 500, 451, 400, 190, 181, 501, 3380, 3381);

dcl  device_names (9) char (4) aligned static options (constant) init /* device names indexed by device type */
     ("bulk", "d500", "d451", "d400", "d190", "d181", "d501", "3380", "3381");

dcl  first_dev_number (9) fixed bin (17) static options (constant) init /* First valid device_number */
     (1, 1, 1, 1, 1, 1, 1, 0, 0);

dcl  fips_type_disk (9) bit (1) unal static options (constant) init /* ON => FIPS disk */
     ("0"b,"0"b,"0"b,"0"b,"0"b,"0"b,"0"b,"1"b,"1"b);

dcl  media_removable (9) bit (1) static options (constant) init /* ON => demountable pack on device */
     ("0"b, "0"b, "1"b, "1"b, "1"b, "1"b, "0"b, "0"b, "0"b);

dcl  shared_spindle (9) bit (1) static options (constant) init /* ON => 2 devices per spindle */
     ("0"b, "1"b, "0"b, "0"b, "0"b, "0"b, "1"b, "0"b, "0"b);

dcl  needs_alt_part (9) bit (1) static options (constant) init /* ON => needs alternate partition to run alternate tracks */
     ("0"b, "0"b, "1"b, "1"b, "1"b, "1"b, "0"b, "0"b, "0"b);

dcl  seek_command (9) bit (6) init /* Seek command: 00 => N/A, 30 => Seek_512, 34 => seek_64 */
     ("00"b3,"34"b3,"34"b3,"34"b3,"34"b3,"34"b3,"34"b3,"30"b3, "30"b3);

dcl  rec_per_dev (9) fixed bin (21) static options (constant) init /* table of # of records on each device */
     (0, 38258, 38258, 19270, 14760, 4444, 67200, 112395, 224790);

dcl  rec_per_sv (9) fixed bin static options (constant) init /* table of  # of records on each subvol */
     (0, 38258, 38258, 19270, 14760, 4444, 67200, 56134, 74930);

dcl  number_of_sv (9) fixed bin static options (constant) init /* table of subvolumes */
     (0, 0, 0, 0, 0, 0, 0, 2, 3);

dcl  valid_sv_string char (3) static options (constant) init  /* string of valid subvolume names */
     ("abc");

dcl  valid_sv_array (0:2) char (1) static options (constant) /* array of valid subvolume names */
     init ("a","b","c");

dcl  cyl_per_dev (9) fixed bin static options (constant) init /* table of # of cylinders on each device */
     (0, 814, 814, 410, 410, 202, 840, 885, 1770);

dcl  cyl_per_sv (9) fixed bin static options (constant) init /* table of # of cylinders on each subvolume */
     (0, 814, 814, 410, 410, 202, 840, 442, 590);

dcl  rec_per_cyl (9) fixed bin static options (constant) init /* table of # of records per cylinder on each device */
     (0, 47, 47, 47, 36, 22, 80, 127, 127);

dcl  tracks_per_cyl (9) fixed bin static options (constant) init /* table of # of tracks per cylinder on each device */
     (0, 19, 19, 19, 19, 20, 20, 15, 15);


dcl  first_rec_num (9) fixed bin static options (constant) init /* table of # of first record on each device */
     (0, 0, 0, 0, 0, 0, 0, 0, 0);

dcl  last_rec_num (9) fixed bin (18) static options (constant) init /* table of # of last record on each device */
     (0, 38257, 38116, 19128, 14651, 4399, 67199, 112394, 224789);

dcl  last_sv_rec_num (9) fixed bin (18) static options (constant) init /* table of # of last record on each subvolume */
     (0, 38257, 38116, 19128, 14651, 4399, 67199, 56133, 74929);

dcl  first_sect_num (9) fixed bin (24) static options (constant) init /* table of # of first sector for each device */
     (0, 0, 0, 0, 0, 0, 0, 0, 0);

dcl  last_sect_num (9) fixed bin (24) static options (constant) init /* table of # last sector number for each device */
     (0, 618639, 616359, 309319, 239722, 71999, 1075199, 225674, 451349);

dcl  first_alt_sect_num (9) fixed bin (24) static options (constant) init /* table of # of first sector of alt partition */
     (0, 638400, 616360, 309320, 239723, 72000, 1075200, 225675, 451350);

dcl  last_alt_sect_num (9) fixed bin (24) static options (constant) init /* table of # of last sector of alt partition */
     (0, 639919, 618639, 311599, 241489, 72719, 1077759, 225930, 451605);

dcl  last_physical_sect_num (9) fixed bin (24) static options (constant) init /* table of # of last sector on device (includes T&D cylinders) */
     (0, 639919, 619399, 312359, 242249, 72359, 1077759, 225674, 451859);

dcl  dev_time (9) float bin (27) static options (constant) init /* table of average access times for each device */
     (384e0, 33187e0, 33187e0, 34722e0, 46935e0, 52631e0, 33187e0, 26260e0, 26260e0);

%include fs_dev_types_sector;

/* End of include file ...... fs_dev_types.incl.pl1 */
