/* BEGIN INCLUDE FILE ...... fsmap ...... last modified Oct 75 for nss */

dcl  mapp ptr;					/* ptr to free storage map */

dcl 1 fsmap based (mapp) aligned,			/* free storage data */
    2 table (512) bit (36) unaligned;			/* bit table, only left 32 bits used */

/* END OF INCLUDE FILE ...... fsmap ...... */
