/* BEGIN INCLUDE FILE gcos_fibs.incl.pl1   (Wardd Multics)  09/13/81 1739.2 mst Sun */
dcl 1 fibs_control		aligned based(gcos_ext_stat_$temp_seg_ptr)

/* Structure to save released fibs in.
*/
,     2 released_fibs
,       3 nrf		fixed bin		/* Number of released fibs. */
,       3 released_fib	(500) like fib	/* Copy of released fib. */

/* Buffers. */
,     2 fib_buffers
,       3 buffer_in_use	(500)bit(1)unal	/* "1"b => in use. */
,       3 buffer		(500)bit(320*36)	/* Space for buffer. */
;

/*   END INCLUDE FILE gcos_fibs.incl.pl1 */
