/* BEGIN gcos_abs_data_storage include file */

dcl  1 gcos_abs_data like abs_data;			/* storage for absentee data */

/* END gcos_abs_data_storage include file */
