/*     BEGIN INCLUDE FILE gcos_user_table_entry_.incl.pl1     November 1974     RHM     */

dcl  gutep ptr,					/* pointer to origin of based entry */

     1 gcos_user_table_entry_ based,
     2 gute_status fixed bin,				/* 0 => inactive, 1 => active */
     2 gute_filler_1 fixed bin,
     2 gute_gcos_account_id char (12),			/* probably 8 or fewer chars */
     2 gute_multics_person char (22),
     2 gute_multics_project char (9),
     2 gute_ctl,
     3 gute_ctl_filler (18) fixed bin;

/* END INCLUDE FILE...gcos_user_table_entry_.incl.pl1 */
