/*     BEGIN INCLUDE FILE gcos_file_info_block_.incl.pl1   DAK - APRIL 74    */

/* 	Declaration of File Information Block (fib)

   Change: Mel Wilson	11/01/79 for gtss compatibility
   Change: Dave Ward	05/20/81 *_file constants.
   Change: Dave Ward	05/29/81 separated fct structures.
   Change: Dave Ward	09/02/81 provision for tape density 6250, dens_hist 2 bits (not 3).
*/
dcl 1 fib aligned based (fibptr)			/* fib structure */

,     2 buffer	ptr aligned			/* pointer to current buffer (gcos_write_) */
,     2 buffer_indx	fixed bin			/* Index to buffer in use. */
,     2 stream	char(8)unal			/* stream name for attaching this file */
,     2 pathnm	char(168)unal			/* pathname (for disk, print or punch files) */
,     2 unique_file_id bit(36)				/* multics unique segment id for file */
,     2 indicators					/* five words of flags */

,       3 indicators_word_1
,         4 used	bit(1) unal			/* 1=fib used, 0=fib used */
,         4 attached	bit(1) unal			/* 1=stream is attached */
,         4 type	bit(1) unal			/* 1=random, 0=linked */
,         4 perm	bit(1) unal			/* 1=permanent file, 0=not */
,         4 print	bit(1) unal			/* 1=file type is printer */
,         4 punch	bit(1) unal			/* 1=file type is punch */
,         4 reader	bit(1) unal			/* 1=file type is card reader */
,         4 tape	bit(1) unal			/* 1=file type is tape */
,         4 console	bit(1) unal			/* 1=file type is console typewriter */
,         4 read	bit(1) unal			/* 1=read access permitted */
,         4 write	bit(1) unal			/* 1=write access permitted */
,         4 null	bit(1) unal			/* 1=file is null */
,         4 purge	bit(1) unal			/* 1=purge file at time on release */
,         4 gein	bit(1) unal			/* 1 = this file contains data cards from the job deck */
,         4 disp	bit(2) unal			/* disposition code:
						   00 = dismount
						   01 = release
						   10 = save
						   11 = continue	 */
,         4 adisp	bit(2) unal			/* abort disp - same codes as disp */
,         4 order	bit(1) unal			/* 1 = write, 0 = read or other */
,         4 mode	bit(2) unal			/* tape i/o mode 
						   00 = binary
						   01 = decimal
						   10 = nine	*/
,         4 tracks	bit(2) unal			/* tape request code:
						   00 = installation default
						   01 = 7 track
						   10 = 9 track	*/
,         4 density	bit(4) unal			/* tape density from $ TAPE card
						   0000 = site standard high
						   0001 = 200 bpi
						   0010 = 556 bpi
						   0100 = 800 bpi
						   1001 = 1600 bpi
						   1100 = 6250 bpi
						   1111 = handler capable of any appropriate denisty */
,         4 dens_hist	bit(2) unal			/* density history for MME GEFADD */
,         4 forced_acl_flag bit(1) unal 			/* 1 => acl forced for gtss file (2.4) */
,         4 fill	bit(6) unal			/* reserved for future use */
,       3 indicators_word_2
,         4 plud	bit(18) unal			/* primary log unit designator */
						/* bcd channel and channel number */

,         4 slud	bit(18) unal			/* secondary log. unit designator */
						/* bcd channel and channel number */
,       3 indicators_word_3
,         4 serial_no	bit(30) unal			/* tape serial number */
,         4 pad	bit( 6) unal			/* unused */
,       3 indicators_word_4
,         4 tape_name	bit(72) unal			/* tape name */

,     2 current	fixed bin(21)			/* current file position */
,     2 last	fixed bin(21)			/* eof for sequential disk files */
,     2 size	fixed bin(24)			/* offset of end of file in words */
,     2 init_size	fixed bin(24)			/* file size at start of activity */
,     2 init_posit	fixed bin(24)			/* file position at start of activity */
,     2 iocount	fixed bin(35)			/* total no. of i/o operations */
,     2 rec_len	fixed bin(24)			/* length of current record (gcos_write_) */
,     2 command_count	fixed bin(17) unal		/* size of command table for device (gcos_mme_inos_) */
,     2 command_index	fixed bin(17) unal		/* pointer to command table entry (gcos_mme_inos_) */
,     2 error_retry	fixed bin(17) unal		/* error retry counter */
,     2 seq_no	fixed bin(17) unal		/* tape reel sequence no */
;
dcl  fibptr                   ptr			/* pointer to current fib in gcos_ext_stat_ */;

/* File usage classification constants: */
dcl  linked_file              bit(1)static int options(constant)init("0"b);
dcl  random_file              bit(1)static int options(constant)init("1"b);
dcl  read_file                bit(1)static int options(constant)init("0"b);
dcl  write_file               bit(1)static int options(constant)init("1"b);

/*     END INCLUDE FILE gcos_file_info_block_.incl.pl1     */
