/*     BEGIN INCLUDE FILE gcos_xlate_bcd_ascii_.incl.pl1  5/19/76/  RHM     */

/* Change: Dave Ward	05/20/81 options constant.
*/

dcl  xlate (0: 63) char(1) int static options(constant) init(		/* bcd to ascii xlation table */

     "0","1","2","3","4","5","6","7","8","9","[","#","@",":",">","?",

     " ","a","b","c","d","e","f","g","h","i","&",".","]","(","<","\",

     "^","j","k","l","m","n","o","p","q","r","-","$","*",")",";","'",

     "+","/","s","t","u","v","w","x","y","z","_",",","%","=","""","!" );

/*     END INCLUDE FILE gcos_xlate_bcd_ascii_.incl.pl1     */
