/* BEGIN INCLUDE FILE...gcos_user_table_.incl.pl1 */

%include gcos_user_table_hdr_;
%include gcos_user_table_entry_;

/* END INCLUDE FILE...gcos_user_table_.incl.pl1 */
