/* --------------- BEGIN include file ge_token_types.incl.pl1 --------------- */

dcl (Illegal initial (-2),
     Undefined initial (-1),
     Name initial (1),
     Break initial (2),
     Number initial (3)) fixed bin static;

/* ---------------- END include file ge_token_types.incl.pl1 ---------------- */
