/* BEGIN INCLUDE FILE gfms_tape_densities.incl.pl1   (Wardd Multics)  10/18/80 1059.7 mst Sat */
dcl  tape_densities           (5)char(5)static int options(constant)init("6250","1600","800","556","200");

/*   END INCLUDE FILE gfms_tape_densities.incl.pl1 */
