/* BEGIN INCLUDE FILE ... gm_data.incl.pl1 ... 31 July 1981 ... WOS */
/* Assorted data and structures used by the generate_mst subsystem */

dcl  NORMAL_SEG		init (1) fixed bin internal static options (constant);
dcl  WHOLE_OBJECT_SEG	init (2) fixed bin internal static options (constant);
dcl  TEXT_ONLY_SEG		init (3) fixed bin internal static options (constant);
dcl  FABRICATED_SEG 	init (4) fixed bin internal static options (constant);
dcl  DATA_SEG		init (5) fixed bin internal static options (constant);
dcl  FIRST_SEG		init (6) fixed bin internal static options (constant);
dcl  BOOT_PROGRAM_SEG	init (7) fixed bin internal static options (constant);

/* END INCLUDE FILE ... gm_data.incl.pl1 */
