/* --------------- BEGIN include file graphic_enames.incl.pl1 --------------- */

dcl  Element_names (-2:33) char (16) static options (constant) initial
    ("illegal type", "null", "setposition", "setpoint", "vector", "shift", "point", (3) (1) "undefined",
     "scaling", "rotation", "clipping", (5) (1) "undefined",
     "intensity", "linetype", "sensitivity", "blink", "color", (3) (1) "undefined",
     "symbol", "text", "datablock", (5) (1) "undefined",
     "list", "array");

dcl  Intensity_names (0:7) char (8) static options (constant) initial
    ("off", "1", "2", "3", "4", "5", "6", "full");

dcl  Linetype_names (0:4) char (12) static options (constant) initial
    ("solid", "dashed", "dotted", "dash_dotted", "long_dashed");

dcl  Sensitivity_names (0:1) char (12) static options (constant) initial
    ("insensitive", "sensitive");

dcl  Blink_names (0:1) char (8) static options (constant) initial
   ("steady", "blinking");

dcl  Text_alignments (9) char (16) static options (constant) initial
    ("upper_left", "upper_center", "upper_right",
     "left", "center", "right",
     "lower_left", "lower_center", "lower_right");

dcl  Input_device_names (0:63) char (16) static options (constant) initial
    ("terminal_program", "keyboard", "mouse", "joystick", "pen_tablet",
     "lightpen", "trackball", (56)(1)"undefined", "any");

/* ---------------- END include file graphic_enames.incl.pl1 ---------------- */
