/* BEGIN INCLUDE FILE gtss_tfa_ext_.incl.pl1 */
/*
  Created: (Wardd Multics)  08/07/78 0911.6 mst Mon 
*/

/* Structure to record file "attributes".
   Note: gtss_dfd_ext_$disk_file_data(i).gtss_disk.attributes_ptr
         locates gtss_tfa_ext_$file_attributes.temp_file(i).
*/

dcl 1 gtss_tfa_ext_$file_attributes	aligned ext,
      3 temp_file			(20) like  gtss_file_attributes;

%include gtss_file_attributes;

/*   END INCLUDE FILE gtss_tfa_ext_.incl.pl1 */
