/* ***********************************************************
   *                                                         *
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1981 *
   *                                                         *
   *                                                         *
   *********************************************************** */

/* BEGIN INCLUDE FILE gtss_install_values_ni.incl.pl1   (Wardd Multics)  09/03/78 2105.5 mst Sun */

/**	The same variables as those in gtss_install_values_.incl.pl1
	but without the initialization (Multics objects to
	$variables being initialized).
**/
dcl  gtss_install_values_$fast_dir     char(168)var ext;
dcl  gtss_install_values_$fast_msf     char(32)var ext;
dcl  gtss_install_values_$Lstar_dir    char(168)var ext;
dcl  gtss_install_values_$Lstar_msf    char(32)var ext;
dcl  gtss_install_values_$memory_limit fixed bin(24) ext;
dcl  gtss_install_values_$starL_dir    char(168)var ext;
dcl  gtss_install_values_$starL_msf    char(32)var ext;
dcl  gtss_install_values_$time_limit   fixed bin(24) ext;
/*   END INCLUDE FILE gtss_install_values_ni.incl.pl1 */
