/* BEGIN INCLUDE FILE gtss_filact_intp3.incl.pl1 */
/*
  Created: (Wardd Multics)  10/05/78 1601.4 mst Thu 
*/
get_faulty_cat_file_entry: proc returns (bit (18));

/**	Locate offset to catalog file description entry
	that caused search failure locating Multics entry.
**/
	     return (cat_filedescr_name_offset);
	end					/* get_faulty_cat_file_entry */;
/*   END INCLUDE FILE gtss_filact_intp3.incl.pl1 */
