/* BEGIN INCLUDE FILE gtss_CFP_bits.incl.pl1 */
/*
   Created:  (Dupuis Multics)  05/08/79 1031.7 mst Tue 
*/


dcl CFP_in_progress		bit (1) unaligned defined lflg2.b8;
dcl dele_on		bit (1) unaligned defined lflg2.b0;
dcl copy_on		bit (1) unaligned defined lflg2.b1;
dcl talk_on		bit (1) unaligned defined lflg2.b4;
dcl user_code		bit (1) unaligned defined lflg2.b14;
dcl trap_off		bit (1) unaligned defined lswt2.b5;
dcl break_flag		bit (1) unaligned defined lflg3.b31;


/*   END INCLUDE FILE gtss_CFP_bits.incl.pl1 */
