/* BEGIN INCLUDE FILE  gtss_filact_intp3x.incl.pl1 */
get_faulty_cat_file_entry: proc returns (fixed bin(18)unsigned unal);

/**	Locate offset to catalog file description entry
	that caused search failure locating Multics entry.
**/
	     return (cat_filedescr_name_offset);
	end					/* get_faulty_cat_file_entry */;

/*   END INCLUDE FILE  gtss_filact_intp3x.incl.pl1 */
