/* BEGIN INCLUDE FILE gtss_entry_dcls.incl.pl1 */
/*
  Created: (Wardd Multics)  06/30/78 1624.8 mst Fri 
  Modified: Ron Barstad  84-02-24  Fixed wrong and obsolete entries
*/

/**  gtss external entry variables.		**/
dcl  com_err_                                   entry() options(variable);
dcl  gtss_CFP_abort_                            entry options(variable);
dcl  gtss_CFP_break_                            entry options(variable);
dcl  gtss_CFP_input_                            entry (ptr, ptr, fixed bin(21), fixed bin(21), fixed bin(35));
dcl  gtss_CFP_output_                           entry (ptr, ptr, fixed bin(21), fixed bin(35));
dcl  gtss_abandon_CFP_                          entry options(variable);
dcl  gtss_abort_dump_                           entry (fixed bin(18));
dcl  gtss_abort_subsystem_                      entry options (variable);
dcl  gtss_abort_subsystem_$not_imp              entry (ptr, fixed bin(24));
dcl  gtss_abs_login_banner_		        entry() returns(char(*));
dcl  gtss_abs_logout_banner_		        entry() returns(char(*));
dcl  gtss_abs_$abs_equiv                        entry options(variable);
dcl  gtss_abs_$cpu_runout		        entry (ptr, char(4));
dcl  gtss_abs_$create_absin                     entry() returns(char(*));
dcl  gtss_abs_$dabt_check		        entry (ptr, char(4));
dcl  gtss_abs_$get_id                           entry (char(5)) returns(char(19));
dcl  gtss_abs_$get_drm                          entry() returns(char(*));
dcl  gtss_adjust_size_                          entry (ptr);
dcl  gtss_aft_$add                              entry (char(8), fixed bin(24), fixed bin(35));
dcl  gtss_aft_$delete                           entry (char(8), fixed bin(24), fixed bin(35));
dcl  gtss_aft_$find                             entry (char(8), fixed bin(24), fixed bin(35));
dcl  gtss_aft_$initialize                       entry (fixed bin(35));
dcl  gtss_ascii_bcd_                            entry (ptr, fixed bin, ptr);
dcl  gtss_attributes_mgr_$get                   entry (ptr, fixed bin(35));
dcl  gtss_attributes_mgr_$set                   entry (ptr, fixed bin(35));
dcl  gtss_bcd_ascii_                            entry (ptr, fixed bin(24), ptr);
dcl  gtss_bcd_ascii_$lc                         entry (ptr, fixed bin(24), ptr);
dcl  gtss_break_vector_                         entry ();
dcl  gtss_break_vector_$drl_in_progress         entry() returns(bit(1));
dcl  gtss_break_vector_$status                  entry() returns(bit(1));
dcl  gtss_build_                                entry options(variable);
dcl  gtss_com_err_                              entry options(variable);
dcl  gtss_derail_processor_                     entry (ptr, char(*), ptr, ptr, bit(1) aligned) /* called at fault time instead of signal_ */;
dcl  gtss_derail_processor_$set                 entry options(variable);
dcl  gtss_dq_$catp                              entry (char (5), ptr, fixed bin (18) unsigned);
dcl  gtss_dq_$create                            entry (bit(1));
dcl  gtss_dq_$dibp                              entry (char(5), ptr);
dcl  gtss_dq_$entries_info		        entry (ptr, fixed bin (18) unsigned, fixed bin (18) unsigned);
dcl  gtss_dq_$hdrp                              entry (ptr);
dcl  gtss_dq_$mod_js		        entry (char(5), fixed bin (6) unsigned, bit (1));
dcl  gtss_dq_$open_exc		        entry (bit(1));
dcl  gtss_dq_$open_gen		        entry (bit(1));
dcl  gtss_drl_abort_                            entry (ptr, fixed bin);
dcl  gtss_drl_addmem_                           entry (ptr, fixed bin);
dcl  gtss_drl_callss_                           entry (ptr, fixed bin);
dcl  gtss_drl_corfil_                           entry (ptr, fixed bin);
dcl  gtss_drl_defil_                            entry (ptr, fixed bin);
dcl  gtss_drl_defil_$subr                       entry (ptr, ptr, ptr);
dcl  gtss_drl_dio_                              entry (ptr, fixed bin);
dcl  gtss_drl_drlimt_                           entry (ptr, fixed bin);
dcl  gtss_drl_drlsav_                           entry (ptr, fixed bin);
dcl  gtss_drl_filact_                           entry (ptr, fixed bin);
dcl  gtss_drl_filsp_                            entry (ptr, fixed bin);
dcl  gtss_drl_grow_                             entry (ptr, fixed bin);
dcl  gtss_drl_gwake_                            entry (ptr, fixed bin);
dcl  gtss_drl_jsts_                             entry (ptr, fixed bin);
dcl  gtss_drl_kin_                              entry (ptr, fixed bin);
dcl  gtss_drl_kotnow_                           entry (ptr, fixed bin);
dcl  gtss_drl_kotnow_$gtss_drl_kout_            entry (ptr, fixed bin);
dcl  gtss_drl_koutn_                            entry (ptr, fixed bin);
dcl  gtss_drl_morlnk_                           entry (ptr, fixed bin);
dcl  gtss_drl_msub_                             entry (ptr, fixed bin);
dcl  gtss_drl_objtim_                           entry (ptr, fixed bin);
dcl  gtss_drl_part_                             entry (ptr, fixed bin);
dcl  gtss_drl_pasaft_                           entry (ptr, fixed bin);
dcl  gtss_drl_pasdes_                           entry (ptr, fixed bin);
dcl  gtss_drl_pasust_                           entry (ptr, fixed bin);
dcl  gtss_drl_pdio_                             entry (ptr, fixed bin);
dcl  gtss_drl_prgdes_                           entry (ptr, fixed bin);
dcl  gtss_drl_pseudo_                           entry (ptr, fixed bin);
dcl  gtss_drl_relmem_                           entry (ptr, fixed bin);
dcl  gtss_drl_restor_                           entry (ptr, fixed bin);
dcl  gtss_drl_retfil_                           entry (ptr, fixed bin);
dcl  gtss_drl_return_                           entry (ptr, fixed bin);
dcl  gtss_drl_rew_                              entry (ptr, fixed bin);
dcl  gtss_drl_rstswh_                           entry (ptr, fixed bin);
dcl  gtss_drl_setlno_                           entry (ptr, fixed bin);
dcl  gtss_drl_setswh_                           entry (ptr, fixed bin);
dcl  gtss_drl_snumb_                            entry (ptr, fixed bin);
dcl  gtss_drl_spawn_                            entry (ptr, fixed bin);
dcl  gtss_drl_spawn_$gtss_drl_pasflr_           entry (ptr, fixed bin);
dcl  gtss_drl_stoppt_                           entry (ptr, fixed bin);
dcl  gtss_drl_switch_                           entry (ptr, fixed bin);
dcl  gtss_drl_sysret_                           entry (ptr, fixed bin);
dcl  gtss_drl_t_cfio_                           entry (ptr, fixed bin);
dcl  gtss_drl_t_cmov_                           entry (ptr, fixed bin);
dcl  gtss_drl_t_err_                            entry (ptr, fixed bin);
dcl  gtss_drl_t_goto_                           entry (ptr, fixed bin);
dcl  gtss_drl_t_linl_                           entry (ptr, fixed bin);
dcl  gtss_drl_t_rscc_                           entry (ptr, fixed bin);
dcl  gtss_drl_tapein_                           entry (ptr, fixed bin);
dcl  gtss_drl_task_                             entry (ptr, fixed bin);
dcl  gtss_drl_termtp_                           entry (ptr, fixed bin);
dcl  gtss_drl_time_                             entry (ptr, fixed bin);
dcl  gtss_drun_                                 entry (bit(1));
dcl  gtss_dsd_lookup_                           entry (char(8) var) returns(fixed bin(24));
dcl  gtss_dsd_process_                          entry (ptr, ptr, fixed bin(21), fixed bin(21), fixed bin(35));
dcl  gtss_edit_dsd_                             entry (ptr, fixed bin(21)) returns(fixed bin(24));
dcl  gtss_mcfc_empty                            entry (char(*) var);
dcl  gtss_expand_pathname_                      entry (ptr, char(*), char(*), fixed bin(35));
dcl  gtss_expand_pathname_$verify_umc           entry (ptr, char(*), char(*), bit(18), fixed bin(35));
dcl  gtss_fault_processor_                      entry options(variable);
dcl  gtss_find_cond_frame_		        entry (char(32) var) returns(ptr);
dcl  gtss_fault_processor_$timer_runout         entry (ptr, char(*));
dcl  gtss_filact_error_status_                  entry (fixed bin(35))returns(bit(12));
dcl  gtss_filact_funct02_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct03_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct04_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct05_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct08_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct10_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct11_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct14_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct18_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct19_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct21_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_filact_funct22_                       entry (ptr, bit(18), ptr, ptr, ptr, fixed bin(35));
dcl  gtss_mcfc_init_                            entry (char(*) var);
dcl  gtss_interp_prim_                          entry options(variable);
dcl  gtss_interp_prim_$callss                   entry (char(4), ptr);
dcl  gtss_interp_prim_$sysret                   entry options(variable);
dcl  gtss_interp_prim_$t_goto                   entry (char(4));
dcl  gtss_ios_change_size_                      entry (fixed bin(24), fixed bin(24), bit(1), fixed bin(24), fixed bin(35));
dcl  gtss_ios_close_                            entry (fixed bin(24), ptr, fixed bin(35));
dcl  gtss_ios_exchange_names_                   entry (fixed bin(24), fixed bin(24), fixed bin(24), fixed bin(35));
dcl  gtss_ios_initialize_                       entry options(variable);
dcl  gtss_ios_io_                               entry (fixed bin(24), ptr, ptr, fixed bin(24), fixed bin(24), fixed bin(35));
dcl  gtss_ios_open_                             entry (fixed bin(24), char(168), char(32), bit(6), bit(1), ptr, ptr, fixed bin(35));
dcl  gtss_ios_position_                         entry (fixed bin(24), fixed bin(24), fixed bin(24), bit(6), ptr);
dcl  gtss_mcfc_$delete		        entry (fixed bin(24), char(*), char(*), bit(36) aligned, ptr, fixed bin(35));
dcl  gtss_mcfc_$open                            entry (char(*), char(*), bit(6), bit(36) aligned, ptr, fixed bin(35));
dcl  gtss_mcfc_$close                           entry (char(*), char(*), bit(36) aligned, ptr, fixed bin(35));
dcl  gtss_read_starCFP_                         entry (ptr, ptr, fixed bin(21), fixed bin(21), fixed bin(35));
dcl  gtss_read_starCFP_$last_os                 entry (ptr, ptr, fixed bin(21), fixed bin(21), fixed bin(35));
dcl  gtss_run_subsystem_                        entry (fixed bin(24));
dcl  gtss_run_subsystem_$finish                 entry options(variable);
dcl  gtss_run_subsystem_$restor                 entry (fixed bin(24), ptr);
dcl  gtss_run_subsystem_$restor_perm            entry (fixed bin(24), ptr, fixed bin(18));
dcl  gtss_set_slave_                            entry (fixed bin (24), ptr);
dcl  gtss_set_slave_$load_bar                   entry (fixed bin (17));
dcl  gtss_update_safe_store_                    entry (ptr);
dcl  gtss_verify_access_		        entry (char(*), char(*), fixed bin(24), bit(6), bit(12) aligned);
dcl  gtss_verify_access_$check_forced_access    entry (char(*), char(*), fixed bin(24));
dcl  gtss_write_starCFP_                        entry (ptr, ptr, fixed bin(21), fixed bin(35));
/*   END INCLUDE FILE gtss_entry_dcls.incl.pl1 */
