/* BEGIN INCLUDE FILE gtss_filact18_args.incl.pl1 */
/*
  Created: (Wardd Multics)  11/08/78 1747.5 mst Wed 
*/

dcl 1 Get_Current_args	aligned based(arg_ptr)
,     3 word1
,       4 zero		bit(18)unal
,       4 L_arglist		bit(18)unal
,     3 word2
,       4 Get_Current_function_no	fixed bin(17)unal
,       4 L_buffer		bit(18)unal
;

dcl 1 Get_Current_arglist	aligned based(arglist_ptr)
,     3 word1
,       4 L_status_return	bit(18)unal
,       4 L_record		bit(18)unal
,     3 word2
,       4 L_cat_filedescr	bit(18)unal
,       4 device_name	bit(18)unal
;

/*   END INCLUDE FILE gtss_filact18_args.incl.pl1 */
