/*     BEGIN INCLUDE FILE gut_error_table_.incl.pl1     November 1974     RHM     */

dcl  gut_et_count fixed bin (35) init (10);

dcl  gut_et (10) char (32) init
    ("gcos_account_id not in table",
     "",
     "gcos_user_table_ destroyed",
     "gu table full. Entry not added",
     "gcos_account_id already in table",
     "gcos_user_table_ not found",
     "gcos_user_table_ is empty",
     "gcos_user_table_ has zero bitct",
     "gcos_account_id/index disagree",
     "Table bitct > 0. Can't init");

/* END INCLUDE FILE...gut_error_table_.incl.pl1 */
