/* BEGIN INCLUDE FILE ... hcom_field_names.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(85-09-20,LJAdams), approve(85-11-06,MCR7278),
     audit(86-02-19,Gilcrease), install(86-02-19,MR12.0-1021):
     Created September 1985.
                                                   END HISTORY COMMENTS */

declare   AUTHOR_FIELD_NAME char (24) varying internal static options (constant) init ("author");
declare   APPROVAL_FIELD_NAME char (24) varying internal static options (constant) init ("approval");
declare   AUDIT_FIELD_NAME char (24) varying internal static options (constant) init ("audit");
declare   INSTALL_FIELD_NAME char (24) varying internal static options (constant) init ("install");

/* END INCLUDE FILE ... hcom_field_names.incl.pl1 */
