/* begin heals_message.incl.pl1 */
/* Produced March 1976 by A. Downing. */
dcl 1 heals_message based (heals_message_p) aligned,
    2 tally fixed bin (35),
    2 rest_of_record aligned,
      3 seq_num fixed bin (35),			/* Sequence number of this message. */
      3 time fixed bin (71) unal,			/* Time message logged at */
      3 code fixed bin (11) unal,			/* Syserr code associated with this message. */
      3 text_len fixed bin (11) unal,			/* Length of message text in ASCII characters. */
      3 data_size fixed bin (11) unal,			/* Size of binary data */
      3 data_code fixed bin (11) unal,			/* format type code */
      3 pad bit (60) unal,
      3 text char (0 refer (heals_message.text_len)),	/* Text of expanded message - kept in ASCII. */
      3 data (0 refer (heals_message.data_size)) bit (36);	/* Binary data area */
dcl  heals_message_p ptr;
						/* end heals_message.incl.pl1 */
