/* begin heals_state.incl.pl1 */
/* Produced March 1976 by A. Downing. */

dcl 1 heals_state aligned based (heals_state_p),
    2 last_message_time fixed bin (71),
    2 last_message_seq_num fixed bin (35),
    2 busy bit (36) aligned;
dcl  heals_state_p ptr;
dcl  heals_log_info$ ext static fixed bin (35) aligned dim (64000);
						/* end heals_state.incl.pl1 */
