/* Begin include file io_ptw.incl.pl1 */

dcl  io_ptwp ptr;
dcl  1 io_ptw aligned based (io_ptwp),
       2 pad1 bit (2) unaligned,
       2 address uns fixed bin (16) unaligned,
       2 pad2 bit (13) unaligned,
       2 write bit (1) unaligned,
       2 housekeeping bit (1) unaligned,
       2 valid bit (1) unaligned,
       2 pad3 bit (2) unaligned;

/* End include file io_ptw.incl.pl1 */
