/* Begin include file ...... io_special_status.incl.pl1 */
/* Written February 1981 by Chris Jones (from iom_stat.incl.pl1) */


/****^  HISTORY COMMENTS:
  1) change(88-01-06,Farley), approve(88-03-01,MCR7831),
     audit(88-03-01,Parisek), install(88-03-08,MR12.2-1032):
     Corrected channel size to 6 bits, was incorrectly set to 8.
                                                   END HISTORY COMMENTS */


dcl  io_special_status_ptr ptr;			/* pointer to status */

dcl  1 io_special_status based (io_special_status_ptr) aligned,
						/* special status from PSIA */
       (
       2 t bit (1),					/* entry present bit */
       2 pad bit (2),
       2 channel bit (6),				/* channel number */
       2 pad1 bit (3),
       2 device bit (6),				/* device address */
       2 pad2 bit (1),
       2 byte2 bit (8),				/* device dependent information */
       2 pad3 bit (1),
       2 byte3 bit (8)
       ) unal;					/* device dependent information */

/* End of include file io_special_status.incl.pl1 */
