/* BEGIN INCLUDE FILE ... iod_constants.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(88-08-31,Brunelle), approve(88-08-31,MCR7911),
     audit(88-09-29,Wallman), install(88-10-28,MR12.2-1199):
     Created.
                                                   END HISTORY COMMENTS */

/* This file contains constants used by the I/O Daemon software in various tables */

/* format: style4 */

/* literals for use with idte.attach_type & iodd_static.attach_type */
dcl  (ATTACH_TYPE_IOM init (1),
     ATTACH_TYPE_TTY init (2),
     ATTACH_TYPE_DIAL init (3),
     ATTACH_TYPE_VARIABLE_LINE init (4)) fixed bin int static options (constant);

/* literals for use with idte.ctl_attach_type & iodd_static.ctl_attach_type */
dcl  (CTL_ATTACH_TYPE_TTY init (1),
     CTL_ATTACH_TYPE_DIAL init (2),
     CTL_ATTACH_TYPE_MC init (3)) fixed bin int static options (constant);

/* literals for use with idte.paper_type & iodd_static.paper_type */
dcl  (PAPER_TYPE_DEFAULT init (-1),
     PAPER_TYPE_SINGLE init (1),
     PAPER_TYPE_CONTINUOUS init (2)) fixed bin int static options (constant);

/* END INCLUDE FILE ... iod_constants.incl.pl1 */
