/* BEGIN INCLUDE FILE ... iodc_data.incl.pl1 */

dcl 1 iodc_data based(iodc_data_ptr) aligned,
	2 init_event_channel fixed bin(71),	/* channel over which first driver wakeup is expected */
	2 proc_id bit(36);			/* coordinator's process id */


/* END INCLUDE FILE ... iodc_data.incl.pl1 */
