


	/* the include file for LABARG */

declare 1 eb_data_$labarg ext aligned,
        2 labarg fixed bin (26) aligned ;


	/* end of the include file labarg */

