/* Begin include file lap_line_control.incl.pl1 */
/* Written by C. Hornig, September 1979. */
/* Modified by R. Harvey, November 1980 for system parameterization */

/* Line Control Information */

dcl  1 LAP_ACTIVATE aligned,
       2 order_type bit (18) unaligned init ("000001"b3),	/* constant */
       2 flags unaligned,
         3 dce_mode bit (1) unaligned,			/* we are DCE */
         3 abm_mode bit (1) unaligned,			/* default to LAPB */ /* UNUSED */
         3 pad bit (16) unaligned,			/* reserved */
       2 pad bit (9) unaligned,			/* expansion */
       2 N2 uns fixed bin (9) unaligned,		/* maximum retry count */
       2 T1 uns fixed bin (9) unaligned,		/* retransmission timer */
       2 T3 uns fixed bin (9) unaligned;		/* init timer */
dcl  (
     LAP_DEACTIVATE init ("000002000000000000000000"b3),
     LAP_SETUP init ("000003000000000000000000"b3),
     LAP_DISCONNECT init ("000004000000000000000000"b3)
     ) bit (72) aligned static options (constant);

/* Line Status Information */

dcl  1 lap_line_status aligned,
       2 type unsigned fixed bin (18) unaligned,		/* status type, see below */
       2 seqnum unsigned fixed bin (18) unaligned,	/* sequence number */
       2 pad bit (36) unaligned;

dcl  (
     LAP_LINK_DOWN init (1),				/* remote disconnect or setup failed */
     LAP_LINK_UP init (2),				/* remote connect or setup succeeded */
     LAP_TIMER_RECOVERY init (3),			/* enter timer recovery mode */
     LAP_REJECT init (4),				/* start retranmitting frames */
     LAP_NORMAL init (5),				/* exit timer recovery mode */
     LAP_LINK_RESET init (6),				/* remote link reset */
     LAP_ACK init (7)				/* frame acknowledgement */
     ) unsigned fixed bin (18) static options (constant);

/* End include file lap_line_control.incl.pl1 */
