/* BEGIN INCLUDE FILE linus_ls_block.incl.pl1 -- jaw 8/7/78 */

dcl 1 ls_block aligned based (lsb_ptr),			/* lila stack frame for outer lila block */
%include linus_ls_common;
    2 reserved bit (36) unal,
    2 ib_level fixed bin,				/* current depth of inner blocks */
    2 nrs_chars fixed bin,				/* total chars. in range strings */
    2 nritems fixed bin,				/* current number of range items */
    2 range_items (linus_data_$max_range_items),
      3 tup_var char (32) var,			/* name of linus tuple variable */
      3 mrds_var char (32) var,			/* name of mrds tuple variable */
      3 rel_name char (32) var,			/* name of relation */
      3 rel_index fixed bin (35),			/* rel. index if temp tab */
      3 level fixed bin,				/* level of block generating item */
      3 arg_ptr ptr,
      3 desc_ptr ptr,
    2 nselects fixed bin,				/* number of select items currently defined */
    2 sel_items (mrds_data_$max_select_items) char (mrds_data_$max_token_size) var, /* the mrds select items */
    2 nprops fixed bin,				/* number of operators in pred stack */
    2 pred_op_stack (linus_data_$max_pred_stack_size),
      3 key fixed bin (17) unal,
      3 p_cnt fixed bin (17) unal,			/* current paren count */
    2 pred_pcnt fixed bin,				/* current paren. count in predicate */
    2 term_op fixed bin,				/* rel. op. for current term */
    2 nterms fixed bin,				/* no. of terms currently in term stack */
    2 dflt_ritem fixed bin,				/* index of range item to be used for default */
    2 nrange_args fixed bin,				/* no. of args for temp rel indexes */
    2 rs_hd_ptr ptr,				/* pointer to head of range strings */
    2 term_hd_ptr ptr,				/* pointer to top item in term stack */
    2 leaf_ptr (2) ptr;				/* ptr to mrds block for each leaf of current term */

dcl  lsb_ptr ptr;

/* END INCLUDE FILE linus_ls_block.incl.pl1 */
