/* BEGIN INCLUDE FILE  linus_temp_tab_names.incl.pl1 -- jaw  6/16/77 */

dcl  temp_tab_names (mrds_data_$max_temp_rels) char (32) based (ttn_ptr); /* names of temp rels in slot corr. to rel. index */

dcl  ttn_ptr ptr;

/* END INCLUDE FILE linus_temp_tab_names.incl.pl1 */
