/* BEGIN INCLUDE FILE linus_arg_list.incl.pl1 -- jccj 4/15/77 */

dcl 1 char_desc aligned based (char_ptr),		/* Structure for character descriptors */
    2 fb_desc bit (36) aligned init ("100000100000000000000000000000100011"b), /* Fixed bin descriptor */
    2 n_chars fixed bin,
    2 arr (n_chars_init refer (char_desc.n_chars)),
      3 const bit (12) unal init ("101010100000"b),	/* Constant part */
      3 var bit (24) unal;				/* Variable part */

dcl  char_ptr ptr;
dcl  n_chars_init fixed bin;

/* END INCLUDE FILE linus_arg_list.incl.pl1 */
