/* BEGIN INCLUDE FILE linus_lcb.incl.pl1 -- jaw 8/30/77 */
   


/****^  HISTORY COMMENTS:
  1) change(86-04-23,Dupuis), approve(86-05-23,MCR7188), audit(86-07-23,GWMay),
     install(86-07-29,MR12.0-1106):
     Added general_work_area_ptr and renamed sfr_ptr to
     force_retrieve_scope_ptr.
                                                   END HISTORY COMMENTS */


/* HISTORY:

   78-09-29 J. C. C. Jagernauth: Modified for MR7.0.

   81-05-11  Rickie E.  Brinegar: added security bit and andministrator bit as
   a part of the attribute level control work.
   
   81-06-17  Rickie E.  Brinegar: deleted the sd_ptr as a part of removing the
   scope_data  structure  from  LINUS.   LINUS now depends totally on MRDS for
   scope information.
   
   81-11-11  Rickie  E.   Brinegar:  added the timing bit and three fields for
   retaining  various  vcpu  times  to  be collected when in timing mode.  The
   times  to  be collected are: LINUS parsing time, LINUS processing time, and
   MRDS processing time.

   82-01-15  DJ  Schimke:  Added the build_increment and build_start fields as
   part of the line numbering implementation.  This allows for possible  later
   LINUS control of the build defaults.
 
   82-03-01 Paul W. Benjamin: Removed linus_prompt_chars_ptr, as that 
   information is now retained by ssu_.  Removed parse_timer as no longer
   meaningful.  Added linus_version.  Added iteration bit.  Added 6 entry 
   variables for ssu_ replaceable procedures.  Added actual_input_iocbp.

   82-06-23 Al Dupuis: Added subsystem_control_info_ptr, 
   subsystem_invocation_level, and selection_expression_identifier.

   82-08-26 DJ Schimke: Added report_control_info_ptr, and
   table_control_info_ptr. 

   82-10-19 DJ Schimke: Added ssu_abort_line.

   83-06-06 Bert Moberg: Added print_search_order (pso) and no_optimize (no_ot)

   83-04-07 DJ Schimke: Added temp_seg_info_ptr.

   83-08-26 Al Dupuis: Added query_temp_segment_ptr.
*/
    
dcl 1 lcb aligned based (lcb_ptr),			/* LINUS control block */
    2 db_index fixed bin (35),			/* index of open data base, or 0 */
    2 rb_len fixed bin (21),				/* length of request buffer */
    2 lila_count fixed bin (35),			/* number of LILA text lines */
    2 lila_chars fixed bin (35),			/* number of LILA source test chars */
    2 trans_id fixed bin (35),			/* used by checkpoint and rollback facilities (MR7.0) */
    2 lila_fn char (32) unal,				/* entry name of lila data file */
    2 prompt_flag bit (1) unal,			/* on if in prompt mode */
    2 test_flag bit (1) unal,				/* on if in test mode */
    2 new_version bit (1) unal init (1),		/* on for new version data base (MR7.0) */
    2 secured_db bit (1) unal,                              /* on if the db is in a secure state */
    2 administrator bit (1) unal,                           /* on if the user is a db administrator */
    2 timing_mode bit (1) unal,                             /* on if timing is to be done */
    2 iteration bit (1) unal,				/* interpret parens as iteration sets */
    2 pso_flag bit (1) unal,				/* add print_search_order to select */
    2 no_ot_flag bit (1) unal,			/* add no_optimize to select */
    2 reserved bit (27) unal,
    2 liocb_ptr ptr,				/* iocb ptr for lila file */
    2 rb_ptr ptr,					/* ptr to request buffer */
    2 is_ptr ptr,					/* iocb ptr for currentinput stream switch */
    2 cal_ptr ptr,					/* ptr to current arg list for invoke (or null) */
    2 ttn_ptr ptr,					/* pointer to table info structure */
    2 force_retrieve_scope_info_ptr ptr,		/* structure pointer to force retrieve scope operation */
    2 lv_ptr ptr,					/* pointer linus variables */
    2 si_ptr ptr,					/* pointer to select_info structure */
    2 setfi_ptr ptr,				/* pointer to set function information */
    2 sclfi_ptr ptr,				/* pointer to user declared scalar fun. names */
    2 ivs_ptr ptr,					/* pointer to stack of invoke iocb pointers */
    2 lit_ptr ptr,					/* pointer to literal pool */
    2 lvv_ptr ptr,					/* pointer to linus variable alloc. pool  */
    2 rd_ptr ptr,					/* point to readied files mode information (MR7.0) */
    2 rt_ptr ptr,                                           /* point to table of relation names and their readied modes
                                                               (MR7.0) */
    2 actual_input_iocbp ptr,				/* ptr to input while in macros */
    2 lila_promp_chars_ptr ptr,			/* pointer to the prompt characters for lila */
    2 linus_area_ptr ptr,				/* LINUS temporary segment pointer */
    2 lila_area_ptr ptr,				/* LILA temporary segment pointer */
    2 i_o_area_ptr ptr,				/* temporary segment pointer used by write, print, create_list */
    2 rel_array_ptr ptr,                                    /* ptr to array of names rslt info structure
                                                               for current lila expression */
    2 unused_timer float bin (63),			/* future expansion */
    2 request_time float bin (63),                          /* How much request time was spent
                                                                in LINUS. (-1 = user has just enabled 
						    timing, do not report) */
    2 mrds_time float bin (63),                             /* How much time was spent in MRDS */
    2 build_increment fixed bin,			/* default increment for build mode */
    2 build_start fixed bin,				/* default start count for build mode */
    2 linus_version char (4),				/* current version of LINUS */
    2 subsystem_control_info_ptr ptr,                       /* the same ptr passed by ssu_ to each request procedure */
    2 subsystem_invocation_level fixed bin,                 /* identifies this invocation of LINUS */
    2 selection_expression_identifier fixed bin,            /* identifies the current processed selection expression */
    2 report_control_info_ptr ptr,			/* pointer to linus_report_control_info structure */
    2 table_control_info_ptr ptr,			/* pointer to linus_table control structure */
    2 temp_seg_info_ptr ptr,				/* pointer to linus_temp_seg_mgr control structure */
    2 query_temp_segment_ptr ptr,			/* points to temp seg used for manipulating query */
    2 general_work_area_ptr ptr,			/* a freeing area for general use */
    2 word_pad (6) bit (36) unal,
						/* procedures that will be optionally */
						/* replaced by the user.  Saved so they */
						/* can be reinstated if desired. */
    2 ssu_abort_line entry options (variable),
    2 ssu_post_request_line variable entry (ptr),
    2 ssu_pre_request_line variable entry (ptr),

    2 curr_lit_offset fixed bin (35),			/* index of first free bit in lit. pool */
    2 curr_lv_val_offset fixed bin (35),		/* index of first free bit lv. val. pool */
    2 static_area area (sys_info$max_seg_size - fixed (rel (addr (lcb.static_area))) + 1);

dcl  lcb_ptr ptr;

/* END INCLUDE FILE linus_lcb.incl.pl1 */
