/* BEGIN INCLUDE FILE linus_lit_string.incl.pl1 -- jaw 7/1/77 */

dcl  lit_string bit (linus_data_$lit_string_size) based (lcb.lit_ptr);

dcl  lit_array (0:linus_data_$lit_string_size - 1) bit (1) unal based (lcb.lit_ptr);

/* END INCLUDE FILE linus_lit_string.incl.pl1 */
