
	/* BEGIN INCLUDE FILE lisp_unmkd_pdl.incl.pl1 */

	/* which describes the format of information that gets
	   put on the unmarked pdl */

dcl errcode(2) fixed bin aligned based,	/* (1) is error code for lisp_error_ */
				/* (2) is file system code (if any) */

    1 frame aligned based,			/* many types of frames are pushed */
      2 prev_frame bit(18) unaligned,		/* rel ptr to previous frame same type, or 0 */
      2 stack_ptr bit(18) unaligned,		/* rel(stack_ptr) when the frame was created */
      2 (dat1, dat2) bit(18) unaligned,		/* available for any lawful purpose */
      2 ret label;				/* where to return to */

dcl nframeptrs fixed bin static init(6),	/* in the following two declarations,
					   I used 6 where I meant nframeptrs because of compiler bug */
    lisp_static_vars_$frame_ptrs (0:6) ptr ext static,
    frame_ptrs (0 : 6) pointer defined (lisp_static_vars_$frame_ptrs);	/* prog_frame, err_frame, etc. */


	/* END INCLUDE FILE lisp_unmkd_pdl.incl.pl1 */

