/* BEGIN INCLUDE FILE lisp_control_chars.incl.pl1 */

/* Last modified D. Reed 6/29/72 */

dcl lisp_static_vars_$ctrlD ext fixed bin(71),
    ctrlD fixed bin(71) defined (lisp_static_vars_$ctrlD);

dcl lisp_static_vars_$ctrlQ ext fixed bin(71),
    ctrlQ fixed bin(71) defined (lisp_static_vars_$ctrlQ);

dcl lisp_static_vars_$ctrlR ext fixed bin(71),
    ctrlR fixed bin(71) defined (lisp_static_vars_$ctrlR);

dcl lisp_static_vars_$ctrlW ext fixed bin(71),
    ctrlW fixed bin(71) defined (lisp_static_vars_$ctrlW);

/* END INCLUDE FILE lisp_control_chars.incl.pl1 */

