/* lisp stack header format */
/* Last modified 7/21/72 by Reed for in_pl1 flag */
/* Modified 1978 by Greenberg for unwind-protect ops */

declare

     1 stack_seg based aligned,		/* stored in base of unmkd_pdl segment */
       2 marked_stack_bottom ptr,		/* where marked stack begins... */
       2 unmkd_stack_bottom ptr,		/* where unmkd_ stack actually starts */
       2 stack_ptr_ptr ptr,			/* points at lisp_static_vars_$stack_ptr */
       2 unmkd_ptr_ptr ptr,			/* points at lisp_static_vars_$unmkd_ptr's offset word */
       2 array_pointer ptr,			/* obsolete */
       2 nil fixed bin(71),			/* object for nil */
       2 true fixed bin(71),			/* object for t */
       2 in_pl1_code bit(36),			/* flag indicating that we are in pl1 code if non-zero */
       2 padding0 bit(36),			/* double word boundary preservation */
       2 bind_op ptr,			/* pointers to operators for run-time support */
       2 unbind_op ptr,
       2 errset1_op ptr,
       2 errset2_op ptr,
       2 unerrset_op ptr,
       2 call_op ptr,
       2 catch1_op ptr,
       2 catch2_op ptr,
       2 uncatch_op ptr,
        2 gensym_data (2) bit(36) aligned,	/* stuff used by the gensym function */
       2 system_lp ptr,			/* pointer to the system's linkage section */
       2 iogbind_op ptr,
       2 unseen_go_tag_op ptr,
       2 throw1_op ptr,
       2 throw2_op ptr,
       2 signp_op ptr,
       2 type_fields bit(72) aligned,		/* fixnum, flonum type for compiled code */
       2 return_op ptr,
       2 err_op ptr,
       2 pl1_interface ptr,			/* pointer to pl1 interface for type 2 subrs. */
       2 pl1_lsubr_interface ptr,		/* same for type -2 subrs */
       2 cons_opr ptr,			/* cons operator */
       2 ncons_opr ptr,			/* ncons operator */
       2 xcons_opr ptr,			/* xcons operator */
       2 begin_list_opr ptr,			/* operator to make initial cell of list */
       2 append_list_opr ptr,			/* operator to append to last-made cell of list */
       2 terminate_list_opr ptr,		/* opeator to append last cell to next to last cell of list */
       2 compare_op ptr,			/* fixnum/flonum comparison operator */
       2 link_op ptr,
       2 array_operator pointer,		/* accessing operator, invoked by arrays */
       2 dead_array_operator pointer,		/* dead arrays invoke this operator instead */
       2 store_operator pointer,		/* operator to do compiled store */
       2 floating_store_operator pointer,	/* ditto, but operand is in EAQ */
       2 array_info_for_store pointer,		/* -> array_info block of last array referenced */
       2 array_offset_for_store fixed bin(18),	/* offset in array_data block of last array element referenced */
       2 padding bit(36),
       2 array_link_snap_opr pointer,
       2 create_string_desc_op ptr,
       2 create_array_desc_op ptr,
       2 pl1_call_op ptr,
       2 cons_string_op ptr,
       2 create_varying_string_op ptr,
       2 unwp1_op ptr,
       2 unwp2_op ptr,
       2 ununwp_op ptr,
       2 irest_return_op ptr,
       2 pl1_call_nopop_op ptr,
       2 rcv_char_star_op ptr,
       2 spare2 (7) ptr,
       2 begin_unmkd_stack(16325) fixed bin(71);	/* rest of segment is the unmarked pdl */

dcl call_array_operator bit(36) static init("100112273120"b3),	/* tspbb ab|112,* */
    call_dead_array_operator bit(36) static init("100114273120"b3);	/* tspbb ab|114,* */

/* end stack segment format */
