/*  BEGIN:   ls_request_server_info.incl.pl1		  *  *  *  *  *  */

/****^  HISTORY COMMENTS:
  1) change(86-04-05,Swenson), approve(87-07-14,MCR7737),
     audit(87-07-14,Parisek), install(87-08-04,MR12.1-1056):
     Initial coding.
                                                   END HISTORY COMMENTS */

/* format: style4,indattr */

dcl  ls_request_server_info_ptr ptr automatic;
dcl  1 ls_request_server_info structure aligned
		        based (ls_request_server_info_ptr),
       2 version	        char (8),
       2 reply_ptr	        ptr,
       2 flags,
         3 initialized      bit (1) unaligned,
         3 pad1	        bit (35) unaligned,
       2 request_ms,
         3 dirname	        char (168) unaligned,
         3 entryname        char (32) unaligned,
         3 index	        fixed bin,
       2 request_info,				/* only valid while executing a request */
         3 sender_process_id bit (36) aligned;

dcl  LS_REQUEST_SERVER_INFO_VERSION_1 char (8) initial ("lsrsi001") internal static options (constant);

/*  END OF:  ls_request_server_info.incl.pl1		  *  *  *  *  *  */
