/* BEGIN INCLUDE FILE ... mask.incl.pl1 */

dcl (	structure_mask		init("100000000000000000000000000000000000"b),
	fixed_mask		init("010000000000000000000000000000000000"b),
	float_mask		init("001000000000000000000000000000000000"b),
	bit_mask			init("000100000000000000000000000000000000"b),
	char_mask			init("000010000000000000000000000000000000"b),
	ptr_mask			init("000001000000000000000000000000000000"b),
	offset_mask		init("000000100000000000000000000000000000"b),
	area_mask			init("000000010000000000000000000000000000"b),
	label_mask		init("000000001000000000000000000000000000"b),
	entry_mask		init("000000000100000000000000000000000000"b),
	file_mask			init("000000000010000000000000000000000000"b),
	arg_descriptor_mask		init("000000000001000000000000000000000000"b),
	storage_block_mask		init("000000000000100000000000000000000000"b),
	lock_mask			init("000000000000010000000000000000000000"b),
	condition_mask		init("000000000000001000000000000000000000"b),
	format_mask		init("000000000000000100000000000000000000"b),
	builtin_mask		init("000000000000000010000000000000000000"b),
	generic_mask		init("000000000000000001000000000000000000"b),
	picture_mask		init("000000000000000000100000000000000000"b),
	dimensioned_mask		init("000000000000000000010000000000000000"b),
	initialed_mask		init("000000000000000000001000000000000000"b),
	aligned_mask		init("000000000000000000000100000000000000"b),
	unaligned_mask		init("000000000000000000000010000000000000"b),
	signed_mask		init("000000000000000000000001000000000000"b),
	unsigned_mask		init("000000000000000000000000100000000000"b),
	precision_mask		init("000000000000000000000000010000000000"b),
	varying_mask		init("000000000000000000000000001000000000"b),
	local_mask		init("000000000000000000000000000100000000"b),
	decimal_mask		init("000000000000000000000000000010000000"b),
	binary_mask		init("000000000000000000000000000001000000"b),
	real_mask			init("000000000000000000000000000000100000"b),
	complex_mask		init("000000000000000000000000000000010000"b),
	variable_mask		init("000000000000000000000000000000001000"b),
	reducible_mask		init("000000000000000000000000000000000100"b),
	irreducible_mask		init("000000000000000000000000000000000010"b),
	returns_mask		init("000000000000000000000000000000000001"b)) bit(36) aligned int static
				options(constant);

dcl (	arithmetic_mask		init("011000000000000000000000000011110000"b),
	computational_mask		init("011110000000000000100000000011110000"b),
	fixed_binary_real_mask	init("010000000000000000000000000001100000"b),
	fixed_decimal_real_mask	init("010000000000000000000000000010100000"b),
	float_decimal_real_mask	init("001000000000000000000000000010100000"b),
	fixed_decimal_complex_mask	init("010000000000000000000000000010010000"b),
	float_decimal_complex_mask	init("001000000000000000000000000010010000"b),
	string_mask		init("000110000000000000000000000000000000"b),
	undesirable_mask		init("111111111111111111100111110111110111"b),
	convert_mask		init("011111111111111111100111110111111110"b),
	declare_constant_mask	init("111111111111111111100000000011110000"b)
								     ) bit(36) aligned int static
									options(constant);

/* END INCLUDE FILE ... mask.incl.pl1 */
