/* BEGIN INCLUDE FILE mdbm_segment_acl.incl.pl1 -- jccj 5/1/78 */

dcl 1 segment_acl (acl_count) aligned based (acl_ptr),
    2 access_name char (32),
    2 modes bit (36),
    2 zero_pad bit (36),
    2 status_code fixed bin (35);

dcl  acl_count fixed bin;
dcl  acl_ptr ptr;

/* END INCLUDE FILE mdbm_segment_acl.incl.pl1 */

