/* BEGIN INCLUDE FILE mdbm_delete_acl.incl.pl1 -- jccj 5/1/78 */

dcl 1 delete_acl (d_acl_count) aligned based (d_acl_ptr),
    2 access_name char (32),
    2 status_code fixed bin (35);

dcl  d_acl_count fixed bin;
dcl  d_acl_ptr ptr;

/* END INCLUDE FILE mdbm_delete_acl.incl.pl1 */

