/* BEGIN INCLUDE FILE mdbm_dir_acl.incl.pl1 -- jccj 5/1/78 */

dcl 1 dir_acl (dacl_count) aligned based (dacl_ptr),
    2 access_name char (32),
    2 dir_modes bit (36),
    2 status_code fixed bin (35);

dcl  dacl_count fixed bin;
dcl  dacl_ptr ptr;

/* END INCLUDE FILE mdbm_dir_acl.incl.pl1 */

