/* BEGIN INCLUDE FILE ... mlsys_field_types.incl.pl1 */
/* Created:  July 1983 by G. Palter */

/* Defined field types */

dcl (USER_DEFINED_FIELD  initial ( 0),			/* user-defined field */
     ACCESS_CLASS_FIELD  initial (16),		ACKNOWLEDGE_TO_FIELD     initial ( 7),
     BCC_FIELD	     initial (14),		CC_FIELD		     initial (13),
     DATE_FIELD	     initial ( 8),		DELIVERY_DATE_FIELD	     initial ( 5),
     POSTED_DATE_FIELD   initial ( 1),		DELIVERY_BY_FIELD	     initial ( 6),
     FROM_FIELD	     initial ( 9),		ROUTE_FIELD	     initial ( 3),
     MESSAGE_ID_FIELD    initial (18),		RELAYED_FIELD	     initial ( 4),
     IN_REPLY_TO_FIELD   initial (15),		REPLY_TO_FIELD	     initial (11),
     SENDER_FIELD	     initial ( 2),		SUBJECT_FIELD	     initial (10),
     TO_FIELD	     initial (12),		COMMENT_FIELD	     initial (17),

     N_ORDINARY_FIELDS   initial (18))			/* # of defined field types */
	fixed binary static options (constant);


/* Defined classes of header fields */

dcl (ORDINARY_FIELDS_BASE		initial (  0),
     REDISTRIBUTED_FIELDS_BASE	initial (100),	/* fields in a redistribution */
     COMMENT_FIELDS_BASE		initial (200))	/* fields in a comment */
	fixed binary static options (constant);

/* END INCLUDE FILE ... mlsys_field_types.incl.pl1 */
