/*  BEGIN INCLUDE FILE:	mowse_io_constants.incl.pl1		  *  *  *  *  *  *  *  *  *  *  *  *  */

/****^  HISTORY COMMENTS:
  1) change(86-11-06,Flegel), approve(87-07-15,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Created.
  2) change(86-11-27,Flegel), approve(86-11-27,MCR7580),
     audit(87-07-30,RBarstad), install(87-08-07,MR12.1-1075):
     Approved.
                                                   END HISTORY COMMENTS */

/* Protocol constants */
/* format: style4,indattr,ifthen,^indcomtxt,thendo,^indproc,^indblkcom,initcol1,declareind8,dclind4,struclvlind3,comcol55 */
dcl INIT_CRC	       fixed bin int static options (constant) init (63);
dcl CONVERT_CRC	       fixed bin int static options (constant) init (32);
dcl REVPOLY	       fixed bin int static options (constant) init (101001b); /* Bit N is coeff of x**(5-N) of generator */
dcl OR		       bit (4) int static options (constant) init ("0111"b);
dcl XOR		       bit (4) int static options (constant) init ("0110"b);
dcl And		       bit (4) int static options (constant) init ("0001"b);

/* Debugging Switches */
dcl DBGPKTS	       bit (1) int static options (constant) init ("0"b);
					    /* show packets */
dcl DBGREJS	       bit (1) int static options (constant) init ("1"b);
					    /* diagnose rejects */
dcl DBGXCHRS	       bit (1) int static options (constant) init ("0"b);
					    /* show extraneous received chars */

/* ASCII Control Characters */

dcl CR		       char (1) int static options (constant)
		       init ("");
dcl ESC		       char (1) int static options (constant)
		       init ("");
dcl LF		       char (1) int static options (constant)
		       init ("
");
dcl SI		       char (1) int static options (constant)
		       init ("");
dcl SO		       char (1) int static options (constant)
		       init ("");
dcl SOH		       char (1) int static options (constant)
		       init ("");

/* Protocol Bit-field Constants */
dcl ChnCnt	       fixed bin int static options (constant) init (2);
					    /* no. logical channels */
dcl SeqFld	       fixed bin int static options (constant) init (2);
					    /* no. bits in seq. field */
dcl SeqCnt	       fixed bin int static options (constant) init (4);
					    /* 2**SeqFld */
dcl SeqMsk	       fixed bin int static options (constant) init (3);
					    /* SeqCnt-1 */

/* Protocol Byte-field Constants */
dcl MaxDatLen	       fixed bin int static options (constant) init (124);
					    /* Maximum packet length */
dcl SOPLen	       fixed bin int static options (constant) init (1);
					    /* Characters in SOP field */
dcl TypLen	       fixed bin int static options (constant) init (1);
					    /* Characters in type field */
dcl ChkLen	       fixed bin int static options (constant) init (1);
					    /* Characters in check field */
dcl LenLen	       fixed bin int static options (constant) init (1);
					    /* Characters in length field */
dcl EOPLen	       fixed bin int static options (constant) init (1);
					    /* Characters in EOP field */
dcl MinPktLen	       fixed bin int static options (constant) init (5);
					    /* SOPLen+TypLen+LenLen+ChkLen+EOPLen */
dcl MaxPktLen	       fixed bin int static options (constant) init (129);
					    /* MinPktLen+MaxDatLen */

/* Protocol Packet Type Constants */
dcl RstOff	       fixed bin (8) int static options (constant)
		       init (32);		    /* <SPACE> */
dcl Request	       fixed bin (8) int static options (constant)
		       init (0);
dcl Confirm	       fixed bin (8) int static options (constant)
		       init (1);
dcl RstCnt	       fixed bin (8) int static options (constant)
		       init (2);		    /* Confirm+1 */
dcl FGBrk		       fixed bin (8) int static options (constant)
		       init (36);		    /* BrkOff+2*FG*/
dcl DisCon	       fixed bin (8) int static options (constant)
		       init (34);		    /* BrkOff+2*BG */
dcl FastDis	       fixed bin (8) int static options (constant)
		       init (86);		    /* NakOff+NakCnt */
dcl BrkOff	       fixed bin (8) int static options (constant)
		       init (34);		    /* RstOff+RstCnt */
dcl BrkCnt	       fixed bin (8) int static options (constant)
		       init (4);		    /* ChnCnt*(Confirm+1) */
dcl DatOff	       fixed bin (8) int static options (constant)
		       init (38);		    /* BrkOff+BrkCnt */
dcl DatCnt	       fixed bin (8) int static options (constant)
		       init (32);		    /* ChnCnt*SeqCnt*SeqCnt */
dcl AckOff	       fixed bin (8) int static options (constant)
		       init (70);		    /* DatOff+DatCnt */
dcl AckCnt	       fixed bin (8) int static options (constant)
		       init (8);		    /* ChnCnt*SeqCnt */
dcl NakOff	       fixed bin (8) int static options (constant)
		       init (78);		    /* AckOff+AckCnt */
dcl NakCnt	       fixed bin (8) int static options (constant)
		       init (8);		    /* ChnCnt*SeqCnt */

/* Protocol Parameters */
dcl RQS		       fixed bin int static options (constant) init (2);
					    /* rcvchr's queue size (upper bound of r_pkt) */
dcl RWS		       fixed bin int static options (constant) init (3);
					    /* Receiver's window size (upper bound of r_dat */
dcl SWS		       fixed bin int static options (constant) init (3);
					    /* Sender's window size (upper bound of s_dat */
dcl Lim_r_timer	       fixed bin int static options (constant) init (7);
					    /* Limit for r_timer */
dcl Lim_s_timer	       fixed bin int static options (constant) init (15);
					    /* Limit for s_timer */
dcl Lim_p_timer	       fixed bin int static options (constant) init (30);
					    /* Limit for pending_timer */
dcl Timer_Interval	       fixed bin (71) int static options (constant)
		       init (125000);	    /* Next wakeup of timer */

/* Tasking priority values */
dcl Modem_Reader_Task      fixed bin int static options (constant) init (0);
					    /* Modem Reader */
dcl FG_task	       fixed bin int static options (constant) init (1);
					    /* FG processing */
dcl BG_task	       fixed bin int static options (constant) init (2);
					    /* BG processing */
dcl Idle		       bit (1) int static options (constant) init ("0"b);
					    /* Task not executing */

/* Capability constants */
dcl NO_MINOR	       fixed bin int static options (constant) init (-1);

/* WSTERM modes string indices */

dcl WST_INIT_PL	       fixed bin int static options (constant) init (23);
dcl WST_INIT_LL	       fixed bin int static options (constant) init (79);

dcl WST_HEADER_1	       fixed bin int static options (constant) init (1);
dcl WST_HEADER_2	       fixed bin int static options (constant) init (2);
dcl WST_HEADER_3	       fixed bin int static options (constant) init (3);
dcl WST_LENGTH_HIGH	       fixed bin int static options (constant) init (4);
dcl WST_LENGTH_LOW	       fixed bin int static options (constant) init (5);
dcl WST_MODES	       fixed bin int static options (constant) init (6);
dcl WST_KILL	       fixed bin int static options (constant) init (7);
dcl WST_ERASE	       fixed bin int static options (constant) init (8);
dcl WST_ESCAPE	       fixed bin int static options (constant) init (9);
dcl WST_LINE_LENGTH	       fixed bin int static options (constant) init (10);
dcl WST_PAGE_LENGTH	       fixed bin int static options (constant) init (11);

/*  END INCLUDE FILE:	mowse_io_constants.incl.pl1		  *  *  *  *  *  *  *  *  *  *  *  *  */
