/* BEGIN INCLUDE FILE mrds_dm_display_flags.incl.pl1 -- jaw, 11/22/76 */

dcl 1 display_flags aligned based (df_ptr),		/* flags to control model display */
    2 append_listing bit (1) unal,			/* on if to append to listing */
    2 long bit (1) unal,				/* on if long info required */
    2 brief bit (1) unal,				/* on if brief info required */
    2 pad bit (33) unal;				/* reserved */

dcl  df_ptr ptr;

/* END INCLUDE FILE mrds_dm_display_flags.incl.pl1 */

