/* BEGIN INCLUDE FILE mrds_dsm_files.incl.pl1 -- odf, 11/03/78 */

dcl 1 dsm_files aligned based (dsmf_ptr),
    2 nfiles fixed bin,
    2 name (dsm_files_init refer (dsm_files.nfiles)) char (30); /* file names */

dcl  dsm_files_init fixed bin;
dcl  dsmf_ptr ptr;

/* END INCLUDE FILE mrds_dsm_files.incl.pl1 */

