/* BEGIN INCLUDE FILE mrds_rst_struct_types.incl.pl1 - - Jim Gray 2/20/79 */

/* these constants are used to identify structures to be allocated
   to the general purpose allocation routines */

/*  HISTORY:
    82-06-28 Roger Lackey : Removed struct types 52, 53, 54, 55, 56, 57, 58
    Type 25 is no longer used and is handled with special code so bounds of 
    array could continue to work */

/* PARSE INFO STRUCTURES */

declare  DOMAIN fixed bin internal static options (constant) init (1) ;
declare  ATTRIBUTE_DOMAIN fixed bin internal static options (constant) init (2) ;
declare  RELATION fixed bin internal static options (constant) init (3) ;
declare  ATTRIBUTE fixed bin internal static options (constant) init (4) ;
declare  FILE fixed bin internal static options (constant) init (5) ;
declare  ITEM fixed bin internal static options (constant) init (6) ;
declare  LINK fixed bin internal static options (constant) init (7) ;
declare  FOREIGN_KEY fixed bin internal static options (constant) init (8) ;
declare  CHILDREN fixed bin internal static options (constant) init (9) ;
declare  INDEX fixed bin internal static options (constant) init (10) ;
declare  DELETE_NAME fixed bin internal static options (constant) init (11) ;
declare  DOM_LIST fixed bin internal static options (constant) init (12) ; /* in link handler */

/* SEMANTIC STRUCTURES */

declare  DIRECTIVE fixed bin internal static options (constant) init (13) ;
declare  STMT fixed bin internal static options (constant) init (14) ;


/* PARSING STRUCTURES */

declare  LEX_STACK fixed bin internal static options (constant) init (15) ;
declare  P_STRUCT fixed bin internal static options (constant) init (16) ;
declare  CUR_LEX_TOP fixed bin internal static options (constant) init (17) ;
declare  FIXUP_TOKEN fixed bin internal static options (constant) init (50) ; /* scanner */
declare  STRING_SOURCE fixed bin internal static options (constant) init (51) ; /* semantics */
declare  TOKEN fixed bin internal static options (constant) init (18) ;
declare  OUTPUT_TEXT fixed bin internal static options (constant) init (19) ;


/* DB_MODEL STRUCTURES */

declare  DB_MODEL fixed bin internal static options (constant) init (0) ;
declare  FILE_INFO fixed bin internal static options (constant) init (1) ;
declare  DOMAIN_INFO fixed bin internal static options (constant) init (2) ;
declare  PATH_ENTRY fixed bin internal static options (constant) init (3) ;
declare  STACK_ITEM fixed bin internal static options (constant) init (4) ;
declare  CONSTANT fixed bin internal static options (constant) init (30) ;
declare  VERSION_STATUS fixed bin internal static options (constant) init (5) ;
declare  CHANGER fixed bin internal static options (constant) init (6) ;


/* FILE_MODEL STRUCTURES */

declare  FILE_MODEL fixed bin internal static options (constant) init (7) ;
declare  REL_INFO fixed bin internal static options (constant) init (8) ;
declare  ATTR_INFO fixed bin internal static options (constant) init (9) ;
declare  PARENT_LINK_INFO fixed bin internal static options (constant) init (10) ;
declare  CHILD_LINK_INFO fixed bin internal static options (constant) init (11) ;
declare  ATTR_LIST fixed bin internal static options (constant) init (12) ;
declare  ATD fixed bin internal static options (constant) init (31) ;
declare  COMP_NO_ARRAY fixed bin internal static options (constant) init (32) ;
declare  SORT_KEY fixed bin internal static options (constant) init (13) ;
declare  DUP_PREV fixed bin internal static options (constant) init (14) ;
declare  SELECT_CHAIN fixed bin internal static options (constant) init (15) ;


/* GLOBAL LIST STRUCTURES */

declare  GL fixed bin internal static options (constant) init (20) ;
declare  SL fixed bin internal static options (constant) init (21) ;
declare  SEGINFO fixed bin internal static options (constant) init (22) ;
declare  LIST_OVRLY fixed bin internal static options (constant) init (26) ;
declare  SAVED_CHILD_COUNT fixed bin internal static options (constant) init (24) ; /* in global list build */
declare  NODE fixed bin internal static options (constant) init (23) ;


/* DISPLAY STRUCTURES */

declare  DISPLAY_INFO fixed bin internal static options (constant) init (25) ;

/*   Remove because nolonger used 82-06-28        
  NAME_LIST fixed bin internal static options (constant) init (52) ;
  PAI_ARRAY fixed bin internal static options (constant) init (53) ;
  PAR_LK_ATTR_INFO fixed bin internal static options (constant) init (54) ;
  CAI_ARRAY fixed bin internal static options (constant) init (55) ;
  CHILD_LK_ATTR_INFO fixed bin internal static options (constant) init (56) ;
  NAME_TABLE fixed bin internal static options (constant) init (57) ;
  ATTR_TABLE fixed bin internal static options (constant) init (58) ;
*/

/* END INCULDE FILE mrds_rst_struct_types */

