/* BEGIN mrds_literal_string.incl.pl1 -- jaw 2/5/76 */

dcl  literal_string bit (mrds_data_$lit_string_size) based (dbcb.lit_ptr); /* string view of literal area */

dcl  literal_array (0:mrds_data_$lit_string_size - 1) bit (1) unal based (dbcb.lit_ptr); /* array view */

/* END mrds_literal_string.incl.pl1 */

