/*	BEGIN INCLUDE FILE		mrds_rslt_info.incl.pl1		rgl  07/22/77			*/

/*  Modified by R. Lackey  09/20/76 to handle inverted attributes */

/*  Modified by D. Woodka 06/28/82 to fix size condition */

dcl 1 rslt_info aligned based (rslt_ptr),		/* resultant information description */
    2 num_attr fixed bin,				/* number of attributes in view */
    2 num_key_attr fixed bin,				/* number of key attributes in data relation */
    2 key_length fixed bin (35),			/* length in bits of key portion of tuple */
    2 retrieve bit (1) unal,				/* retrieve permitted = "1"b */
    2 modify bit (1) unal,				/* modify permitted = "1"b */
    2 store bit (1) unal,				/* store permitted = "1"b */
    2 delete bit (1) unal,				/* delete permitted = "1"b */
    2 total_key bit (1) unal,				/* on if view includes the total key */
    2 inversion bit (1) unal,				/* On if this view contains any inverted attributes */
    2 reserved bit (30) unal,				/* reserved for future use */
    2 attr (rslt_alloc refer (rslt_info.num_attr)),	/* per attribute info */
      3 attr_name char (32),				/* name of attribute */
      3 domain_name char (32),			/* name of underlying domain */
      3 attr_length fixed bin (18),			/* length of attribute data in bits */
      3 attr_index fixed bin (24),			/* index to bit_offset in dbcbrw */
      3 descriptor bit (36) aligned,			/* attribute description */
      3 key_flag bit (1) unal,			/* key attribute = "1"b */
      3 inver_flag bit (1) unal,			/* On if this attribute is inverted */
      3 unused bit (34) unal,				/* reserved for future use */
      3 key_attr_order fixed bin,			/* order no. of this key attr. */
      3 inver_iocb_index fixed bin;			/* Index to inversion iocb in dbcbw */



dcl  rslt_ptr ptr;

dcl  rslt_alloc fixed bin;

/*	END INCLUDE FILE		mrds_rslt_info.incl.pl1						*/

