/*	BEGIN INCLUDE FILE		mrds_dm_header.incl.pl1

   Created October, 1975 for release in MR 4.0
   Modified December, 1975 to provide more info.					*/

dcl 1 dm_header based (dmh_ptr),			/* data model header */
    2 dm_header_id char (8),				/* identification as data model header */
    2 dmd_version fixed bin,				/* version number of dmd_ creating this model */
    2 creator_id char (32),				/* group id of creator */
    2 create_time fixed bin (71);			/* time of creation */

dcl  dmh_ptr ptr;

/*	END INCLUDE FILE		mrds_dm_header.incl.pl1				*/

