/*	BEGIN INCLUDE FILE		mrds_rel_desc_v3.incl.pl1	rgl, 03/31/76		*/

/* Modified by R. Lackey 09/20/76 to handle inverted attributes		*/
/* Modified by J. A. Weeldreyer 11/16/76 to add domain name */
/* Modified by NSDavids to be rel_desc_v3 because that is what
   dmd_v1_$get_attributes returns. It is v3 instead of v1 because
   v1 is already used for version 1 datamodels (at least I guess
   thats what the structure refers to). Also changed  rd_ptr to rd_v3_ptr
   and num_attr_alloc to num_attr_alloc_v3. */

dcl 1 rel_desc_v3 based (rd_v3_ptr),			/* record description of relation records */
    2 num_attr fixed bin,				/* number of attributes in the model */
    2 key_length fixed bin (35),			/* length in bits of data portion of tuple */
    2 data_length fixed bin (35),			/* length in bits of data portion of tuple */
    2 num_keys fixed bin,				/* number of key attributes */
    2 inversion bit (1) unal,				/* On if this relation contains any inverted  attributes */
    2 reserved bit (35) unal,				/* Reserved for future use */
    2 attributes (num_attr_alloc_v3 refer (rel_desc_v3.num_attr)),
      3 attribute_name char (32),			/* name of attribute  */
      3 domain_name char (32),			/* name of underlying domain */
      3 bit_offset bit (18) unaligned,			/* offset within tuple of data item */
      3 bit_length bit (18) unaligned,			/* length of data item in bits */
      3 key_flag bit (1) unaligned,			/* indicates whether attribute is part of primary key */
      3 inver_flag bit (1) unaligned,			/* On if this attribute is inverted */
      3 unused bit (34) unaligned,			/* reserved for expansion */
      3 key_attr_order fixed bin,			/* order num of this key attr */
      3 descriptor bit (36);				/* Multics descriptor for attribute */

dcl  num_attr_alloc_v3 fixed bin (10);			/* Number of attributes in relation for allocation purposes */

dcl  rd_v3_ptr ptr;

/*	END INCLUDE FILE		mrds_rel_desc_v3.incl.pl1				*/

