/*  BEGIN INCLUDE FILE ..... mrds_rst_translate_mad.incl.pl1 ..... 10/15/81  1622.7 mst Thu Davids.Multics */
/*  FROM INPUT SEGMENT mrds_rst_translate.mad */
dcl  mrds_rst_translate_mad   (0:511)fixed bin static int options(constant) init(
	/*
	'000'777	7
	'011	6
	'013	6
	'014	6
	'040	6
	'012	5
	$	4
	/	3
	:	3
	;	3
	,	3
	(	3
	)	3
	*	3
	-	3
	+	3
	09	2
	az	1
	AZ	1
	*/
	 (9)7, 6, 5, (2)6, (19)7, 6, (3)7, 4, (3)7, (6)3, 7, 3,
	 (10)2, (2)3, (5)7, (26)1, (6)7, (26)1, (389)7  );
/*    END INCLUDE FILE ..... mrds_rst_translate_mad.incl.pl1 ..... */
