/* BEGIN INCLUDE FILE mrds_dsm_display_info.incl.pl1 - - reb 05/19/81 */

/* DESCRIPTION:

   Used to control the behavior of mrds_dsm_dmdsm.

*/

dcl  1 mrds_dsm_display_info based (mrds_dsm_display_info_ptr),
       2 version fixed bin (35),                           /* version number of this structure */
       2 submodel_pathname char (168),                     /* What submodel am I working with? */
       2 submodel_iocb_ptr ptr,                            /* To the open submodel */
       2 rel_names_array_ptr ptr,                          /* To the array of submodel relations names */
       2 output_iocb_ptr ptr,                              /* To the output switch */
       2 format char (1) unal,                             /* "b" => brief format
                                                              "c" => cmdsm format
						  "l" => long format
						  "r" => only submodel relation names */
       2 char_pad char (3) unal,
       2 access bit (1) unal,                              /* ON => display access info */
       2 administrator bit (1) unal,                       /* ON => user is a DBA */
       2 db_secured bit (1) unal,                          /* ON => the database is in a secure state */
       2 submodel_secured bit (1) unal,                    /* ON => the submodel is in the secure.submodels
                                                              directory under the database directory */
       2 bit_pad bit (32) unal;

dcl MRDS_DSM_DISPLAY_INFO_VERSION fixed bin (35) int static options (constant) init (1);
                                                            /* current structure version for mrds_dsm_display_info */

dcl mrds_dsm_display_info_ptr ptr;

/* END INCLUDE FILE  -  mrds_dsm_display_info.incl.pl1 */
