/* BEGIN INCLUDE FILE  -  mrds_dsm_head_strings.incl.pl1 */

/*
   All of the key heads used in the mrds submodel vfile declared  as
   constants in this file.

   Written  11/30/79  by  Lindsey L. Spratt

   80-12-23 Davids: modified so that  strings  lengths  are  128  to
   accomodate longer relation and attribute names.

   81-05-20 Davids: added MODEL_REL_HEAD.
*/

dcl  REL_ACCESS_HEAD char (128) varying internal static options (constant) init ("relation access:");
dcl  REL_ATTR_ACCESS_HEAD char (128) varying internal static options (constant) init ("relation attribute access:");
dcl  ATTR_ACCESS_HEAD char (128) varying internal static options (constant) init ("attribute access:");
dcl  DEF_REL_ACCESS_HEAD char (128) varying internal static options (constant) init ("default relation access:");
dcl  DEF_ATTR_ACCESS_HEAD char (128) varying internal static options (constant) init ("default attribute access:");
dcl  REL_HEAD char (128) varying internal static options (constant) init ("relation:");
dcl  ATTR_REL_DELIMITER char (128) varying internal static options (constant) init (":in:");
dcl  MODEL_REL_HEAD char (128) varying internal static options (constant) init ("model relation:");

/* END INCLUDE FILE  -  mrds_dsm_head_strings.incl.pl1 */
