/* BEGIN INCLUDE FILE mrds_db_model_rel_attrs.incl.pl1 - - Jim Gray 81-01-28 */

/* HISTORY:

   81-01-28 Jim Gray : originally created for the mmi_$get_model_attributes interface.


*/

/* DESCRIPTION:

   This structure returns, for a given relation, the list of all attribute names in
   the database model. A count of the number of names present is included.
   No submodel alias names for the attributes are involved.
   Also, the domain name, and the users view descriptor for the data type
   is returned, as well as a bit indicating whether the attribute
   can be used as if it were indexed or not.
   This structure is to be used externaly, not internal to MRDS.

*/


declare 1 mrds_db_model_rel_attrs aligned based (mrds_db_model_rel_attrs_ptr),
        2 version fixed bin,				/* version number for this structure */
        2 attribute_count fixed bin,			/* total number of attributes in this model */
        2 mbz1 bit (36) unal,
        2 attribute (mrds_db_model_rel_attrs_count_init refer (mrds_db_model_rel_attrs.attribute_count)),
	3 name char (32),				/* name of the attribute in the model */
	3 domain char (32),				/* the name of the underlying domain for this attribute */
	3 user_data_type bit (36),			/* standard multics descriptor for
						   the users view of the data storage layout */
	3 indexed bit (1) unal,			/* on => key head or secondarily indexed attribute */
	3 mbz2 bit (35) unal ;

declare  mrds_db_model_rel_attrs_ptr ptr ;

declare  mrds_db_model_rel_attrs_count_init fixed bin ;

declare  mrds_db_model_rel_attrs_structure_version fixed bin int static init (1) options (constant) ;

/* END INCLUDE FILE mrds_db_model_rel_attrs.incl.pl1 */
