/* BEGIN include file ms_block_trailer.incl.pl1 */

dcl  tr_ptr ptr,					/* pointer to message block trailer area */

     1 ms_block_trailer aligned based (tr_ptr),		/* message block trailer structure */
     2 tr_pattern bit (36) aligned,			/* for identifying beginning of trailer */
     2 f_offset bit (18) unaligned,			/* offset to next logical message */
     2 b_offset bit (18) unaligned,			/* offset to previous logical message */
     2 ring_no bit (18) unaligned,			/* validation level */
     2 back_in_bucket bit (18) unaligned,		/* offset of preceding message in same hash bucket */
     2 ms_id bit (72) aligned,			/* message id */
     2 ms_size bit (24) unaligned,			/* bit count of message */
     2 pad bit (12) unaligned,
     2 sender_id char (32) aligned,			/* id of message sender */
     2 sender_authorization bit (72) aligned,		/* access authorization of message sender */
     2 access_class bit (72) aligned;			/* access class of this message */

dcl  trailer_pattern bit (36) aligned init ((36) "1"b)	/* trailer identification pattern */
     internal static;

/* END include file ms_block_trailer.incl.pl1 */
