/* BEGIN include file ms_block_trailer.incl.pl1 */
/* Modified 1984-10-10 BIM for V5, pid, lock, and max auth */

dcl  tr_ptr ptr,					/* pointer to message block trailer area */

     1 ms_block_trailer aligned based (tr_ptr),		/* message block trailer structure */
     2 tr_pattern bit (36) aligned,			/* for identifying beginning of trailer */
     2 f_offset bit (18) unaligned,			/* offset to next logical message */
     2 b_offset bit (18) unaligned,			/* offset to previous logical message */
     2 sender_ring fixed bin (3) unsigned unaligned,	/* validation level */
     2 pad1 bit (5) unaligned,
     2 back_in_bucket bit (18) unaligned,		/* offset of preceding message in same hash bucket */
     2 ms_id bit (72) aligned,			/* message id */
     2 ms_size bit (24) unaligned,			/* bit count of message */
     2 pad bit (12) unaligned,
     2 sender_id char (32) aligned,			/* id of message sender */
     2 sender_authorization bit (72) aligned,		/* access authorization of message sender */
     2 access_class bit (72) aligned,			/* access class of this message */
     2 sender_max_authorization bit (72) aligned,
     2 sender_process_id bit (36) aligned,
     2 sender_audit bit (36) aligned;

dcl  trailer_pattern bit (36) aligned init ((36) "1"b)	/* trailer identification pattern */
     internal static options (constant);

/* END include file ms_block_trailer.incl.pl1 */
