/* BEGIN INCLUDE FILE mtape_includes.incl.pl1. Created by J. A. Bush 07/29/83 */
/* This include file contains all of the mtape_ include files necessary for a
   Per-Format module to obtain the proper references */

%include mtape_data;
%page;
%include mtape_vol_set;
%page;
%include mtape_label_record;

%include mtape_err_stats;
%page;
%include mtape_file_info;
%page;
%include mtape_attach_info;

%include mtape_pfm_info;
%page;
%include mtape_open_close_info;
%page;
%include mtape_constants;
%page;
%include mtape_dcls;

/* END INCLUDE FILE mtape_includes.incl.pl1 */
