/* include file ncp_global_dt.incl.pl1 */
/* coded by Edwin W. Meyer, Jr. on 111671 */

/* This file declares the structure of the global data base that each NCP
   module getting control from the outside world allocates in its automatic storage.
   A pointer to this data base is passed to all internal modules. */

dcl  gpr ptr;                                               /* pointer to global data base */

dcl 1 gdt aligned based (gpr),                              /* automatic global data base - 70(8) words long */

    2 init_sw fixed bin,                                    /* set to 620998 if it has been initialized properly.
                                                               This particular value has  no significance */
    2 error_code fixed bin,                                 /* a multics error code returned by internal modules */
    2 request_code fixed bin,                               /* specifies type of request to be performed (input) */
    2 ncp_idx fixed bin,                                    /* socket table index of socket to be operated upon (input) */
    2 state fixed bin,                                      /* state of the socket (output) */
    2 privilege_code fixed bin,                             /* = 0 tells this is a user, = 1 tells this is a privileged process */
    2 nbytes fixed bin,                                     /* number of bytes of data presented (input) */
    2 nelemt fixed bin,                                     /* number of bytes transmitted (output) */
                                                            /* */
    2 areap ptr,                                            /* pointer to a supplied area (input) */
    2 fsoc bit (64),                                        /* foreign socket id connected with this request */
    2 spaceg1 (2) fixed bin (71),
                                                            /* */
    2 host_tbl_index fixed bin,                             /* host_tbl index of foreign host */
    2 proc_id_arg bit (36),                                 /* process id argument */
    2 entry_time fixed bin (71),                            /* time NCP was entered by this call */
    2 entry_type fixed bin,                                 /* 1,2 daemon; 3 userid; 4 process_rq;
                                                               5 set_global_evchn; 6 socket_state; 7 process_call */
    2 nprocs_sw fixed bin,                                  /* = 459248 if nprocs cell has been properly incremented */
    2 event_chn fixed bin (71),                             /* event_channel argument */
                                                            /* */
    2 proc_tbp ptr,                                         /* pointer to this process' proc_tb slot */
    2 gq_type fixed bin,                                    /* imp_global_state substructure begins here */
    2 gq_imp_state char (8),                                /* state of our IMP (up, down?) */
    2 gq_message bit (32) aligned,                          /* special message sent by IMP */
                                                            /* */
    2 gq_imp_index fixed bin,                               /* imp_dim index of this link */
    2 gq_host_id fixed bin (32),                                 /* host identifier of a foreign host */
    2 gq_link fixed bin,                                    /* link number of this link */
    2 gq_status aligned,                                    /* of this link returned by imp_global_state */
      3 sba (0:17) bit (1) unaligned,                       /* status bits */
    2 spaceg2 (14) fixed bin;

/* The following is a template for referencing this processes proc_data slot in net_db_ */
/* 30(8) words per individual entry */

dcl  procp ptr;

dcl 1 pdt aligned based (procp),                            /* template for static data base */
    2 gdtp ptr,                                             /* pointsto this call's global_data base */
    2 returnp label,                                        /* return label for non-local error goto */
                                                            /* */
    2 multuid char (16),                                    /* first half of process group id */
    2 spacep1 (4) fixed bin,
                                                            /* */
    2 netuid bit (24),                                      /* Network id of this process */
    2 lockid bit (36),                                      /* lock id of this proces.  = ""b IF THIS SLOT UNASSIGNED */
    2 processid bit (36),                                   /* process id of this process */
    2 error_recur fixed bin,                                /* number of ncp error recursions */
    2 global_ev_chn fixed bin (71),                         /* this process gets changes of NCP state */
    2 spacep2 (4) fixed bin;

/* end of include file ncp_global_dt.incl.pl1 */
