
/*             "net_buffer_header_dcls.incl.pl1" -- include file to declare the */
/*        format of the header of a standard Network System buffer (as managed  */
/*        by net_buffer_man_).  See net_buffer_man_ for details of allowed use. */

/*        Originally created by D. M. Wells, February, 1975.                    */

     declare
          1 net_buffer_header aligned based,
             2 allocation_ptr pointer,                      /* non-null iff net_buffer_man_ allocated buffer  */
             2 lock bit (36) aligned,                       /* non-zero iff in use  (value SB packed SDB ptr) */
             2 user_data bit (36) aligned,                  /* user of buffer may store data here             */
             2 user_info_ptr pointer,                       /* user of buffer may store a ptr here            */

             2 buffer_contents aligned,
                3 workspace_byte_size fixed binary (24),    /* assumed size of bytes in workspace             */
                3 buffer_bound fixed binary (24),           /* hbound of the workspace buffer                 */
                3 num_bytes fixed binary (24),              /* count of valid bytes in buffer                 */
                3 byte_offset fixed binary (24);            /* offset of first valid byte in buffer           */

          /* Usage of this header is as follows:                                */
          /*                                                                    */
          /*   declare                                                          */
          /*        1 buffer aligned based,                                     */
          /*           2 header like net_buffer_header,                         */
          /*           2 workspace aligned,                                     */
          /*              3 byte (0 : 0 refer (buffer.buffer_bound))            */
          /*                       bit (0 refer (buffer.workspace_byte_size))   */
          /*                       unaligned;                                   */

          /*      Note that in manipulating buffers using the above header that */
          /* the following relations are true by convention:                    */
          /*                                                                    */
          /*        Num_Unused + byte_offset + num_bytes = buffer_bound + 1     */
          /*        Next_Unused = byte_offset + num_bytes                       */

/*        end of "net_buffer_header_dcls.incl.pl1" --                           */

