/* BEGIN INCLUDE FILE:  network_account_array.incl.pl1  */

/****^  HISTORY COMMENTS:
  1) change(86-02-21,Herbst), approve(87-07-31,MCR7694),
     audit(87-07-31,GDixon), install(87-08-04,MR12.1-1056):
     Added process_id field and replaced group_id with it in the key.
  2) change(87-04-09,Brunelle), approve(87-07-31,MCR7694),
     audit(87-07-31,GDixon), install(87-08-04,MR12.1-1056):
     Completely restructured.
  3) change(87-05-07,Brunelle), approve(87-07-31,MCR7694),
     audit(87-07-31,GDixon), install(87-08-04,MR12.1-1056):
     Added purged and accounting bit fields.
  4) change(87-07-31,Brunelle), approve(87-07-31,MCR7694),
     audit(87-07-31,GDixon), install(87-08-04,MR12.1-1056):
     Moved version field from the network_account_data structure to the
     network_account_array structure and changed the value of the constant to
     reflect the move.
                                                   END HISTORY COMMENTS */

/* format: style4 */
/* used by the $dump_table, $get_process_total and $read_and_reset_table 
   entrypoints of network_accounting_.pl1 */

dcl  network_account_array_ptr ptr;
dcl  network_account_array_bound fixed bin;

dcl  1 network_account_array aligned based (network_account_array_ptr),
       2 version char (8),
       2 max_count fixed bin,
       2 count fixed bin,
       2 record (network_account_array_bound refer (network_account_array.max_count))
	  aligned like network_account_data;

dcl  network_account_data_ptr ptr;

dcl  1 network_account_data aligned based (network_account_data_ptr),
       2 key,
         3 process_id bit (36) aligned,			/* of the process using the connection */
         3 session_handle fixed bin (35),		/* identifier of the connection being charged */
         3 network_id fixed bin (35),			/* identifies the network being used */
       2 switches unaligned,
         3 delete_sw bit (1) unaligned,			/* delete entry when next read */
         3 unassigned_sw bit (1) unaligned,		/* owner connected to the session */
         3 purged bit (1) unaligned,			/* network_accounting_ purged this record */
         3 accounting bit (1) unaligned,		/* used by act_ctl_ */
         3 mbz bit (32) unaligned,
       2 connect_time fixed bin (35),			/* incremental seconds of connect time to charge */
       2 byte_count fixed bin (35),			/* incremental count of bytes to be charged */
       2 packet_count fixed bin (35);			/* incremental count of packets to be charged */

dcl  NET_ACCT_ARRAY_VERSION_1 char (8) int static options (constant) init ("NETACTA1");

/* END INCLUDE FILE:  network_account_array.incl.pl1 */
