/* Begin include file packed_pointer.incl.pl1 BIM 830510 */

declare packed_pointer_ptr pointer;
declare 1 packed_pointer aligned based (packed_pointer_ptr),
	2 bitno fixed bin (6) unsigned unaligned,
	2 segno fixed bin (12) unsigned unaligned,
	2 wordno fixed bin (18) unsigned unaligned;

/* End include file packed_pointer.incl.pl1 */
