dcl (	char_picture	init(24),
	real_fixed_picture	init(25),
	cplx_fixed_picture	init(26),
	real_float_picture	init(27),
	cplx_float_picture	init(28))	fixed bin int static options(constant);
