/* BEGIN INCLUDE FILE ... pit.incl.pl1 */

/****^  ********************************************
        *                                          *
        * Copyright, (C) Honeywell Bull Inc., 1988 *
        *                                          *
        ******************************************** */

/* Requires user_attributes.incl.pl1 */
/* Declaration of the Process Inititalization Table  (PIT) */

/****^  HISTORY COMMENTS:
  1) change(86-03-01,Gilcrease), approve(86-03-27,MCR7370),
     audit(86-06-25,Lippard), install(86-06-30,MR12.0-1082):
     First comment for hcom. Modified 750430 by PG to add terminal_access_class
     Modified 6/20/77 by J. Stern to add term_type_name Modified Feb 1980 by M.
     B. Armstrong to implement multiple rate structures. (UNCA) Modified by R.
     McDonald  May 1980 to include page charges, replaces cpu in iod (UNCA)
     Modified by Benson I. Margulies November 1981 do declare pit_$, pit_ptr,
     and unaligned character strings. Modified by E. N. Kittlitz January 1982
     for user_attributes.incl.pl1 changes Modified by E. N. Kittlitz October
     1982 for request_id. Modified by BIM 1984-09-12 for auth range. The max
     copies the pds, but this is the only home of the min.
  2) change(86-03-01,Gilcrease), approve(86-03-27,MCR7370),
     audit(86-06-25,Lippard), install(86-06-30,MR12.0-1082):
               Add the truncate_absout and restarted bits for the
               -truncate .absout SCP 6297, version 3.
  3) change(86-12-11,GDixon), approve(87-07-16,MCR7741),
     audit(87-07-16,Brunelle), install(87-08-04,MR12.1-1056):
     Changed structure under pit.abs_attributes to use like structure in
     abs_attributes.incl.pl1.  This allows the same attributes to be used
     in abs_message_format.incl.pl1 and user_table_entry.incl.pl1 as well as
     this include file.
  4) change(88-06-03,Parisek), approve(88-06-10,MCR7920),
     audit(88-06-23,Hunter), install(87-07-05,MR12.2-1053):
     Remove "pitmsg" in END comment string.  pitmsg.incl.pl1 is no longer a
     name of pit.incl.pl1.
  5) change(88-07-11,Parisek), approve(88-07-11,MCR7849),
     audit(88-07-03,Lippard), install(88-07-13,MR12.2-1047):
     Removed the ringpad element and added the min_ring & max_ring elements so
     users may access their lowest and/or highest possible login ring value.
     SCP6367.
                                                   END HISTORY COMMENTS */


/* format: style4 */
declare  pit_$ bit (36) aligned external static;
declare  pit_ptr pointer;

dcl  1 pit aligned based (pit_ptr),
       2 version fixed bin,				/* indicates which version of the pit */
       2 process_type fixed bin,			/* initializer, interactive, or absentee process */
       2 login_responder char (64) unal,		/* path name of login responder */

/*  All of these are going to be word aligned whether or not they are declared aligned,
   and unaligning them cleans up code in many places */

       2 homedir char (64) unal,			/* path name of home directory */
       2 project char (28) unal,			/* name of this process' project affiliation */
       2 account char (32) unal,			/* name of account to which this process is charged */
       2 n_processes fixed bin,			/* number of previous processes for this session */
       2 login_time fixed bin (71),			/* clock time at login */
       2 proc_creation_time fixed bin (71),		/* clock time at creation of this process */
       2 old_proc_cpu fixed bin (71),			/* cpu time used by previous processes in this session */
       2 user_weight fixed bin,			/* weight of this process */
       2 anonymous fixed bin,				/* 1 if anonymous user */
       2 login_name char (28) unal,			/* name of user given at login */
       2 logout_pid bit (36),				/* process id of answering service */
       2 logout_channel fixed bin (71),			/* channel for signalling logouts to answering service */
       2 group char (8) unal,				/* party group */
       2 min_ring fixed bin,				/* min ring */
       2 max_ring fixed bin,				/* max ring */
       2 at like user_attributes aligned,		/* include user_attributes.incl.pl1 */
       2 whox fixed bin,				/* this process's index in whotab (or 0) */
       2 outer_module char (32) unaligned,
       2 pad (2) fixed bin,
       2 dont_call_init_admin bit (1) aligned,		/* Call process_overseer_ directly */
       2 terminal_access_class bit (72) aligned,		/* access class of user's terminal */
       2 dollar_charge float bin,			/* Month-to-date expenditure */
       2 dollar_limit float bin,			/* Limit stop on usage */
       2 shift_limit (0:7) float bin,			/* Stops on each shift's usage */
       2 logins fixed bin,				/* Number of logins this month */
       2 crashes fixed bin,				/* Number of sessions crashed */
       2 interactive (0:7),				/* interactive usage by shift */
         3 charge float bin,				/* Total charge */
         3 xxx fixed bin,
         3 cpu fixed bin (71),			/* CPU usage in microseconds */
         3 core fixed bin (71),			/* Memory usage in page-microseconds */
         3 connect fixed bin (71),			/* Connect time in microseconds */
         3 io_ops fixed bin (71),			/* Terminal I/O operations */
       2 absentee (4),				/* Absentee usage by queue */
         3 charge float bin,				/* Total absentee charge */
         3 jobs fixed bin,				/* Number of jobs */
         3 cpu fixed bin (71),			/* CPU usage in microseconds */
         3 memory fixed bin (71),			/* Memory usage in mu */
       2 iod (4),					/* IO Daemon usage, by queue */
         3 charge float bin,				/* Total charge */
         3 pieces fixed bin,				/* Number of requests */
         3 pad fixed bin (35),
         3 pages fixed bin (35),			/* number of pages output */
         3 lines fixed bin (71),			/* Record count */
       2 devices (16) float bin,			/* Usage of attached devices */
       2 time_last_reset fixed bin (71),		/* time last updated the PDT */
       2 absolute_limit float bin,			/* Limit, not reset monthly */
       2 absolute_spent float bin,			/* Spending against this */
       2 absolute_cutoff fixed bin (71),		/* Spending will be reset on this date */
       2 absolute_increm fixed bin,			/* .. time increment code. 0 = don't reset */
       2 rs_number fixed bin (9) unsigned unaligned,	/* rate structure number (0= default rates) */
       2 pad1a fixed bin (27) unsigned unaligned,		/* remainder of word */
       2 request_id fixed bin (71),			/* absentee request id */
       2 authorization_range (2) bit (72) aligned,
       2 pad1 (73) fixed bin,				/* extra space */
       2 charge_type fixed bin,			/* device charge type of console */
       2 term_type_name char (32) unal,			/* terminal type name */
       2 line_type fixed bin,				/* line type of user's console */
       2 tty_type fixed bin,				/* old terminal type (obsolete, kept for compatibility) */
       2 service_type fixed bin,			/* type of service console is performing */
       2 tty_answerback char (4) unaligned,		/* original answerback of user's console */
       2 old_tty char (6),				/* (obsolete) attachment name of user's console */
       2 standby fixed bin,				/* 1 if standby user */
       2 login_line char (120) unal,			/* line typed at login */
       2 cant_bump_until fixed bin (71),		/* cannot be preempted until this time (0 for abs) */
       2 input_seg char (168) unal,			/* path name of absentee input file */
       2 output_seg char (168) unal,			/* path name of absentee output file */
       2 max_cpu_time fixed bin,			/* max number of seconds allowed to this absentee proc */
       2 abs_queue fixed bin,				/* absentee queue if absentee, else -1 */
       2 abs_attributes aligned like user_abs_attributes,	/* include abs_attributes.incl.pl1 */
       2 arg_info_ptr fixed bin (18) unsigned,		/* Relative pointer to information on absentee args. */
       2 old_proc_core fixed bin (71),			/* Memory usage by previous processes in this session */
       2 old_proc_io_ops fixed bin (71),		/* I/O operations from previous processes in this session */
       2 tty char (32) unaligned,			/* Attachment name of users channel */
       2 start_arg_info fixed bin;			/* Put absentee args information here. */


/* Structure to contain information on absentee arguments */
dcl  1 arg_info aligned based,
       2 arg_count fixed bin,				/* Number of arguments for replacement in absentee segment */
       2 ln_args fixed bin,				/* Length of string containing arguments. */
       2 arg_lengths (25 refer (arg_info.arg_count)) fixed bin, /* Array of argument lengths */
       2 args char (128 refer (arg_info.ln_args)) unal;
						/* Args used for replacement in absentee control segment. */

declare PIT_version_3 fixed bin int static options (constant) init (3);

/* END INCLUDE FILE ... pit.incl.pl1 */
