/* BEGIN INCLUDE FILE ... pl1_file_value.incl.pl1 */

dcl 1 file_value aligned based,
    2 fab_ptr ptr,					/* ptr to file attribute block (fab) */
    2 fsb_ptr ptr;					/* ptr to file state block (fsb) */

/* END INCLUDE FILE ... pl1_file_value.incl.pl1 */
