dcl	1 pl1_symbol_block	aligned based,
	2 version		fixed bin,
	2 identifier	char(8),		/* must be "pl1info" */
	2 flags,
	  3 profile	bit(1) unal,
	  3 table		bit(1) unal,
	  3 map		bit(1) unal,
	  3 flow		bit(1) unal,
	  3 io		bit(1) unal,
	  3 table_removed	bit(1) unal,
	  3 long_profile	bit(1) unal,
	  3 pad		bit(29) unal,
	2 greatest_severity	fixed bin,
	2 root		unal bit(18),
	2 profile		unal bit(18),
	2 map		unal,
	  3 first		bit(18),
	  3 last		bit(18),
	2 segname		unaligned,
	  3 offset	bit(18),
	  3 size		bit(18);
