/* plio_format_codes.incl.pl1
  run-time values - the 200 prefix has been dropped */
dcl    (	r_paren		init(0),
	l_paren		init(1),
	r_format		init(2),
	c_format		init(3),
	f_format		init(4),
	e_format		init(5),
	b_format		init(6),
	a_format		init(7),
	x_format		init(8),
	skip_format	init(9),
	column_format	init(10),
	page_format	init(11),
	line_format	init(12),
	picture_format	init(13),
	bn_format		init(14))
					fixed bin(15) int static;
