/* --------------- BEGIN include file plot_entry_dcls.incl.pl1 --------------- */

dcl  plot_ 	ext entry (float bin dimension (*), float bin dimension (*), fixed bin, fixed bin, char (1)),
     plot_$setup 	ext entry (char (*), char (*), char (*), fixed bin, float bin, fixed bin, fixed bin),
     plot_$scale 	ext entry (float bin, float bin, float bin, float bin);

dcl (Vectors_only initial (1),		/* vec_sw;  fourth arg to plot_ */
     Vectors_and_symbols initial (2),
     Symbols_only initial (3),

     Linear_linear initial (1),		/* type;  fourth arg to plot_$setup */
     Log_linear initial (2),
     Linear_log initial (3),
     Log_log initial (4),

     Tick_marks initial (0),			/* grid_sw;  fifth arg to plot_$setup */
     Dotted_grid initial (1),
     Solid_grid initial (2),
     No_grid initial (3),

     Normal_scaling initial (0),		/* eq_scale_sw;  sixth arg to plot_$setup */
     Equal_scaling initial (1)) fixed bin static options (constant);

/* ---------------- END include file plot_entry_dcls.incl.pl1 ---------------- */
