/*  Begin include file  ...  pps_control_block_info.incl.pl1  */


dcl 1 ppscb_data aligned based (ppscbd_ptr),
    2 dir_name char (168),				/* Directory name containing the ppscb segment. */
    2 entry_name char (32),				/* Entry name of the ppscb segment. */
    2 name char (32),				/* Name of the particular control block. */
    2 ppscb_ptr ptr;				/* Pointer to the ppscb. */


/*  End include file  ...  pps_control_block_info.incl.pl1  */
