/*	BEGIN INCLUDE FILE probe_ref_block.incl.pl1	*/

/* *	This declares all the necessary storage for a reference node and the
   *	things it points to. Programs which create reference nodes should either
   *	declare automatic ref_blocks like ref_block, and call probe_create_reference_$init
   *	to initialize the automatic copies, or call probe_create_reference_ directly
   *	to allocate them in expression_area and initialize the, returning a pointer
   *	which will be valid for the duration of the request. */

dcl  ref_block_ptr pointer;

dcl 1 ref_block aligned based (ref_block_ptr),		/* we allocate this in the area and fill it in */
    2 ref_node aligned like reference_node,
    2 subscripts aligned like reference_subscripts,
    2 arglist aligned like reference_arg_list,
    2 source_info aligned like source_info,
    2 sub_refs aligned like subscript_reference_ptrs;

/*	END INCLUDE FILE probe_ref_block.incl.pl1	*/
