/* begin include file program_interrupt_info.incl.pl1 BIM 1981 */
/* format: style2 */

/* condition_info_header.info.pl1 must be %included with this file */

     declare program_interrupt_info_ptr
			      pointer;

     declare 1 program_interrupt_info
			      aligned based (program_interrupt_info_ptr),
	     2 header	      aligned like condition_info_header,
	     2 default_handler_restarted_this_signal
			      bit (1) aligned;

     declare program_interrupt_info_version_1
			      fixed bin init (1) internal static options (constant);

     declare program_interrupt_condition_name
			      character (17) init ("program_interrupt") internal static options (constant);

     declare program_interrupt      condition;

/* end include file program_interrupt_info.incl.pl1 */
