/* BEGIN INCLUDE FILE .. projfile.incl.pl1 */
/* Modified by T. Casey April 1976 to change disk_infs (obsolete) to dir_disk_use */
/* Modified 1984-07-09 BIM for dir_disk_quota, version */
/* Modified 1984-09-14 BIM for reasonable array size */

dcl 1 projfile based (pp) aligned,			/* Project history file */
    2 nproj fixed bin (35),				/* number of entries */
    2 version fixed bin,
    2 projfilexx0 (6) bit (36) aligned,
    2 projfiletab (3000),				/* in seg limit */
      3 id char (12) unal,				/* project ID */
      3 title char (52) unal,				/* project title */
      3 inv char (32) unal,				/* name of principal investigator */
      3 inv_addr char (32) unal,			/* address */
      3 sup char (32) unal,				/* name of supervisor */
      3 sup_addr char (32) unal,			/* address */
      3 sup_phone char (16) unal,			/* telephone */
      3 on fixed bin (71),				/* date on */
      3 off fixed bin (71),				/* date off */
      3 disk_psec fixed bin (71),			/* project disk page-seconds */
      3 disk_quota fixed bin (35),			/* project disk quota */
      3 dir_disk_quota fixed bin (35),			/* project dir disk quota */
      3 disk_use fixed bin (35),			/* total segment pages used */
      3 dir_disk_use fixed bin (35),			/* total directory pages used */
      3 misc_charges float bin,			/* manuals, etc */
      3 n_misc fixed bin,				/* number of entries */
      3 processed fixed bin,				/* temp for usage-report */
      3 pad bit (36) aligned;				/* out to even number of words */

dcl  loph int static fixed bin (17) options (constant) init (8), /* lth of projfile header */
     lope int static fixed bin (17) options (constant) init (66); /* lth of projflile entry */

dcl PROJFILE_VERSION fixed bin init (3) int static options (constant);

/* END INCLUDE FILE ... projfile.incl.pl1 */
