/* BEGIN INCLUDE FILE ... prph_card.incl.pl1 ... October 1979, Michael R. Jordan */

dcl  prphp ptr;					/* Pointer to a PRPH card. */

dcl 1 prph_card based (prphp) aligned,			/* PRPH card declaration */
    2 word char (4),				/* "PRPH" */
    2 name char (4),				/* subsystem name */
    2 iom fixed bin (3),				/* IOM number */
    2 chan fixed bin (6),				/* channel number */
    2 model fixed bin;				/* model number */

/* END INCLUDE FILE ... prph_card.incl.pl1 */
