/*	BEGIN INCLUDE FILE ... pv_holdt.incl.pl1 ... */


dcl pv_holdtp ptr;

dcl 1 pv_holdt (1 : 64) based (pv_holdtp) aligned,

    2 pvtx   fixed bin(17) unaligned,
    2 apterp bit(18) unaligned;


/*	END INCLUDE FILE ... pv_holdt.incl.pl1 ...*/
