/* --------------- BEGIN include file rcp_volume_formats.incl.pl1 --------------- */



/****^  HISTORY COMMENTS:
  1) change(86-12-08,GWMay), approve(86-12-08,PBF7552),
     audit(86-12-08,Martinson), install(86-12-17,MR12.0-1250):
     added array entry 0 to the volume format types to indicate that the tape
     volume was not authenticated by rcp.
                                                   END HISTORY COMMENTS */


/* General volume types */

dcl (Volume_unauthenticated initial (0),
     Volume_blank initial (1),
     Volume_unknown_format initial (6),
     Volume_unreadable initial (7),

/* Tape volume types */

     Volume_multics_tape initial (2),
     Volume_gcos_tape initial (3),
     Volume_ibm_tape initial (4),
     Volume_ansi_tape initial (5)) fixed bin static options (constant);

/* Printable descriptions of volume types */

dcl  Tape_volume_types (0:7) char (16) static options (constant) initial
    ("unauthenticated",
     "blank",
     "Multics",
     "GCOS",
     "IBM",
     "ANSI",
     "unrecognizable",
     "unreadable");

/* ---------------- END include file rcp_volume_formats.incl.pl1 ---------------- */
