/*	Begin  include file ... rcp_com_seg.incl.pl1
   *
   *	Created on 11/20/74 by Bill Silver.
   *	Modified on 09/19/77 by R.J.C. Kissel to add label authentication bits.
   *	Modified on 12/09/78 by Michael R. Jordan to add removable media bit and label_type.
   *	Modified 1/79 by R.J.C. Kissel to add disk label authentication bits.
   *	Modified 2/79 by Michael R. Jordan to add volume_density.
   *	Modified 11/84 by Paul Farley to add fips flag.
   *      Modified 1/3/85 by Fawcett to allow room for mca device type
   *	Modified 02/85 by Paul Farley to add no_protect and opr_int_available flags.
   *	This include file defines the Resource Control Package communication segment.
   *	This segment is used to communicate requests between the various internal
   *	parts of RCP.
*/

/****^  HISTORY COMMENTS:
  1) change(85-09-09,Farley), approve(85-09-09,MCR6979),
     audit(85-12-09,CLJones), install(86-03-21,MR12.0-1033):
     Support MCA and FIPS.
                                                   END HISTORY COMMENTS */

dcl  lock_info_ptr ptr;				/* Pointer to lock info structure. */
dcl  rcs_ptr ptr;					/* Pointer to base of RCS. */
dcl  rcse_ptr ptr;					/* Pointer to an RCS entry. */

dcl 1 based_rcp_id based aligned,			/* Overlay of an rcp_id. */
   (2 id_count fixed bin (17),			/* Unique count index. */
    2 rcse_off bit (18)) unaligned;			/* Offset of rcp_com_seg entry. */

dcl 1 rcs based (rcs_ptr) aligned,			/* Begin at word zero of rcp_com_seg. */
    2 lock_info like lock_info,			/* Data used to lock this segment. */
    2 ws_maxs (8) fixed bin (19),			/* Max IOI workspace size in words. */
    2 ws_pmaxs (8) fixed bin (19),			/* Max IOI workspace size for priv attachments. */
    2 to_maxs (8) fixed bin (71),			/* Max IOI time-out intervals in microseconds. */
    2 sys_directory char (32),			/* Directory  used to define a system process. */
    2 sys_acs char (32),				/* Entry name used to define a system process. */
    2 acs_directory char (32),			/* Directory containing device ACSs. */
    2 id_count fixed bin (35),			/* Counter used to form rcp_id. */
    2 max_entries fixed bin,				/* Maximum number of entries allowed. */
    2 num_entries fixed bin,				/* Total number of entries. */
    2 first_free_off bit (18),			/* Offset of first free entry. */
    2 entry (0 refer (rcs.num_entries))			/* Array of request entries. */
     like rcse,					/* See structure below. */
    2 end bit (36);					/* End of rcp_com_seg. */

dcl 1 lock_info based (lock_info_ptr) aligned,		/* Used to meter locking. */
    2 lock bit (36),				/* The lock itself. */
    2 num_locks fixed bin (35),			/* Number of times locked. */
    2 num_lock_waits fixed bin (35),			/* Number of lock waits. */
    2 time_of_lock fixed bin (71),			/* Time of last lock. */
    2 tot_lock_time fixed bin (71),			/* Total time locked. */
    2 tot_wait_time fixed bin (71),			/* Total time waiting for lock. */
    2 starting_time fixed bin (71);			/* Time metering started. */

dcl 1 rcse based (rcse_ptr) aligned,			/* Up to state must = rcpd.device. */
    2 device_name char (8),				/* Name of device associated with this entry. */
    2 volume_name char (32),				/* Volume name.  Blank => no volume. */
    2 dtypex fixed bin,				/* Device type index. */
    2 model fixed bin,				/* Device model number. */
    2 num_qualifiers fixed bin,			/* Number of device qualifiers. */
    2 qualifiers (4) fixed bin (35),			/* Device qualifiers. */
    2 state_time fixed bin (71),			/* Time device put into current state. */
    2 state fixed bin,				/* 0 - free       1 - assigning  2 - assigned */
						/* 3 - attaching  4 - attached   5 - completed. */

/*	*	*	*	*	** Following fields are unique to RCS entry. */
    2 kind fixed bin,				/* 1 => attach, 2 => assign */
    2 free_off bit (18),				/* Offset of next free entry.  0 => not free. */
    2 user_off bit (18),				/* Offset of next entry in user list. */
    2 device_off bit (18),				/* Offset of device entry in RCPD. */
    2 volume_off bit (18),				/* Offset of volume entry in RCPD. */
    2 rcse_off bit (18),				/* Offset of associated RCS entry. */
    2 caller_level fixed bin,				/* Caller's validation level. */
    2 disposition bit (1),				/* ON => retain, OFF => unassign. */
    2 flags,					/* Special info flags. */
     (3 device bit (1),				/* ON => assigning a specific device. */
      3 priv bit (1),				/* ON => attached with IOI privilege. */
      3 system bit (1),				/* ON => assigned to a system process. */
      3 t_and_d bit (1),				/* ON => T&D attachment. */
      3 volume bit (1),				/* ON => volume associated with this device. */
      3 writing bit (1),				/* ON => writing on volume. */
      3 have_auth bit (1),				/* ON => tape volume authenticated. */
      3 need_auth bit (1),				/* ON => tape volume needs authentication. */
      3 auth_set bit (1),				/* ON => "have_auth" has been set. */
      3 preload_allowed bit (1),			/* ON => preloading of volumes is allowed. */
      3 preloaded bit (1),				/* ON => volume may be loaded on device. */
      3 not_removable_media bit (1),			/* ON => cannot remove volume from device. */
      3 disk_ss_pack bit (1),				/* ON => disk is a storage system volume. */
      3 disk_copy_of_ss_pack bit (1),			/* ON => disk is a copy of a storage system volume. */
      3 disk_io_pack bit (1),				/* ON => disk has label but is not storage system. */
      3 disk_unregistered bit (1),			/* ON => disk is unregistered storage system volume. */
      3 disk_unreadable bit (1),			/* ON => io error reading disk label. */
      3 must_auto_register bit (1),			/* ON => unregistered volume requested */
      3 fips bit (1),				/* ON => FIPS device. */
      3 no_protect bit (1),				/* ON => device has no protect sw. */
      3 opr_int_available bit (1),			/* ON => device connected to MPC with OI button. */
      3 unused bit (6),
      3 volume_density_index fixed bin (3) unsigned,	/* Density of volume */
      3 label_type fixed bin (6) unsigned)unaligned,	/* Type of label read by RCP. */
    2 rcp_id bit (36),				/* ID of this entry. */
    2 event_id fixed bin (71),			/* Caller's event channel ID. */
    2 process_id bit (36),				/* ID of calling process. */
    2 group_id char (32),				/* Group ID of calling process. */
    2 ecode fixed bin (35),				/* Assignment error code. */
    2 version_num fixed bin,				/* Device info version number. */
    2 workspace_max fixed bin (19),			/* Max size of IOI workspace buffer. */
    2 timeout_max fixed bin (71),			/* Max IOI time-out interval. */
    2 ioi_index fixed bin,				/* IOI device index. */
    2 workspace_ptr ptr,				/* Pointer to IOI workspace buffer. */
    2 caller_comment char (64);			/* Caller's comment. */

/*	End of include file ... rcp_com_seg.incl.pl1	*/
