/* BEGIN INCLUDE FILE ... rdm_data.incl.pl1 */
/* Created:  September 1983 by G. Palter */


/* Constant data used by the read_mail subsystem */

dcl  rdm_data_$version character (32) varying external;	/* current version of the subsystem */

dcl  rdm_data_$info_directory character (168) external;	/* directory containing self-documenation */

dcl  rdm_data_$special_message character (256) varying external;
						/* message to print on each invocation if not null */

dcl  rdm_data_$ec_suffix character (32) external;		/* exec_com suffix for read_mail */
dcl  rdm_data_$ec_search_list character (32) external;	/* exec_com search list */


/* Static data used by the read_mail subsystem */

dcl  rdm_data_$first_invocation bit (1) aligned external;	/* ON => this is the first invocation in this process */

/* END INCLUDE FILE ... rdm_data.incl.pl1 */
