/* BEGIN INCLUDE FILE ... rdm_switch_types.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(86-03-25,Herbst), approve(86-03-25,MCR7367),
     audit(86-04-28,Margolin), install(86-05-22,MR12.0-1059):
     New file.
                                                   END HISTORY COMMENTS */

/* Constants for telling rdm_mailbox_interface_$set_message_switch which switch to set */

dcl  PER_MESSAGE_SEEN_SWITCH_TYPE char (4) aligned int static options (constant) init ("SEEN");

/* END INCLUDE FILE ... rdm_switch_types.incl.pl1 */
