/* BEGIN INCLUDE FILE ... rdm_fwd_text_mgr_const.incl.pl1 */
/* Created: 7 October 1983 by B. Margolin
   (copied from sdm_text_mgr_constants.incl.pl1) */

/* Constants used by rdm_fwd_text_mgr_ to communicate the type of input terminator read from the terminal */

dcl (NORMAL_TERMINATION	initial (1),		/* '.': transmit the message */
     ENTER_REQUEST_LOOP	initial (2),		/* '\fq': enter request loop */
     ENTER_EDITOR		initial (3))		/* '\f...': enter editor */
	fixed binary static options (constant);

/* END INCLUDE FILE ... rdm_fwd_text_mgr_const.incl.pl1 */
