/*  START OF:	rdm_fwd_subsystem_opts.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */

/* Option structure for the read_mail forwarding subsystem. */

/* Written: 10/3/83 by B. Margolin */

dcl 1 rdm_forward_subsystem_options	aligned based (rdm_forward_subsystem_options_ptr),
      2 version			char (8),
      2 input_type			char (4),		/* terminal/file */
      2 input_file,
        3 input_file_ptr		ptr,
        3 input_file_lth		fixed bin (21),
      2 request_loop_control,
        3 initial_requests_ptr	ptr,
        3 initial_requests_lth	fixed bin (21),
        3 enter_request_loop		bit (2) aligned,	/* default/-rql/-nrql */
      2 fill_control,
        3 fill_width		fixed bin,	/* default 62 (caller should set) */
        3 enable_filling		bit (2) aligned,	/* default/-fill/-no_fill */
      2 prompt_control,
        3 prompt_string		char (64) var,
        3 enable_prompt		bit (2) aligned,	/* default/-prompt prompt_string/-no_prompt */
      2 abbrev_control,
        3 default_profile_ptr		ptr,
        3 profile_ptr		ptr,
        3 enable_abbrev		bit (1) aligned,
      2 flags,
        3 auto_write		bit (1) unaligned,
        3 pad			bit (35) unaligned;

dcl rdm_forward_subsystem_options_ptr	ptr;
dcl RDM_FORWARD_SUBSYSTEM_OPTIONS_VERSION_1
				char (8) int static options (constant) init ("rfso_001");

dcl (DEFAULT_PROMPT			init ("00"b),
     USE_PROMPT_STRING		init ("01"b),
     NO_PROMPT			init ("10"b),

     DEFAULT_FILL			init ("00"b),
     FILL				init ("01"b),
     NO_FILL			init ("10"b),

     DEFAULT_REQUEST_LOOP		init ("00"b),
     REQUEST_LOOP			init ("01"b),
     NO_REQUEST_LOOP		init ("10"b))
				bit (2) aligned int static options (constant);

dcl (TERMINAL_INPUT			init ("term"),
     FILE_INPUT			init ("file"))
				char (4) int static options (constant);

/*  END OF:	rdm_fwd_subsystem_opts.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
