dcl       1 reference                   based(p),
          2 node_type                   fixed bin(15),
          2 const_units_offset          fixed bin(31),      /* offset from level 1 in addressable units       */
          2 units_offset                ptr,                /* variable offset from level 1 in address units  */
          2 symbol                      ptr,                /* attribute block of a symbol table entry        */
	2 bits,
	3 array_ref		bit(1);		/* this is ref to array-not to element of array	*/
