


	/* include file for RELBIT */

declare 1 eb_data_$relbit ext aligned,
        2 (	iabsol,	itext,	imtext,	ilink,	imlink,	ilkptr,	idefpt,	isymbl,
		imsymb,	ilblok,	imblok,	iselfr,	iresv1,	iresv2,	iresv3,	iresv4,
		iescap,	iltext,	illink,	ilsymb,	ildefs,	ibits(3) ) fixed bin (26) aligned ;

	/* end of the include file RELBIT */



