/* BEGIN INCLUDE FILE ... relocation_header.incl.pl1 */
/* created 10/30/75 by M. Weaver */

dcl  1 relinfo aligned based,				/* template for a relocation section */
     2 dcl_vers fixed bin,				/* currently = 2 */
     2 n_bits fixed bin,				/* number of relocation bits */
     2 relbits bit(0 refer (relinfo.n_bits)) aligned;

/* END INCLUDE FILE ...relocation_header.incl.pl1 */
