


	/* include file for RETLST */

declare 1 eb_data_$retlst ext aligned,
        2 (nretls, retlst(3) ) fixed bin (17) aligned ;

	/* end if the include file for RETLST */



