/* BEGIN INCLUDE FILE ... retv_dont_use_list.incl.pl1 ... 11/76 */

dcl dontp ptr;

dcl 1 retv_dont_use_list aligned based (dontp),
    2 next fixed bin,
    2 array(1),
      3 volname char(32);

/* END INCLUDE FILE ... retv_dont_use_list.incl.pl1 */
