/* BEGIN INCLUDE FILE RNT.INCL.PL1 - WRITTEN SEPTEMBER 1974 BY R. BRATT */
/* modified July 1976 by R. Bratt; updated March 1977 by M. Weaver */
/* modified November 1977 by M. Weaver to use PL/I offsets instead of pointers */

dcl (rntp, rntep) ptr;
dcl lth fixed bin (17);
dcl based_rnt_area area based;

dcl 1 rnt aligned based (rntp),
    2 areap ptr,					/* pointer to area for rnte allocations */
    2 meters,
      3 insert,
        4 trys fixed bin (17) unaligned,
        4 wins fixed bin (17) unaligned,
      3 get_segno like insert,
      3 get_refnames like insert,
      3 delete_segno like insert,
      3 delete_name like insert,
    2 rnt_area_size fixed bin,
    2 srulep ptr,
    2 name_hash_table (0:127) offset (rnt.areap -> based_rnt_area),
    2 segno_hash_table (0:127) offset (rnt.areap -> based_rnt_area);

dcl 1 rnte aligned based (rntep),
    2 name_fp offset (rnt.areap -> based_rnt_area),
    2 segno_fp offset (rnt.areap -> based_rnt_area),
    (2 segno fixed bin (17),
    2 length fixed bin (17),
    2 name char (lth refer (rnte.length)))unaligned;

/* --------------------END RNT.INCL.PL1--------------------- */
