/*	BEGIN INCLUDE FILE rw_options_extents.incl.pl1

   Extents for the formatting options used for producing reports.
   Kept as a separate include so that some programs may include this
   file without including rw_format_options.incl.pl1

    Al Dupuis - August 1983

*/
/* format: off */
%skip(1);
/* The three types of format options that we have. */
%skip(1);
dcl GENERAL_REPORT_OPTION fixed bin static int options (constant) init (1);
dcl GENERAL_COLUMN_OPTION fixed bin static int options (constant) init (2);
dcl SPECIFIC_COLUMN_OPTION fixed bin static int options (constant) init (3);
%skip(1);
/* Used to determine how big the tables are without doing a hbound on it. */
%skip(1);
dcl NUMBER_OF_GENERAL_COLUMN_OPTIONS_IN_TABLE fixed bin static int options (constant) init (15);
dcl NUMBER_OF_GENERAL_REPORT_OPTIONS_IN_TABLE fixed bin static int options (constant) init (9);
dcl NUMBER_OF_SPECIFIC_COLUMN_OPTIONS_IN_TABLE fixed bin static int options (constant) init (6);
%skip(1);
/* Used to determine how much space is needed to list them. */
%skip(1);
dcl LONGEST_SPECIFIC_COLUMN_OPTION_NAME_LENGTH fixed bin static int options (constant) init (10); /* -alignment */
dcl LONGEST_GENERAL_REPORT_OPTION_NAME_LENGTH fixed bin static int options (constant) init (25); /* -format_document_controls */
dcl LONGEST_GENERAL_COLUMN_OPTION_NAME_LENGTH fixed bin static int options (constant) init (21); /* -group_footer_trigger */
%skip(1);
/* MAXIMUM_OPTION_IDENTIFIER_LENGTH + MAXIMUM_OPTION_NAME_LENGTH */
%skip(1);
dcl MAXIMUM_NORMALIZED_OPTION_NAME_LENGTH fixed bin static int options (constant) init (101);
%skip(1);
dcl MAXIMUM_OPTION_IDENTIFIER_LENGTH fixed bin static int options (constant) init (69);
dcl MAXIMUM_OPTION_NAME_LENGTH fixed bin static int options (constant) init (32);
dcl MAXIMUM_OPTION_VALUE_LENGTH fixed bin static int options (constant) init (4096);
%page;
/* Used to index into the OPTIONS tables defined in rw_format_options.incl.pl1. */
%skip(1);
dcl INDEX_FOR_DELIMITER fixed bin static int options (constant) init (1);
dcl INDEX_FOR_FORMAT_DOCUMENT_CONTROLS fixed bin static int options (constant) init (2);
dcl INDEX_FOR_HYPHENATION fixed bin static int options (constant) init (3);
dcl INDEX_FOR_PAGE_FOOTER_VALUE fixed bin static int options (constant) init (4);
dcl INDEX_FOR_PAGE_HEADER_VALUE fixed bin static int options (constant) init (5);
dcl INDEX_FOR_PAGE_LENGTH fixed bin static int options (constant) init (6);
dcl INDEX_FOR_PAGE_WIDTH fixed bin static int options (constant) init (7);
dcl INDEX_FOR_TITLE_LINE fixed bin static int options (constant) init (8);
dcl INDEX_FOR_TRUNCATION fixed bin static int options (constant) init (9);
%skip(1);
dcl INDEX_FOR_COLUMN_ORDER fixed bin static int options (constant) init (1);
dcl INDEX_FOR_COUNT  fixed bin static int options (constant) init (2);
dcl INDEX_FOR_EXCLUDE fixed bin static int options (constant) init (3);
dcl INDEX_FOR_GROUP fixed bin static int options (constant) init (4);
dcl INDEX_FOR_GROUP_FOOTER_TRIGGER fixed bin static int options (constant) init (5);
dcl INDEX_FOR_GROUP_FOOTER_VALUE fixed bin static int options (constant) init (6);
dcl INDEX_FOR_GROUP_HEADER_TRIGGER fixed bin static int options (constant) init (7);
dcl INDEX_FOR_GROUP_HEADER_VALUE fixed bin static int options (constant) init (8);
dcl INDEX_FOR_OUTLINE fixed bin static int options (constant) init (9);
dcl INDEX_FOR_PAGE_BREAK fixed bin static int options (constant) init (10);
dcl INDEX_FOR_ROW_FOOTER_VALUE fixed bin static int options (constant) init (11);
dcl INDEX_FOR_ROW_HEADER_VALUE fixed bin static int options (constant) init (12);
dcl INDEX_FOR_SUBCOUNT fixed bin static int options (constant) init (13);
dcl INDEX_FOR_SUBTOTAL fixed bin static int options (constant) init (14);
dcl INDEX_FOR_TOTAL fixed bin static int options (constant) init (15);
%skip(1);
dcl INDEX_FOR_ALIGNMENT fixed bin static int options (constant) init (1);
dcl INDEX_FOR_EDITING fixed bin static int options (constant) init (2);
dcl INDEX_FOR_FOLDING fixed bin static int options (constant) init (3);
dcl INDEX_FOR_SEPARATOR fixed bin static int options (constant) init (4);
dcl INDEX_FOR_TITLE fixed bin static int options (constant) init (5);
dcl INDEX_FOR_WIDTH fixed bin static int options (constant) init (6);
%skip(1);
/*    END INCLUDE FILE rw_options_extents */
