/*   BEGIN INCLUDE FILE rw_scroll_info.incl.pl1

   Written - Al Dupuis - August 1983
*/
/* format: off */
%skip(1);
dcl 1 ESCAPE_KEYS aligned static internal options (constant),
      2 FORWARD char (2) init ("f"),
      2 BACKWARD char (2) init ("b"),
      2 LEFT char (2) init ("l"),
      2 RIGHT char (2) init ("r"),
      2 HELP char (2) init ("?"),
      2 SET_KEY char (2) init ("k"),
      2 SET_SCROLL_INCREMENT char (2) init ("i"),
      2 QUIT char (2) init ("q"),
      2 REDISPLAY char (2) init ("d"),
      2 START_OF_REPORT char (2) init ("s"),
      2 END_OF_REPORT char (2) init ("e"),
      2 MULTICS_MODE char (2) init ("m"),
      2 GOTO char (2) init ("g");
%skip(1);
dcl ESCAPE_KEYS_AS_A_TABLE (HIGHEST_DISPLAY_FUNCTION_NUMBER) aligned char (2) based (addr (ESCAPE_KEYS));
%skip(1);
dcl 1 ESCAPE_KEY_MNEMONICS aligned static internal options (constant),
      2 FORWARD char (5) init ("esc-f"),
      2 BACKWARD char (5) init ("esc-b"),
      2 LEFT char (5) init ("esc-l"),
      2 RIGHT char (5) init ("esc-r"),
      2 HELP char (5) init ("esc-?"),
      2 SET_KEY char (5) init ("esc-k"),
      2 SET_SCROLL_INCREMENT char (5) init ("esc-i"),
      2 QUIT char (5) init ("esc-q"),
      2 REDISPLAY char (5) init ("esc-d"),
      2 START_OF_REPORT char (5) init ("esc-s"),
      2 END_OF_REPORT char (5) init ("esc-e"),
      2 MULTICS_MODE char (5) init ("esc-m"),
      2 GOTO char (5) init ("esc-g");
%skip(1);
dcl ESCAPE_KEY_MNEMONICS_AS_A_TABLE (HIGHEST_DISPLAY_FUNCTION_NUMBER) aligned char (5) based (addr (ESCAPE_KEY_MNEMONICS));
%skip(1);
dcl 1 FUNCTION_NAMES aligned static internal options (constant),
      2 FORWARD char (32) init ("forward"),
      2 BACKWARD char (32) init ("backward"),
      2 LEFT char (32) init ("left"),
      2 RIGHT char (32) init ("right"),
      2 HELP char (32) init ("help"),
      2 SET_KEY char (32) init ("set_key"),
      2 SET_SCROLL_INCREMENT char (32) init ("set_scroll_increment"),
      2 QUIT char (32) init ("quit"),
      2 REDISPLAY char (32) init ("redisplay"),
      2 START_OF_REPORT char (32) init ("start_of_report"),
      2 END_OF_REPORT char (32) init ("end_of_report"),
      2 MULTICS_MODE char (32) init ("multics_mode"),
      2 GOTO char (32) init ("goto");
%skip(1);
dcl FUNCTION_NAMES_AS_A_TABLE (HIGHEST_DISPLAY_FUNCTION_NUMBER) aligned char (32) based (addr (FUNCTION_NAMES));
%skip(1);
dcl HIGHEST_DISPLAY_FUNCTION_NUMBER fixed bin static int options (constant) init (13);
%skip(1);
dcl HIGHEST_NUMBERED_FUNCTION_KEY_NEEDED fixed bin static int options (constant) init (9);
%skip(1);
dcl 1 KEY_MNEMONICS aligned static internal options (constant),
      2 FORWARD char (12) init ("down_arrow"),
      2 BACKWARD char (12) init ("up_arrow"),
      2 LEFT char (12) init ("left_arrow"),
      2 RIGHT char (12) init ("right_arrow"),
      2 HELP char (12) init ("f1"),
      2 SET_KEY char (12) init ("f2"),
      2 SET_SCROLL_INCREMENT char (12) init ("f3"),
      2 QUIT char (12) init ("f4"),
      2 REDISPLAY char (12) init ("f5"),
      2 START_OF_REPORT char (12) init ("f6"),
      2 END_OF_REPORT char (12) init ("f7"),
      2 MULTICS_MODE char (12) init ("f8"),
      2 GOTO char (12) init ("f9");
%skip(1);
dcl KEY_MNEMONICS_AS_A_TABLE (HIGHEST_DISPLAY_FUNCTION_NUMBER) aligned char (12) based (addr (KEY_MNEMONICS));
%skip(1);
dcl 1 function_key_info aligned,
      2 forward char (32),			/* down arrow or esc-f */
      2 backward char (32),			/* up arrow or esc-b */
      2 left char (32),			/* left arrow or esc-l */
      2 right char (32),			/* right arrow or esc-r */
      2 help char (32),			/* F1 or esc-? */
      2 set_key char (32),			/* F2 or esc-k */
      2 set_scroll_increment char (32),		/* F3 or esc-i */
      2 quit char (32),			/* F4 or esc-q */
      2 redisplay char (32),			/* F5 or esc-d */
      2 start_of_report char (32),		/* F6 or esc-s */
      2 end_of_report char (32),		/* F7 or esc-e */
      2 multics_mode char (32),		/* F8 or esc-m */
      2 goto char (32);			/* F9 or esc-g */
%skip(1);
dcl keys_as_a_table (HIGHEST_DISPLAY_FUNCTION_NUMBER) char (32) based (addr (scroll_info.keys));
%skip(1);
dcl mnemonic_key_sequences_as_a_table (HIGHEST_DISPLAY_FUNCTION_NUMBER) aligned char (32) based (addr (scroll_info.mnemonic_key_sequences));
%skip(1);
dcl 1 scroll_info aligned based (scroll_ip),
      2 flags,
        3 video_was_already_on bit (1) unaligned,
        3 user_io_was_shrunk bit (1) unaligned,
        3 escapes_in_use bit (1) unaligned,
        3 on_the_last_page bit (1) unaligned,
        3 buffer_boundary_just_crossed bit (1) unaligned,
        3 goto_line_number_pending bit (1) unaligned,
        3 available bit (30) unaligned,
      2 number_of_lines_for_report_display fixed bin,
      2 target_page_number fixed bin (21),
      2 target_line_number fixed bin (35),
      2 left_vertical_position fixed bin,
      2 top_margin_offset fixed bin,
      2 horizontal_scroll_distance fixed bin,
      2 vertical_scroll_distance fixed bin,
      2 last_line_number_in_previous_buffer fixed bin,
      2 user_io_window_position_info_ptr ptr,
      2 report_output_window_position_info_ptr ptr,
      2 display_arg_results_ptr ptr,
      2 area_ptr ptr,
      2 report_control_info_ptr ptr,
      2 function_key_data_pointer ptr,
      2 window_status_info_pointer ptr,
      2 page_info_pointer ptr,
      2 ssu_info_ptr ptr,
      2 format_document_op ptr,
      2 keys like function_key_info,
      2 mnemonic_key_sequences like function_key_info;
%skip(1);
dcl scroll_ip ptr;
%skip(1);
/*   END INCLUDE FILE rw_scroll_info.incl.pl1 */
