/*  BEGIN:   sc_stat_.incl.pl1			  *  *  *  *  *  */


/****^  HISTORY COMMENTS:
  1) change(87-02-04,GDixon), approve(87-05-25,MCR7690),
     audit(87-06-02,Parisek), install(87-08-04,MR12.1-1056):
     Add sc_stat_$vchn_requires_accept in support of DSA virtual channels.
  2) change(87-02-04,GDixon), approve(87-05-25,MCR7680),
     audit(87-06-02,Parisek), install(87-08-04,MR12.1-1056):
     Reorganized by type of data to improve readability.
                                                   END HISTORY COMMENTS */


			      /* ACCESS NAMES		       */
dcl (
 sc_stat_$exec_access_name,	      /* check MC access in an exec request    */
 sc_stat_$unidentified_access_name  /* check access if no one is logged in.  */
    ) char(32) ext static;

		        /* PATHNAMES			       */
dcl (
 sc_stat_$info_dir,	        /* admin info segs directory		       */
 sc_stat_$log_dir,	        /* as log segs directory		       */
 sc_stat_$mc_acs_dir,       /* message coordinator ACS segments (.mcacs) dir */
 sc_stat_$sysdir	        /* system control directory		       */
    ) char(168) ext static;

		        /* OTHER CHAR STRINGS			       */
dcl (
 sc_stat_$master_channel    /* Master TTY channel.		       */
    )  char(6) aligned ext static;

			       /* LABELS			       */
dcl (
 sc_stat_$admin_listener_exit_label, /* GO here to exit admin mode.  Set to  */
			       /*    ssu_$null_label unless 	       */
			       /*	   admin_listener is active.	       */
 sc_stat_$master_abort_label,	       /* GO here after fault that is not      */
			       /*    attributable to a particular      */
			       /*	   command.		       */
 sc_stat_$system_shutdown_label      /* GO here to shut down system	       */
    ) label variable ext static;

			 /* POINTERS TO			       */
dcl (
 sc_stat_$admin_log_iocb,	 /* IOCB for admin log		       */
 sc_stat_$admin_log_write_ptr, /* DATA for log_write_ calls on the admin log */
 sc_stat_$admin_sci_ptr,	 /* DATA ssu_ for terminal currently executing */
 sc_stat_$as_log_write_ptr,	 /* DATA for log_write_ calls on as log, used  */
			 /*      by sys_log_.		       */
 sc_stat_$initzer_ttyp,	 /* ENT  mc_ate for initializer terminal       */
 sc_stat_$master_iocb,	 /* IOCB for "master_i/o"		       */
 sc_stat_$master_sci_ptr,	 /* DATA ssu_ (permanent) for system control   */
 sc_stat_$mc_ansp,		 /* HEAD of mc_anstbl		       */
 sc_stat_$mc_iocb,		 /* IOCB ptr for "mc_i/o"		       */
 sc_stat_$sv1_iocb,		 /* IOCB ptr for "severity1"		       */
 sc_stat_$sv2_iocb,		 /* IOCB ptr for "severity2"		       */
 sc_stat_$sv3_iocb		 /* IOCB ptr for "severity3"		       */
    ) ptr ext static;

			   /* SWITCHES			       */
dcl (
 sc_stat_$Go,		   /* TRUE after answering service is listening*/
 sc_stat_$Go_typed,		   /* TRUE immediately after 'go' is typed     */
 sc_stat_$Multics,		   /* TRUE after answering service started     */
 sc_stat_$Multics_typed,	   /* TRUE immediately after 'mult' is typed   */
 sc_stat_$Star_typed,	   /* TRUE if 'mult' and 'go' came from 'star' */
 sc_stat_$admin_listener_switch, /* TRUE if in the admin listener	       */
 sc_stat_$did_part1,	   /* TRUE if part 1 of system startup ec done */
 sc_stat_$did_part2,	   /* TRUE if part 2 of system startup ec done */
 sc_stat_$did_part3,	   /* TRUE if part 3 of system startup ec done */
 sc_stat_$mc_is_on,		   /* TRUE if message coordinator running      */
 sc_stat_$no_operator_login,	   /* TRUE if operator login not required, or  */
			   /*	 if PNT not yet available.	       */
 sc_stat_$shutdown_typed,	   /* TRUE if 'shutdown' command in progress.  */
 sc_stat_$test_mode,	   /* TRUE if in test environment	       */
 sc_stat_$vchn_requires_accept   /* TRUE if vchn may only be used if accepted*/
			   /*      by operator signed on system console*/
    ) bit(1) aligned ext static;


/*  END OF:  sc_stat_.incl.pl1			  *  *  *  *  *  */
