/* BEGIN INCLUDE FILE ... sdm_original_messages.incl.pl1 */
/* Created:  August 1983 by G. Palter */

/* Definition of the list of original messages for which this message is a reply:  send_mail must keep track of this list
   separately from the copy in the message itself as, when qedx/apply -header is used, the mail system can not convert the
   printed representation of the In-Reply-To field back into its internal form; therefore, send_mail will delete the the
   list of reply references from the message before allowing the user to edit the message and will restore the list on
   return from the editor.  This list is also used by callers of the send_mail subsystem (ie: read_mail's reply request)
   to supply the initial content for the reply references of the message; if requested, send_mail will extract the message
   body from these message(s) for inclusion in the body of the message being created by the user */

dcl  1 original_messages aligned based (original_messages_ptr),
       2 version character (8) unaligned,
       2 pad bit (36),
       2 n_original_messages fixed binary,		/* # of original messages listed herein */
       2 messages (original_messages_n_original_messages refer (original_messages.n_original_messages)),
         3 message_ptr pointer,			/* ... -> the message */
         3 message_idx fixed binary,			/* ... # assigned to the message by read_mail */
         3 pad bit (36);

dcl  ORIGINAL_MESSAGES_VERSION_1 character (8) static options (constant) initial ("sdmoml01");

dcl  original_messages_n_original_messages fixed binary;	/* required to allocate the above structure */

dcl  original_messages_ptr pointer;


/* END INCLUDE FILE ... sdm_original_messages.incl.pl1 */
