/* BEGIN INCLUDE FILE ... sdm_text_mgr_constants.incl.pl1 */
/* Created: 31 December 1978 by G. Palter */

/* Constants used by sdm_text_mgr_ to communicate the type of input terminator read from the terminal */

dcl (NORMAL_TERMINATION	initial (1),		/* '.': transmit the message */
     ENTER_REQUEST_LOOP	initial (2),		/* '\fq': enter request loop */
     ENTER_EDITOR		initial (3))		/* '\f...': enter editor */
	fixed binary static options (constant);

/* END INCLUDE FILE ... sdm_text_mgr_constants.incl.pl1 */
