/* BEGIN INCLUDE FILE ... send_mail_options.incl.pl1 */
/* Created:  28 December 1978 by G. Palter */
/* Modified: 25 April 1980 by G. Palter for version 2 -- abbrev processing */
/* Modified: 27 January 1981 by G. Palter for version 3 -- increased prompt string length */
/* Modified: 16 February 1982 by G. Palter for version 4 -- default profile in addition to current profile */
/* Modified: 17 September 1982 by G. Palter for version 5 -- new definition of -fill, -debug, and making -fill/-rql
      dependent on mode of message input (terminal/file) */
/* Modified: August 1983 by G. Palter for version 6 -- elimination of -header and -message_id (always ON), elimination of
      -no_abort as the command line -abort/-no_abort no longer sets the default for the send request control argument,
      addition of -auto_write/-no_auto_write as required by the MCR boards, and addition of options pertaining to
      treatment of the original message(s) text when invoked by a reply request */

/* User settable options of the send_mail subsystem */

dcl 1 send_mail_options aligned based (send_mail_options_ptr),
      2 version character (8) unaligned,

      2 fill_width fixed binary,			/* default width for filling */

      2 prompt_control aligned,			/* controls how send_mail prompts */
        3 prompt_string character (64) varying,		/* ... user-supplied string */
        3 flags aligned,
	4 prompt_control bit (2) unaligned,		/* ... default prompt/use above string/don't prompt */
	4 pad bit (34) unaligned,

      2 default_profile_ptr pointer,			/* -> default profile to be used if flags.abbrev is ON */
      2 profile_ptr pointer,				/* -> profile to be used if flags.abbrev is ON */

      2 original_text_control aligned,			/* controls send_mail's treatment of original message text */
        3 original_text_indentation fixed binary,		/* ... # of columns to indent the text if requested */
        3 flags,
	4 include_original_text bit (1) unaligned,	/* ... ON => text from message(s) being answered is to be
						       included in the reply before the actual answer */
	4 indent_original_text bit (1) unaligned,	/* ... ON => the original text is to be indented */
	4 fill_original_text bit (1) unaligned,		/* ... ON => the original text is to be re-filled */
	4 pad bit (33) unaligned,

      2 flags aligned,
        3 acknowledge bit (1) unaligned,		/* ON => user wants acknowledgement from recipients */
        3 brief bit (1) unaligned,			/* ON => suppress "Mail delivered..." messages */
        3 notify bit (1) unaligned,			/* ON => send each recipient a wakeup */
        3 abbrev bit (1) unaligned,			/* ON => use abbrev processing in this invocation */
        3 debug bit (1) unaligned,			/* ON => enable debugging features */
        3 auto_write bit (1) unaligned,			/* ON => qedx request automatically rewrites on quit (sigh) */
        3 fill_control bit (2) unaligned,		/* default/explicit -fill/explicit -no_fill */
        3 request_loop_control bit (2) unaligned,		/* default/explicit -rql/explicit -nrql */
        3 pad bit (26) unaligned;

dcl  send_mail_options_ptr pointer;

dcl  SEND_MAIL_OPTIONS_VERSION_6 character (8) static options (constant) initial ("sdmopt06");


/* Prompt control options */

dcl (DEFAULT_PROMPT		initial ("00"b),		/* use default subsystem prompt */
     USE_PROMPT_STRING	initial ("01"b),		/* use prompt string supplied by user (via -prompt STR) */
     NO_PROMPT		initial ("10"b))		/* disable subsystem prompt */
	bit (2) static options (constant);


/* Fill control options */

dcl (DEFAULT_FILL		initial ("00"b),		/* fill if terminal input; do not fill if file input */
     FILL			initial ("01"b),		/* user specified -fill */
     NO_FILL		initial ("10"b))		/* user specified -no_fill */
	bit (2) static options (constant);


/* Request loop control options */

dcl (DEFAULT_REQUEST_LOOP	initial ("00"b),		/* enter loop if file input; do not enter if terminal input */
     REQUEST_LOOP		initial ("01"b),		/* user specified -request_loop */
     NO_REQUEST_LOOP	initial ("10"b))		/* user specified -no_request_loop */
	bit (2) static options (constant);

/* END INCLUDE FILE ... send_mail_options.incl.pl1 */
