/* BEGIN INCLUDE FILE ... set_prompt_info.incl.pl1 */

/* Created 3/13/79 by J. Stern */


dcl  sp_infop ptr;
dcl  sp_info_version_1 fixed bin static options (constant) init (1);

dcl 1 sp_info aligned based (sp_infop),			/* info structure for set_prompt control order */
      2 version fixed bin,
      2 message char (3) varying;			/* text of prompt message */


/* END INCLUDE FILE ... set_prompt_info.incl.pl1 */
