/* BEGIN INCLUDE FILE ... sort_merge_pars.incl.pl1 */

/*	input_file_max = maximum number of input files for sort-merge */


	dcl 1 attach_array(0:10 /*input_file_max*/),
	    2 count fixed bin(17),
	    2 desc char(168);

	dcl input_file(10 /*input_file_max*/) char(256);

/* END INCLUDE FILE ... sort_merge_pars.incl.pl1 */
