/* BEGIN INCLUDE FILE ... ssu_request_tables_list.incl.pl1 */
/* Created:  8 December 1981 by G. Palter */

/* The list of request tables in use by a subsystem invocation */


dcl 1 request_tables_list aligned based (rtl_ptr),
      2 header,
        3 version fixed binary,			/* version of this structure */
        3 n_tables fixed binary,			/* # of request tables in the list */
      2 tables (request_tables_list_n_tables refer (request_tables_list.n_tables)),
        3 table_ptr pointer,				/* -> this request table */
        3 flags,
	4 table_valid bit (1) unaligned,		/* "1"b => this request table is valid */
	4 pad bit (35) unaligned,
        3 pad bit (36);

dcl  rtl_ptr pointer;

dcl  request_tables_list_n_tables fixed binary;		/* for allocating the above structure */

dcl  REQUEST_TABLES_LIST_VERSION_1 fixed binary static options (constant) initial (1);

/* END INCLUDE FILE ... ssu_request_tables_list.incl.pl1 */
