dcl (	callers_stack	init(16),		/* ptr to caller's stack frame */
	language_id_code	init(24),		/* identifies pl/1 */
	entry_descriptor	init(2),		/* ptr to entry descriptor in text */
	display_ptr	init(32),
	int_static_ptr	init(34),
	linkage_ptr	init(36),
	reset_next_ptr	init(0),		/* initial value of next sp */
	enabled_on_units	init(38),
	long_string_loc	init(40),		/* loc of long_string_temp */
	invocation_count	init(42),
	double_temp_loc	init(46),		/* loc of double_temp */
	complex_ac_loc	init(56),
	param_array	init(64))
				fixed bin(15) int static options(constant);
