/* BEGIN include file state_equs.incl.pl1 */

/* States of aptes, created from alm version be Keith Loepere, November 1983. */

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

dcl  Empty_apte		        bit (18) unal init ("000000"b3) static options (constant);
dcl  Running_apte		        bit (18) unal init ("000001"b3) static options (constant);
dcl  Ready_apte		        bit (18) unal init ("000002"b3) static options (constant);
dcl  Waiting_apte		        bit (18) unal init ("000003"b3) static options (constant);
dcl  Blocked_apte		        bit (18) unal init ("000004"b3) static options (constant);
dcl  Stopped_apte		        bit (18) unal init ("000005"b3) static options (constant);
dcl  Ptlocking_apte		        bit (18) unal init ("000006"b3) static options (constant);


/* END include file state_equs.incl.pl1 */
