/* --------------- BEGIN include file status_for_backup.incl.pl1 --------------- */


/****^  HISTORY COMMENTS:
  1) change(86-05-20,Lippard), approve(86-06-02,MCR7427),
     audit(86-06-17,Farley), install(86-06-17,MR12.0-1077):
      Change non-returned information into pad fields.
                                                   END HISTORY COMMENTS */


dcl 1 status_for_backup aligned based,
    2 version fixed bin,
    2 pad1 bit (108),
    2 switches unaligned,
      3 safety bit (1) unaligned,
      3 entrypt bit (1) unaligned,
      3 security_oosw bit (1) unaligned,
      3 audit_flag bit (1) unaligned,
      3 multiple_class bit (1) unaligned,
      3 pad2 bit (2) unaligned,
      3 master_dir bit (1) unaligned,
      3 tpd bit (1) unaligned,
      3 pad13 bit (13) unaligned,
    2 entrypt_bound bit (14) unaligned,
    2 access_class bit (72),
    2 spad bit (36),
    2 author char (32),
    2 bc_author char (32),
    2 lvid bit (36),
    2 pvid bit (36),
    2 pad3 bit (216);

dcl  status_for_backup_version_2 fixed bin initial (2) static options (constant);

/* ---------------- END include file status_for_backup.incl.pl1 ---------------- */
