/* -------- BEGIN include file status_dcl.incl.pl1 ---------------- */

dcl 1 status aligned,
      2 status_code fixed bin (35) aligned,
      2 status_flags unaligned,
        3 (pad1 (9),
           logical_end,
           physical_end,
           pad2 (4),
           stream_detached,
           pad3 (2)) bit (1) unaligned,
      2 transaction_id bit (18) unaligned;

/* --------- END include file status_dcl.incl.pl1 ----------------- */
