dcl       1 statement                   based(p),           /* statement node description */
          2 node_type                   fixed bin(15),
          2 stmnt_type                  fixed bin(15),
          2 reference_count             fixed bin(15),
          2 source_id                   fixed bin(31),
          2 sub_stmnt_id                fixed bin(15),
          2 prefix                      bit(12),
	2 optimized		bit(1),
          2 back                        ptr,
          2 next                        ptr,
          2 next_of_kind                ptr,
          2 root                        ptr,
          2 labels                      ptr,
          2 reference_list              ptr;
