/* BEGIN INCLUDE FILE ... symbol_bits.incl.pl1 */

dcl (	aliasable_bit	initial (72),
	passed_as_arg_bit	initial (74),
	set_bit		initial (76),
	overlayed_by_builtin_bit initial (87)) fixed bin (15) internal static options (constant);

/* END INCLUDE FILE ... symbol_bits.incl.pl1 */
