/* BEGIN INCLUDE FILE .. syserr_binary_def.incl.pl1 */

/* This include file has an ALM version, keep 'em in sync. */

/* format: off */

/* Modified January 1984 by Paul Farley to add an array of entry values
   to be examined by display_cpu_error. */
/* Modified October 1984 by EJ Sharpe to include SB_audit_message */
/* Modified January 1985 by EJ Sharpe for SB_char_data_classes */
/* Modified 1985-01-25, BIM: added ring alarm audit support. */
/* Modified 1985-02-20, EJ Sharpe: added SB_ibm3270_mde, syserr_binary_(seg vol)damage_class,
		also changed some codes to "SB_unused_NN" - see line comments */

/* In the future, these will be the only constants needed in this include
file.  They are the binary data class strings for messages in the new format
syserr logs.  The names are all of the form SB_ZZZZZZZ_data_class where
ZZZZZZZ is the value of the data class string.  Message expanders are named
expand_ZZZZZZZ_msg_ and are referenced by the log perusal tools. */

dcl (						/* include file name */
SB_io_status_data_class	init ("io_status"),		/* io_syserr_msg */
SB_hwfault_data_class	init ("hwfault"),		/* syserr_fault_msg */
SB_mos_data_class		init ("mos"),		/* scr */
SB_segdamage_data_class	init ("segdamage"),		/* segdamage_msg */
SB_voldamage_data_class	init ("voldamage"),		/* segdamage_msg (first two words) */
SB_mdc_del_uidpath_data_class	init ("mdc_del_uidpath"),	/* none - 16 word UID path */
SB_mmdam_data_class		init ("mmdam"),		/* syserr_mmdam_msg */
SB_mpc_poll_data_class	init ("mpc_poll"),		/* poll_mpc_data */
SB_fnp_poll_data_class	init ("fnp_poll"),		/* poll_fnp_data */
SB_config_deck_data_class	init ("config_deck"),	/* config_deck */
SB_vtoce_data_class		init ("vtoce"),		/* vtoce */
SB_access_audit_data_class	init ("access_audit"),	/* access_audit_bin_header */
SB_ibm3270_mde_data_class	init ("ibm3270_mde")	/* ibm3270_mpx_data */
) static internal char (16) varying options (constant);


/************************
Once the syserr$binary is replaced with something that takes real data classes
and all system modules and tools are upgraded to use the new interface, the
rest of this include file may be discarded.
************************/

/* The limit of 36 is arbitrary- there is no reason that it can not be
   extended at any time. */

dcl (
SB_disk_err	init (1),		SBL_disk_err	init (5),
SB_hw_fault	init (2),		SBL_hw_fault	init (176),
SB_io_err		init (3),		SBL_io_err	init (5),
SB_unused_4	init (4),		SBL_unused_4	init (1),	/* was "mos_poll" (mos poll time) */
SB_mos_err	init (5),		SBL_mos_err	init (2),	/* mos memory error data */
SB_unused_6	init (6),		SBL_unused_6	init (1),	/* was "bulk_status" (bulk dcb status) */
SB_unused_7	init (7),		SBL_unused_7	init (1), /* was "bulk_csb" (bulk csb status) */
SB_unused_8	init (8),		SBL_unused_8	init (3), /* was "free_st_1" */
SB_unused_9	init (9),		SBL_unused_9	init (2), /* was "free_st_2" */
SB_unused_10	init (10),	SBL_unused_10	init (21), /* was "unpr_add" */
SB_zerpag		init (11),	SBL_zerpag	init (20),
SB_unused_12	init (12),	SBL_unused_12	init (20), /* was "unpr_add" */
SB_vtoc_salv_dam	init (13),	SBL_vtoc_salv_dam	init (20),
SB_unused_14	init (14),	SBL_unused_14	init (20), /* was "page_rw_err" */
SB_unused_15	init (15),	SBL_unused_15	init (3), /* was "ruad" */
SB_random_segdamage	init (16),	SBL_random_segdamage init (20),
SB_read_nc	init (17),	SBL_read_nc	init (2),
SB_unused_18	init (18),	SBL_unused_18	init (2), /* was "vtoc_err" */
SB_mdc_del_uidpath	init (19),	SBL_mdc_del_uidpath	init (16),
SB_ocdcm_err	init (20),	SBL_ocdcm_err	init (5),
SB_mmdam		init (21),	SBL_mmdam		init (2),
SB_verify_lock	init (22),	SBL_verify_lock	init (176),
SB_io_err_detail	init (23),	SBL_io_err_detail	init (11),
SB_mpc_poll	init (24),	SBL_mpc_poll	init (256) /* max */,
SB_fnp_poll	init (25),	SBL_fnp_poll	init (256) /* max */,
SB_config_deck	init (26),	SBL_config_deck	init (256) /* 16 cards at 16 words */,
SB_vtoce		init (27),	SBL_vtoce		init (192),    /* 1 VTOCE */
SB_access_audit	init (28),	SBL_access_audit	init (256), /* max */
SB_ibm3270_mde	init (35),	SBL_ibm3270_mde	init (256), /* max */
SB_end_of_table	init (36),	SBL_end_of_table	init (1)
  ) internal static options (constant) fixed bin;


/* The following array is a mapping of the old syserr$binary codes into the
new data classes for MR11.  It is primarily used by syserr_copy to translate
the binary data codes stored in the wired syserr log (see above) into the data
classes needed by the ring-0 paged syserr log which is a new format log.  It
is also used by syserr_log_util_ to translate the data classes back into the
corresponding binary code (for tools not yet upgraded to deal with the new
format log messages). */

dcl SB_char_data_classes (36) char (16) varying internal static options (constant)
	init (	"io_status",		/* 1 */
		"hwfault",		/* 2 */
		"io_status",		/* 3 */
		"unused_4",		/* 4 */
		"mos",			/* 5 */

		"unused_6",		/* 6 */
		"unused_7",		/* 7 */
		"unused_8",		/* 8 */
		"unused_9",		/* 9 */ 
		"unused_10",		/* 10 */

		"segdamage",		/* 11 */
		"unused_12",		/* 12 */
		"segdamage",		/* 13 */
		"unused_14",		/* 14 */
		"unused_15",		/* 15 */

		"segdamage",		/* 16 */
		"voldamage",		/* 17 */
		"unused_18",		/* 18 */
		"mdc_del_uidpath",		/* 19 */
		"io_status",		/* 20 */

		"mmdam",			/* 21 */
		"hwfault",		/* 22 */
		"io_status",		/* 23 */
		"mpc_poll",		/* 24 */
		"fnp_poll",		/* 25 */

		"config_deck",		/* 26 */
		"vtoce",			/* 27 */
		"access_audit",		/* 28 */
		"unused_29",		/* 29 */
		"unused_30",		/* 30 */
		"unused_31",		/* 31 */
		"unused_32",		/* 32 */
		"unused_33",		/* 33 */
		"unused_34",		/* 34 */
		"ibm3270_mde",		/* 35 */
		"unused_36"		/* 36 */
	);


/* format: on */

/* These constants are used by various tools which analyze syserr messages and
still call the old interface "syserr_log_util_". */

     dcl	   syserr_binary_mos_mask init ("060000000000"b3) bit (36) static options (constant);
     dcl	   syserr_binary_seg_damage_mask init ("000374000000"b3) bit (36) static options (constant);
     dcl	   syserr_binary_vol_damage_mask init ("003413000000"b3) bit (36) static options (constant);
     dcl	   syserr_binary_address_damage_mask init ("002010000000"b3) bit (36) static options (constant);

     dcl	   display_cpu_error_binary_defs (2) init (
			      2,			/** SB_hw_fault */
			      22			/** SB_verify_lock */
			      ) internal static options (constant) fixed bin;

/* END INCLUDE FILE syserr_binary_def.incl.pl1 */
