/* BEGIN INCLUDE FILE ... system_forms_info.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(88-02-26,Brunelle), approve(88-06-08,MCR7911),
     audit(88-10-12,Wallman), install(88-10-28,MR12.2-1199):
     Created.
                                                   END HISTORY COMMENTS */

/* format: style4 */

/* input structure for call to iod_info_$evaluate_forms_info */

dcl  evaluate_forms_info_input_ptr ptr;
dcl  1 evaluate_forms_info_input aligned based (evaluate_forms_info_input_ptr),
       2 version char (8),
       2 ithp ptr,					/* ptr to io daemon tables */
       2 qgtep ptr,					/* request type entry ptr */
       2 idtep ptr,					/* major device entry ptr */
       2 mdtep ptr,					/* minor device entry ptr */
       2 max_forms_string_length fixed bin,		/* max allowed size of forms string */
       2 forms_string_length fixed bin,			/* # of chars in forms string */
       2 forms_string char (system_input_forms_string_length/* forms string to evaluate */
	  refer (evaluate_forms_info_input.forms_string_length)),
       2 area_ptr ptr;				/* ptr to user area */
dcl  system_input_forms_string_length fixed bin;
dcl  EVALUATE_FORMS_INFO_INPUT_VERSION_1 char (8) int static options (constant) init ("EFII0001");


/* output structure for call to iod_info_$evaluate_forms_info */

dcl  evaluate_forms_info_output_ptr ptr;
dcl  1 evaluate_forms_info_output aligned based (evaluate_forms_info_output_ptr),
       2 version char (8),
       2 lines_per_page fixed bin,
       2 chars_per_line fixed bin,
       2 lines_per_inch fixed bin,
       2 forms_length fixed bin,
       2 error_length fixed bin,
       2 escape_length fixed bin,
       2 special_length fixed bin,
       2 returned_forms char (system_returned_forms_length
	  refer (evaluate_forms_info_output.forms_length)),
       2 error_string char (system_error_string_length
	  refer (evaluate_forms_info_output.error_length)),
       2 escape_string char (system_escape_string_length
	  refer (evaluate_forms_info_output.escape_length)),
       2 special_string char (system_special_string_length
	  refer (evaluate_forms_info_output.special_length));

dcl  (system_returned_forms_length, system_error_string_length,
     system_escape_string_length, system_special_string_length) fixed bin;

dcl  EVALUATE_FORMS_INFO_OUTPUT_VERSION_1 char (8) int static options (constant) init ("EFIO0001");

/* END INCLUDE FILE ... system_forms_info.incl.pl1 */
