/* BEGIN INCLUDE FILE tape_ioi_constants.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(87-08-18,Hartogs), approve(87-08-18,MCR7726),
     audit(87-08-27,GWMay), install(87-08-27,MR12.1-1094):
     Initial coding.
                                                   END HISTORY COMMENTS */

/*         This include file contains the mnemonic command names for the dcw commands used 
           by tape_ioi_. */

dcl      BACKSPACE_ONE_RECORD	  bit (6) static options (constant) init ("46"b3);
dcl      CONTINUE_NO_MARKER	  bit (2) static options (constant) init ("10"b);
dcl      ERASE_COMMAND	  bit (6) static options (constant) init ("54"b3);
dcl      MAX_READ_OPT           bit (6) static options (constant) init ("37"b3);
dcl      NO_CONTINUE_NO_MARKER  bit (2) static options (constant) init ("00"b);
dcl      NONDATA_TRANSFER	  bit (6) static options (constant) init ("02"b3);
dcl      ONE_COUNT		  bit (6) static options (constant) init ("01"b3);
dcl      RELATIVE_MODE	  bit (1) static options (constant) init ("1"b);
dcl      RELATIVE_SECONDS	  bit (2) static options (constant) init ("11"b);
dcl      REWIND_COMMAND	  bit (6) static options (constant) init ("70"b3);
dcl      TDCW_TYPE		  bit (2) static options (constant) init ("10"b);
dcl      TEN_SECONDS	  fixed bin (71) static options (constant) init (10000000);
dcl      TWO_MINUTES	  fixed bin (71) static options (constant) init (120);

/* END INCLUDE FILE tape_ioi_constants.incl.pl1 */
