/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */
/* Begin include file task_condition_info.incl.pl1 */

dcl  1 finish_info aligned based,
       2 header like condition_info_header,
       2 type char (8);

dcl  1 task_debug_info aligned based,
       2 header like condition_info_header;

%include condition_info_header;

/* End include file task_condition_info.incl.pl1 */
