/* begin include file tc_desk_info_.incl.pl1 BIM June 1981 */
/* Modified 1 October 1983 by Jon A. Rochlis to add support for partial
   screen width windows */
/* Modified 28 March 1984 by JR to add window_iocb_ptr so tc_ can inform
   window_ of events such as reconnection, by doing  set_window_status control
   orders. */

/* internal interface */

/* format: style2,linecom,^indnoniterdo,indcomtxt,^inditerdo,dclind5,idind25 */
/* requests to desk management, first pass implementation */

     declare tc_desk_info_ptr	        pointer;
     declare 1 tc_desk_window_info    aligned based (tc_desk_info_ptr),
	     2 first_row	        fixed bin,		/* top row of window */
	     2 n_rows	        fixed bin,		/* How many rows */
	     2 first_column	        fixed bin,	          /* Fist column of window */
	     2 n_columns	        fixed bin,	          /* How many columns */
	     2 window_id	        bit (36) aligned,
	     2 window_iocb_ptr      ptr;

/* used in calls to terminal control to establish rearrange,
   and inquire about windows */

/* end include file tc_desk_info_.incl.pl1 */
