/* BEGIN INCLUDE FILE ..... tederror_.incl.pl1 ..... 09/02/76 J Falksen      */

dcl tederror_	entry(ptr, char(168)var);
dcl tederror_rc_	entry(ptr, char(168)var,fixed bin(35));

dcl msg		char(168)var;
dcl msg_ptr	ptr;

/* END INCLUDE FILE ..... tederror_.incl.pl1 .....			       */
