/*  BEGIN INCLUDE FiLE ... terminal_info.incl.pl1 */

/* Created 5/25/77 by J. Stern */


dcl 1 terminal_info aligned based (terminal_info_ptr),	/* info structure for terminal_info order */
      2 version fixed bin,				/* version number of this sturcture */
      2 id char (4) unaligned,			/* terminal id from answerback */
      2 term_type char (32) unaligned,			/* terminal type name */
      2 line_type fixed bin,				/* line type number */
      2 baud_rate fixed bin,
      2 reserved (4) fixed bin;			/* reserved for future use */


dcl  terminal_info_ptr ptr;
dcl  terminal_info_version fixed bin int static options (constant) init (1); /* current version */


/* END INCLUDE FILE ... terminal_info.incl.pl1 */
