/* BEGIN INCLUDE FILE ..... time_offset.incl.pl1 ..... 08/23/79 J Falksen */

/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *   */
/*							       */
/* Name:  time_offset.incl.pl1				       */
/*							       */
/* 1) This structure provides input to date_time_$offset_to_clock.	       */
/*  Both integer and real fields may be supplied. Each field containing data */
/*  must have its use bit set.  All values may be positive or negative.      */
/*  a) dw is applied first.					       */
/*  b) The size of a year is dependant upon WHICH year.  The base year is    */
/*   determined.  The (adjusted) clock value is the reference for this.      */
/*   The integral years (whether from fixed, float, or both) are added to    */
/*   this base year.  The new base year is used to determine what value the  */
/*   fraction is applied to.					       */
/*  c) The size of a month is dependant upon WHICH month of WHICH year.      */
/*   The base year/month is determined.  The (adjusted) clock value is the   */
/*   reference for this.  The integral months are added to this base month,  */
/*   forming a new base year/month.  The new base month in used to determine */
/*   value the fraction is applied to.				       */
/*  d) Values smaller than a month are added "in parallel" because their     */
/*   size is always constant (leap-seconds ignored).		       */
/*							       */
/* 2) This structure receives output from date_time_$from_clock_interval.    */
/*  time_offset.dw is not used.  The input values in val are ignored; they   */
/*  are reset.  flag specifies the units in which the output is to be	       */
/*  expressed and whether the fractional amount is desired. If only the      */
/*  smallest unit is set to receive the fraction it leaves the structure in  */
/*  a state that it may be given to $offset_to_clock without modification.   */
/*							       */
/* Status							       */
/* 06/07/83 jaf 0) Created					       */
/* 84-11-19 jaf 1) Changed the form of the dw field, added named constants   */
/*							       */
/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *   */

dcl 1 time_offset	aligned based(Ptime_offset),
      2 version	char (8),
      2 flag,
        3 yr	fixed bin,
        3 mo	fixed bin,
        3 wk	fixed bin,
        3 da	fixed bin,
        3 hr	fixed bin,
        3 min	fixed bin,
        3 sec	fixed bin,
        3 Usec	fixed bin,
      2 val,
        3 yr	float dec (20),	/* years			       */
        3 mo	float dec (20),	/* months			       */
        3 wk	float dec (20),	/* weeks			       */
        3 da	float dec (20),	/* days			       */
        3 hr	float dec (20),	/* hours			       */
        3 min	float dec (20),	/* minutes		       */
        3 sec	float dec (20),	/* seconds		       */
        3 Usec	float dec (20),	/* microseconds		       */
      2 dw,
        3 flag	fixed bin,	/* how to select day, if at all      */
        3 val	fixed bin;	/* Day of the week (1=Mon...7=Sun).  */

/**** time_offset.flag settings for $offset_to_clock		       */
dcl (UNUSED	init (0),	/* this offset unit is unused		       */
     USED		init (1), /* this offset unit has a value	       */
/**** time_offset.flag settings for $from_clock_interval		       */
/****UNUSED	init (0),	/* this offset unit is unused		       */
     INTEGER	init (1),	/* return interval unit as an integer	       */
     FRACTION	init (2),	/* return interval unit as integer+fraction    */
/**** offset.dw.flag settings for $offset_to_clock. Tells how to select the  */
			/* day given in offset.dw.val		       */
     BEFORE	init (-2),/*        before day given in clock_in	       */
     ON_OR_BEFORE	init (-1),/*  on or before day given in clock_in	       */
/****UNUSED	init (0),	/*     don't apply day of week offset	       */
     ON_OR_AFTER	init (1),	/*  on or after  day given in clock_in	       */
     AFTER	init (2)	/*        after  day given in clock_in	       */
    )		fixed bin int static options (constant);

dcl  Ptime_offset	ptr,
     Vtime_offset_2	char (8) int static options(constant) init("timeoff2");

/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *   */
/*							       */
/* Name:  time_offset_array_.incl.pl1				       */
/*							       */
/* This is an array form of time_offset.			       */
/*							       */
/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *   */

dcl 1 time_offset_array	aligned based(Ptime_offset),
    2 version		char (8),
    2 flag		(8) fixed bin,
    2 val			(8) float dec (20),
    2 dw,
      3 (flag, val) 	fixed bin;

/* END INCLUDE FILE ..... time_offset.incl.pl1 ..... */
