/* Begin include file ... track_header_info.incl.pl1 */
/* Created 11/79 by Michael R. Jordan to describe format data for new style format command */

dcl  thi_ptr ptr;
dcl  thi_version_1 fixed bin static options (constant) init (1);

dcl 1 thi aligned based (thi_ptr),
    2 version fixed bin,
    2 msu4xx_info aligned,
      3 cyl fixed bin (16) unsigned unal,
      3 head fixed bin (16) unsigned unal,
      3 pad1 bit (2) unal,
      3 ti fixed bin (2) unsigned unal,
      3 pad2 bit (4) unal,
      3 flag_byte bit (8) unal,
      3 alt_cyl fixed bin (16) unsigned unal,
      3 alt_head fixed bin (16) unsigned unal,
      3 alt_rec fixed bin (8) unsigned unal,
      3 pad3 bit (128) unal,
    2 msu5xx_info aligned,
      3 c0 unal,
        4 flags unal,
	5 large_records bit (1) unal,
	5 honeywell_formatted bit (1) unal,
	5 format_complete bit (1) unal,
	5 pad bit (2) unal,
	5 log_track bit (1) unal,
	5 ti fixed bin (2) unsigned unal,
        4 cyl_lower fixed bin (8) unsigned unal,
        4 cyl_upper fixed bin (2) unsigned unal,
        4 head fixed bin (6) unsigned unal,
        4 rec fixed bin (8) unsigned unal,
        4 skip (1:2) unal,
	5 used bit (1) unal,
	5 gap_following_count bit (1) unal,
	5 gap_following_data bit (1) unal,
	5 gap_between_index_and_c0 bit (1) unal,
	5 displacement fixed bin (12) unsigned unal,
        4 alt_cyl_lower fixed bin (8) unsigned unal,
        4 alt_cyl_upper fixed bin (2) unsigned unal,
        4 alt_head fixed bin (6) unsigned unal,
        4 t_skip (1:3) unal,
	5 hex_80 bit (8) unal,
	5 distance fixed bin (8) unsigned unal,
        4 pad4 bit (8) unal,
        4 cf bit (8) unal,
      3 c (1:39) unal,
        4 flags unal,
	5 large_records bit (1) unal,
	5 honeywell_formatted bit (1) unal,
	5 format_complete bit (1) unal,
	5 pad bit (2) unal,
	5 log_track bit (1) unal,
	5 ti fixed bin (2) unsigned unal,
        4 cyl_lower fixed bin (8) unsigned unal,
        4 cyl_upper fixed bin (2) unsigned unal,
        4 head fixed bin (6) unsigned unal,
        4 rec fixed bin (8) unsigned unal,
        4 skip (1:2) unal,
	5 used bit (1) unal,
	5 gap_following_count bit (1) unal,
	5 gap_following_data bit (1) unal,
	5 pad bit (1) unal,
	5 displacement fixed bin (12) unsigned unal,
        4 cf bit (8) unal;

/* End include file ... track_header_info.incl.pl1 */
