/* BEGIN INCLUDE FILE...tty_channel_meters.incl.pl1 */

/* Include file to define structure for meters specific to tty (non-multiplexed) channels */
/* Programs that include this file must also include tcb.incl.pl1. */

/* Created February 1981 by Robert Coren */

dcl  tty_meterp pointer;

dcl TTY_CHANNEL_METERS_VERSION_1 int static options (constant) init (1);

dcl 1 tty_channel_meters aligned based (tty_meterp),
    2 version fixed bin,
    2 flags,
      3 breakall bit (1) unaligned,
      3 echoplex bit (1) unaligned,
      3 padb bit (34) unaligned,
    2 last_dialed_time fixed bin (71),			/* time channel last dialed up */
    2 baud_rate fixed bin,
    2 user_process bit (36),				/* = wtcb.uproc */ 
    2 current_meters like tcb.cumulative_meters,		/* meters accumulated for the "life" of the channel */
    2 saved_meters like tcb.cumulative_meters;		/* meters saved when channel most recently dialed up */

/* END INCLUDE FILE...tty_channel_meters.incl.pl1 */
