/*  START OF:	tty_control_orders_info.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
/* format: style2 */

dcl  tty_old_type	        fixed bin based;		/* terminal type number for set_type order */

dcl  1 tty_send_initial_string_info
		        aligned based,		/* info structure for send_initial_string order */
       2 version	        fixed bin,
       2 initial_string     char (512) varying;

dcl  1 tty_info	        aligned based,
       2 id	        char (4),
       2 baudrate	        fixed bin unal,
       2 reserved	        bit (54) unal,
       2 type	        fixed bin;

dcl  1 tty_modes_info       based aligned,
       2 mode_length        fixed bin,
       2 modes	        char (tty_modes_info.mode_length);

/*  END OF:	tty_control_orders_info.incl.pl1	  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  */
