/* BEGIN INCLUDE FILE...  tty_video_tables.incl.pl1 */
/* Created:  3 June 1979 by Bernard S. Greenberg */
/* Modified: 9 June 1981 by G. Palter to switch to line/column orientation */

/* Definition of the video operations supported by a terminal */

dcl  tty_video_tables_version_1 fixed binary static options (constant) initial (1);

dcl  ttyvtblp pointer;
dcl  tty_video_table_video_chars_len fixed binary (21);

dcl 1 tty_video_table aligned based (ttyvtblp),
      2 version fixed binary initial (tty_video_tables_version_1),
      2 screen_height fixed binary,			/* # of lines on screen */
      2 screen_line_length fixed binary,		/* # of characters on a line */
      2 scroll_count fixed binary,			/* # of lines scrolled by LF at bottom */
      2 flags,
        3 overstrike_available bit (1) unaligned,		/* ON => overstrike works */
        3 automatic_crlf bit (1) unaligned,		/* ON => automatically goes to next line from last column */
        3 simulate_eol bit (1) unaligned,		/* ON => program must simulate clear-to-end-of-line */
        3 pad bit (33) unaligned,
      2 video_chars_len fixed binary (21),		/* combined length of all sequences used */
      2 pad (2) bit (36),
      2 nseq fixed binary,				/* # of video sequences defined */
      2 sequences (N_VIDEO_SEQUENCES refer (tty_video_table.nseq)) like tty_video_seq aligned,
						/* the control sequences */
      2 video_chars character (tty_video_table_video_chars_len refer (tty_video_table.video_chars_len)) unaligned;

dcl  video_chars_ptr pointer;				/* -> tty_video_table.video_chars */
dcl  video_chars character (tty_video_table.video_chars_len) based (video_chars_ptr);


/* A single video sequence: it may contain encoded screen coordinates or a repeat counter */

dcl  ttyvseqp pointer;

dcl 1 tty_video_seq based (ttyvseqp) aligned,
      2 flags unaligned,				/* first 2 characters */
        3 present bit (1) unaligned,			/* ON => this feature is present */
        3 interpret bit (1) unaligned,			/* ON => sequence contains encoded coordinates/repeat count */
        3 able_to_repeat bit (1) unaligned,		/* ON => sequence contains a repeat count */
        3 cpad_present bit (1) unaligned,		/* ON => this operation must be padded */
        3 cpad_in_chars bit (1) unaligned,		/* ON => pad expressed in characters */
        3 pad bit (7) unaligned,
        3 general bit (6) unaligned,			/* reserved for per-operation flags */
      2 cpad fixed binary (18) unsigned unaligned,	/* padding in characters of .1 millisecond units */
      2 pad bit (15) unal,
      2 len fixed binary (9) unsigned unaligned,		/* # of valid characters in sequence */
      2 seq_index fixed binary (12) unsigned unaligned;	/* start of string in character data */


/* Available operations */

dcl (ABS_POS	initial (1),	CLEAR_SCREEN	initial (2),
     CLEAR_TO_EOS	initial (3),	HOME		initial (4),
     CLEAR_TO_EOL	initial (5),	CURSOR_UP		initial (6),
     CURSOR_RIGHT	initial (7),	CURSOR_DOWN	initial (8),
     CURSOR_LEFT	initial (9),	INSERT_CHARS	initial (10),
     END_INSERT_CHARS   /* if not present, insert-chars opens up N spaces */
		initial (11),	DELETE_CHARS	initial (12),
     INSERT_LINES	initial (13),	DELETE_LINES	initial (14))
	fixed binary static options (constant);

dcl  N_VIDEO_SEQUENCES fixed binary static options (constant) initial (14);


/* Encoding of special values (eg: coordinates or the repeat count) */

dcl 1 tty_numeric_encoding based unaligned,
      2 flags,
        3 must_be_on bit (1) unaligned,			/* ON => an encoding; not a character */
        3 express_in_decimal bit (1) unaligned,		/* ON => express it as decimal digits */
        3 express_in_octal bit (1) unaligned,		/* ON => express it as octal digits; both OFF => in binary */

        3 offset_is_0 bit (1) unaligned,		/* ON => offset is not stored as it's zero */
      2 l_c_or_n fixed binary (2) unsigned unaligned,	/* 0 = line, 1= column, 2 = repeat-count */
      2 num_digits fixed bin (2) unsigned unaligned,	/* # of digits for decimal/octal; 0 => as many as needed */
      2 pad bit (1) unaligned,
      2 offset fixed bin (8) unaligned;			/* offset to add to the number */

/* END INCLUDE FILE tty_video_tables.incl.pl1 */
