/* BEGIN INCLUDE FILE ... tty_can_types.incl.pl1 */
/* Created:  10 November 1980 by G. Palter */

dcl (CAN_TYPE_OVERSTRIKE	initial (1),
     CAN_TYPE_REPLACE	initial (2))
	fixed binary static options (constant);

dcl  CAN_TYPE_NAMES (2) character (32) aligned static options (constant) initial
         ("can_type=overstrike", "can_type=replace");

/* END INCLUDE FILE ... tty_can_types.incl.pl1 */
