/* BEGIN INCLUDE FILE ... ttyp.incl.pl1 */

dcl  max_tty_type fixed bin static init (11);

dcl  tty_dev_type (0:16) char (8) aligned int static init	/* ASCII explanations of terminal type */
    ("Network", "1050", "2741", "TTY37", "TN300", "ARDS", "CORR2741", "TTY33",
     "TTY38", "G115", "type10", "ASCII", "type12", "type13", "type14", "type15", "type16");

/* Note that device type 0 is used for both absentee and network. Distingush some other way */

/* END INCLUDE FILE ... ttyp.incl.pl1 */
