/* BEGIN INCLUDE FILE ... tuning_parameter_info.incl.pl1 ... 04/21/81 ... WOS */

dcl  tp_info_ptr pointer;

dcl 1 tp_info aligned based (tp_info_ptr),
    2 ptr pointer unaligned,				/* Location of the value */
    2 value bit (36) aligned, 			/* Current value */
    2 type fixed bin,				/* See types, below */
    2 special bit (1) aligned,			/* Whether this one is "special" */
    2 long_name char (32) unaligned,			/* Long and short names */
    2 short_name char (16) unaligned;

dcl (TP_ON_OFF		init (1), 		/* bit (1) aligned -- also "on" and "off" to the command */
     TP_INTEGER		init (2), 		/* fixed bin (35) */
     TP_MICROSECONDS	init (3), 		/* fixed bin (35) microseconds, scaled by command */
     TP_SCALED_INTEGER	init (4), 		/* fixed bin (35, 18) */
     TP_CHAR		init (5),			/* char (4) aligned */
     TP_FLOAT		init (6)			/* float bin (27) aligned */
	) fixed binary internal static options (constant);

/* END INCLUDE FILE ... tuning_parameter_info.incl.pl1 */
