/* BEGIN INCLUDE FILE ... user_attributes.incl.pl1  TAC 10/79 */


/****^  HISTORY COMMENTS:
  1) change(86-12-11,Brunelle), approve(87-07-13,MCR7741),
     audit(87-04-19,GDixon), install(87-08-04,MR12.1-1056):
     Add incl for abs_attributes.incl.pl1 to automatically include absentee
     attribute switches.
  2) change(87-04-19,GDixon), approve(87-07-13,MCR7741),
     audit(87-07-16,Brunelle), install(87-08-04,MR12.1-1056):
      A) Add USER_ATTRIBUTE_NAMES arrays.  attribute_names.incl.pl1 can thereby
         be deleted.
      B) Add constants identifying attributes that can be changed by user at
         login, etc.
                                                   END HISTORY COMMENTS */


/* Modified 82-01-03  E. N. Kittlitz.  to declare a complete level-1 structure */

/* format: style4 */
dcl  1 user_attributes aligned based,			/* the user user_attributes */
       (2 administrator bit (1),			/* 1  system administrator privileges */
       2 primary_line bit (1),			/* 2  user has primary-line privileges  */
       2 nobump bit (1),				/* 2  user cannot be bumped */
       2 guaranteed_login bit (1),			/* 4  user has guaranteed login privileges */
       2 anonymous bit (1),				/* 5  used only in SAT. project may have anon.users */
       2 nopreempt bit (1),				/* 6  used only in PDT. user not preemptable by others
						   .  of same project (distinct from "nobump") */
       2 nolist bit (1),				/* 7  don't list user on "who" */
       2 dialok bit (1),				/* 8  user may have multiple consoles */
       2 multip bit (1),				/* 9  user may have several processes */
       2 bumping bit (1),				/* 10 in SAT. Can users in project bump each other? */
       2 brief bit (1),				/* 11 no login or logout message */
       2 vinitproc bit (1),				/* 12 user may change initial procedure */
       2 vhomedir bit (1),				/* 13 user may change homedir */
       2 nostartup bit (1),				/* 14 user does not want start_up.ec */
       2 sb_ok bit (1),				/* 15 user may be standby */
       2 pm_ok bit (1),				/* 16 user may be primary */
       2 eo_ok bit (1),				/* 17 user may be edit_only */
       2 daemon bit (1),				/* 18 user may login as daemon */
       2 vdim bit (1),				/* 19 * OBSOLETE * user may change outer mdle */
       2 no_warning bit (1),				/* 20 no warning message */
       2 igroup bit (1),				/* 21 in SAT: this project may give its users individual groups
						   .  in PDT: this user has an individual load control group */
       2 save_pdir bit (1),				/* 22 save pdir after fatal process error */
       2 disconnect_ok bit (1),			/* 23 ok to save user's disconnected processes */
       2 save_on_disconnect bit (1),			/* 24 save them unless -nosave login arg is given */
       2 pad bit (12)) unaligned;

dcl  USER_ATTRIBUTE_NAMES (0:24) char (20) int static options (constant) init
    ("none",					/* 0 */
     "administrator",				/* 1 */
     "primary_line",				/* 2 */
     "nobump",					/* 3 */
     "guaranteed_login",				/* 4 */
     "anonymous",					/* 5 */
     "nopreempt",					/* 6 */
     "nolist",					/* 7 */
     "dialok",					/* 8 */
     "multip",					/* 9 */
     "bumping",					/* 10 */
     "brief",					/* 11 */
     "vinitproc",					/* 12 */
     "vhomedir",					/* 13 */
     "nostartup",					/* 14 */
     "no_secondary",				/* 15 */
     "no_prime",					/* 16 */
     "no_eo",					/* 17 */
     "daemon",					/* 18 */
     "",						/* 19 vdim OBSOLETE */
     "no_warning",					/* 20 */
     "igroup",					/* 21 */
     "save_pdir",					/* 22 */
     "disconnect_ok",				/* 23 */
     "save_on_disconnect");				/* 24 */

dcl  ALT_USER_ATTRIBUTE_NAMES (0:24) char (20) int static options (constant) init
    ("null",					/* 0 */
     "admin",					/* 1 */
     "", "",					/* 2 - 3 */
     "guar",					/* 4 */
     "anon",					/* 5 */
     "", "",					/* 6 - 7 */
     "dial",					/* 8 */
     "multi_login",					/* 9 */
     "preempting",					/* 10 */
     "",						/* 11 */
     "v_process_overseer",				/* 12 */
     "v_home_dir",					/* 13 */
     "no_start_up",					/* 14 */
     "no_sec",					/* 15 */
     "no_primary",					/* 16 */
     "no_edit_only",				/* 17 */
     "op_login",					/* 18 */
     "",						/* 19 */
     "nowarn",					/* 20 */
     "", "", "",					/* 21 - 23 */
     "save");					/* 24 */

dcl  USER_ATTRIBUTES_always_allowed bit (36) aligned int static
     options(constant) init("000000000010000000010000000000000000"b);
    /* SAT/PDT attributes not needed for user to give (brief, no_warning) */

dcl  USER_ATTRIBUTES_default_in_pdt bit (36) aligned int static
     options(constant) init("000000000010000000010000000000000000"b);
    /* PDT value for (brief, no_warning) is default */

dcl  USER_ATTRIBUTES_settable_by_user bit (36) aligned int static
     options(constant) init("000100000110010000010000000000000000"b);	
    /* user MIGHT set (bump, ns, brief, guar, no_warning) */

%include user_abs_attributes;

/* END INCLUDE FILE ... user_attributes.incl.pl1 */
