/* BEGIN INCLUDE FILE...user_message_handles.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(85-12-19,Herbst), approve(87-07-20,MCR7697),
     audit(87-07-20,GDixon), install(87-08-04,MR12.1-1056):
     Added SYSTEM_MESSAGE_HANDLE
  2) change(86-06-30,Coren), approve(86-06-30,MCR7415),
     audit(86-07-02,Margolin), install(86-07-11,MR12.0-1092):
     Added USER_MESSAGE_LS_CONNECTION_INFO_HANDLE and
     USER_MESSAGE_LS_CONNECTION_INFO_HANDLE_LOWER_18 for use by login servers.
                                                   END HISTORY COMMENTS */

/* This include file defines "well-known" handles for as_user_messages,
   i.e., each of the handles defined here will be used for a particular purpose,
   and programs that expect to receive such messages will use the appropriate
   handle to read them.
*/

dcl  USER_MESSAGE_LS_CONNECTION_INFO_HANDLE initial ("000000000000777777777777"b3)   /* connection_info sent by login server to newly created process */
	bit (72) aligned internal static options (constant);

dcl  USER_MESSAGE_LS_CONNECTION_INFO_HANDLE_LOWER_18 initial ("777777"b3)   /* allows upper 54 bits to be used for unique identifier */
	bit (18) aligned internal static options (constant);

dcl  SYSTEM_MESSAGE_HANDLE initial ("770007700077000770007700"b3) /* for warn and dm_shut messages */
	bit (72) aligned internal static options (constant);


/* END INCLUDE FILE...user_message_handles.incl.pl1 */
