/* BEGIN INCLUDE  vrm_search_info.incl.pl1    */

dcl  vrm_search_info_ptr pointer;

dcl 1 vrm_search_info aligned based (vrm_search_info_ptr),
    2 tuple_pointer_required bit (1) unal,		/* ON = Tuple pointer needs to be returned by search */
    2 tuple_tid_required bit (1) unal,			/* ON = Tuple id needs to be returned by search */
    2 meter_sw bit (1) unal,				/* ON = Metering is being done */
    2 mbz bit (33) init ("0"b),
    2 upper_limit_exceeded_sw bit (1) aligned,		/* ON = Upper limit on search was exceeded */
    2 last_call_stats like statistics,			/* Statistics is found in vrm_cursor.incl.pl1 */
    2 max_number_values fixed bin (35),			/* Maximum number of values allowed by get_by_spec */
    2 cur_id_list_ix fixed bin (35),			/* Index in to id_list */
    2 num_items_returned fixed bin,			/* Number of items retruned by vrmu_search */
    2 tid_list_ptr ptr,				/* Pointer to list of tids returned */
    2 tup_ptr (1001) ptr unal;

dcl MAX_SEARCH_ITEMS fixed bin int static options (constant) init (1001);

/* END INCLUDE  vrm_search_info.incl.pl1    */
