/* BEGIN vrm_change_bits.incl.pl1 -- R. Harvey */

dcl  1 change_bits based (change_bits_ptr),
       2 number_of_change_bits fixed bin (17),
       2 position (cb_number_of_change_bits refer (change_bits.number_of_change_bits)) bit (1) unal;

dcl  cb_number_of_change_bits fixed bin;
dcl  change_bits_ptr ptr;

/* END vrm_change_bits.incl.pl1 */
