/*   BEGIN INCLUDE  vrm_rel_desc.incl.pl1		   */

/* 83-05-26 Roger Lackey : Added vrm_attr_info.key_head bit for relation_cursors */

dcl 1 vrm_rel_desc based (vrm_rel_desc_ptr),
    2 record_id bit (12) unal,			/* Distinguish us from tuples and collection records */
    2 version char (8),				/* Version of this structure */
    2 file_id bit (7),				/* Value of file id from model */
    2 rel_id bit (12),				/* Relation id */
    2 switches,
      3 MRDS_compatible bit (1) unal,			/* For pre-relation_manager_ MRDS */
      3 stationary_records
     bit (1) unal,					/* On = stationary */
      3 indexed bit (1) unal,				/* This relation has attributes with secondary indices */
      3 pad bit (33) unal,
    2 var_offset fixed bin (35),			/* Position of first varying attr */
    2 maximum_data_length
     fixed bin (35),				/* Maximum size of tuple in characters */
    2 number_primary_key_attrs
     fixed bin,					/* Number of attributes which make up the primary key */
    2 number_sec_indexes fixed bin,			/* Number of attributes which have a secondary index */
    2 last_var_attr_no fixed bin,			/* Attr index of last varying attribute */
    2 number_var_attrs fixed bin,			/* Number of varying attributes */
    2 number_attrs fixed bin,				/* Number of attribute in rel */
    2 attr (vrd_no_of_attrs				/* Description of each attribute */
     refer (vrm_rel_desc.number_attrs)) aligned like vrm_attr_info;

dcl 1 vrm_attr_info based (vrm_attr_info_ptr),
						/* Attribute specific info */
    2 name char (32),				/* Name of the attribute */
    2 descriptor bit (36) aligned,			/* domain descriptor */
    2 varying bit (1) unal,				/* ON = This is a varying string */
    2 key_head bit (1) unal,				/* ON = This attr can be a keyhead */
    2 primary_key_attr bit (1) unal,			/* ON = This is a primary key attribute */
    2 pad bit (15) unal,				/* unused */
    2 index_collextion_ix fixed bin (17) unal,		/* Index into vrm_open_info.index_collection array if key_head is on */
    2 bit_length fixed bin (35),			/* Maximum bit length of tuple */
    2 bit_offset fixed bin (35);			/* Offset in tuple if fixed, index to offset in tuple if varying */


dcl  vrm_rel_desc_ptr pointer;
dcl  vrd_no_of_attrs fixed bin;
dcl  VRM_REL_DESC_RECORD_ID bit (12) unal int static options (constant) init ("100000000000"b);
dcl  VRM_REL_DESC_VERSION_1 char (8) int static options (constant) init ("       1");
dcl  vrm_attr_info_ptr pointer;
dcl  VRM_REL_DESC_KEY char (256) varying int static options (constant) init ("@relation_description");

/*   END INCLUDE  vrm_rel_desc.incl.pl1		   */
