/* BEGIN INCLUDE FILE ... vtoce_pc_sws.incl.pl1 */

dcl  vpsp ptr;
dcl 1 vtoce_pc_sws based (vpsp) aligned,
    (2 dnzp bit (1),
    2 gtpd bit (1),
    2 damaged bit (1),
    2 synchronized bit (1),
    2 pad bit (32)) unal;

/* END INCLUDE FILE ... vtoce_pc_sws.incl.pl1 */
