
/* Begin include file ...... wired_io_disk_data.incl.pl1 */
/*	Created 3/26/76 by Noel I. Morris	*/

dcl 1 wired_io_disk_data$ (16) ext aligned,		/* channel correspondence table */
   (2 pad1 bit (5),
    2 paging_channel_chx fixed bin (12),		/* index of paging disk channel */
    2 pad2 bit (5),
    2 io_channel_index fixed bin (12)) unal;		/* index of channel known to I/O Interfacer */

/* End of include file ...... wired_io_disk_data.incl.pl1 */

