/*  BEGIN INCLUDE FILE ... wtcb.incl.pl1 */
						                                                                                                              

/****^  HISTORY COMMENTS:
  1) change(88-06-15,Berno), approve(88-07-13,MCR7928),
     audit(88-06-15,Parisek), install(88-07-19,MR12.2-1061):
     Add data needed for the uncp multiplexer (DSA gateway) interface
     implementation.
                                                   END HISTORY COMMENTS */


/*
   Moved from tty_buf.incl.pl1 Aug 78 by J. Nicholls plus changes for ring 0 demultiplexing
   Error code added Nov. 1982 by Robert Coren
   Modified December 1984 by Robert Coren to invent "more_flags" structure and
    its first flag, line_status_disabled
   Reported modifications for the DN7100 interim in August 85.
*/

dcl  wtcbp ptr;					/* pointer to head of wtcb */

dcl 1 wtcb based (wtcbp) aligned,			/* wired terminal control block */
    2 hevent fixed bin (71) aligned,			/* event channel for hangup/dialup signal */
    2 event fixed bin (71) aligned,			/* users event channel, for uproc */

    2 line_status bit (72) aligned,			/* actual line status sent by fnp */

    2 tcb_ptr ptr unal,				/* pointer to tcb */
    2 pad1 fixed bin (35),				/* formerly time dialedup */

    2 hproc bit (36) aligned,				/* boss processid */
    2 uproc bit (36) aligned,				/* tty user processid */

    2 baud_rate fixed bin (18) unal uns,		/* baud rate of this line */
    2 line_type fixed bin (18) unal uns,		/* line type for line protocol */

    2 flags unaligned,
      3 listen bit (1) unaligned,			/* if on, listen for dialups */
      3 dialed bit (1) unaligned,			/* if on, line is dialed up */
      3 send_output bit (1) unaligned,			/* on if DN355 requested more output */

      3 qenable bit (1) unaligned,			/* if on, signal quits */
      3 qflag bit (1) unaligned,			/* on after quit, causes writes to be ignored */
      3 end_frame bit (1) unaligned,			/* write chain fills ards frame */

      3 notify_reqd bit (1) unaligned,			/* if on, do notify after unlocking lock */
      3 work_reqd bit (1) unaligned,			/* if on, call dn355 before returning */
      3 dialing bit (1) unaligned,			/* if on, 355 is dialing a phone number */

      3 dial_status_valid bit (1) unaligned,		/* if on, dial_status_code is valid */
      3 input_available bit (1) unaligned,		/* input for this device is waiting in wired space */
      3 tcb_initialized bit (1) unaligned,		/* if on, tcb has been initialized */

      3 wflag bit (1) unaligned,			/* process blocked on output */
      3 rflag bit (1) unaligned,			/* process blocked on input */
      3 wru bit (1) unaligned,			/* reading answerback */

      3 hndlquit bit (1) unaligned,			/* on if in hndlquit mode */
      3 count_lines bit (1) unaligned,			/* on if tcb.linemax > 0 */
      3 line_status_present bit (1) unaligned,		/* fnp has sent line status */

      3 sync_line bit (1) unaligned,			/* channel is synchronous line type */
      3 breakall bit (1) unaligned,			/* channel is in breakall mode */
      3 scroll bit (1) unaligned,			/* channel is in scroll mode */

      3 negotiating_echo bit (1) unaligned,		/* ring zero to echo chars. */
      3 wake_tbl bit (1) unaligned,			/* on if in wake_tbl mode */
      3 allow_wakeup bit (1) unaligned,			/* on to allow input wakeup in wake_tbl mode */

      3 receive_mode_device bit (1) unaligned,		/* device must be told to enter receive mode */
      3 mark_set bit (1) unal,			/* write_with_mark call outstanding */
      3 masked bit (1) unal,				/* channel masked by FNP */

    2 dial_status_code fixed bin (8) unaligned,		/* code returned by 355 after dialing a phone number */

    2 fblock fixed bin (17) unaligned,			/* oldest read pointer, block */
    2 lblock fixed bin (17) unaligned,			/* newest read block */

    2 fchar fixed bin (9) unsigned unaligned,		/* first block char index */
    2 actline fixed bin (9) unsigned unaligned,		/* line number of current line */
    2 actcol fixed bin (9) unsigned unaligned,		/* tty column position */
    2 nramsgs fixed bin (9) unsigned unaligned,		/* current number of read-ahead msgs */

    2 write_first fixed bin (17) unaligned,		/* first write block */
    2 write_last fixed bin (17) unaligned,		/* last write block */
    2 write_cnt fixed bin (17) unaligned,		/* count of chars in write chain */
    2 white_col fixed bin (17) unaligned,		/* column position resulting from trailing white space */

    2 max_buf_size fixed bin (9) unal uns,		/* maximum-size buffer to be allocated for this channel */
    2 buffer_pad fixed bin (9) unal uns,		/* amount of pad to be left in output buffers */
    2 devx fixed bin (17) unaligned,			/* index into lct of channel's entry */
    2 echdp bit (18) unaligned,			/* echo negotiation data ptr */
    2 waketp bit (18) unaligned,			/* wakeup table offset */
    2 prompt_len fixed bin (8) unaligned,		/* number of chars in prompt string */
    2 prompt char (3) unaligned,			/* text of prompt message */
    2 line_delimiter char (1) unal,			/* line delimiter for tty_read parse */
    2 more_flags unaligned,				/* in addition to flags (above) */
      3 line_status_disabled bit (1) unaligned,		/* "1"b => don't relay line_status interrupts */
    2 send_turn bit (1) unal,				/* For the Dn7100 interim */
    2 pad bit (25) unal,
    2 error_code fixed bin (35),			/* error code returned by channel_manager to tty_interrupt */
    2 pad2 bit (36);

/* Ends on doubleword boundary */

/* END INCLUDE FILE ... wtcb.incl.pl1 */
