/*  BEGIN INCLUDE FILE  xforum_answers.incl.pl1                        */


/****^  HISTORY COMMENTS:
  1) change(87-04-13,LJAdams), approve(87-04-30,MCR7684),
     audit(87-07-30,Blair), install(87-08-06,MR12.1-1065):
     Created.
                                                   END HISTORY COMMENTS */

dcl  1 answer_array,
       2 N                                     fixed bin,   /* Number of acceptable answers; 0 = all	*/
       2 max_length			       fixed bin,	/* max length user reply can be		*/
       2 answer (10)		       char (80) varying;
	

dcl  ZERO                                      fixed bin internal static options (constant) init (0),
     ONE				       fixed bin internal static options (constant) init (1),
     FOUR				       fixed bin internal static options (constant) init (4);
	
						
/*  END INCLUDE FILE  xforum_answers .incl.pl1                         */
