/*  START OF:	xforum_windows.incl.pl1		  *  *  *  *  * */

/* structures for windows used by xforum - Deryk Barker January 1984 */

dcl      1 xforum_windows aligned external static,
	 2 (status, menu, bottom, orig_user_io, help_line) aligned like xforum_window_info;
	 
dcl      1 xforum_window_info,
	 2 iocb      ptr,
	 2 position  aligned like window_position_info;
	 
%include window_control_info;

/*  END OF:	xforum_windows.incl.pl1		  *  *  *  *  * */
