/*  START OF:	xforum_menu_info.incl.pl1		  *  *  *  *  * */

/* menu info needed for xforum
   dgrb November 1983					      */

dcl      XFORUM_WINDOW_HEIGHT  fixed bin int static init (11)
			 options (constant);

/*  END OF:	xforum_menu_info.incl.pl1		  *  *  *  *  * */
