/*  START OF:	xforum_ptr_struct_.incl.pl1		  *  *  *  *  * */

declare 1 xforum_ptr_struct_            external static,
	2 xforum_meeting_list_ptr	ptr,
	2 xforum_meeting_info_ptr	ptr,
	2 xforum_trans_array_ptr	ptr,
	2 xforum_system_area_ptr	ptr;

/*  END OF:	xforum_ptr_struct_.incl.pl1		  *  *  *  *  * */
