/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


/* Benson I. Margulies, sometime in 1981 */
/* format: style2,linecom,^indnoniterdo,indcomtxt,^inditerdo,dclind5,idind25 */

tc_error:
     procedure (code, msg) options (support);
	declare code		   fixed bin (35);
	declare msg		   character (*);
	declare null		   builtin;
	declare sub_err_		   entry () options (variable);
	declare video_data_$error_name   character (32) external static;

	call sub_err_ (code, video_data_$error_name, "s", null (), (0),
	     "Internal error in video system terminal control.^/ ^a.", msg);
						/* may not return with "s" there */
     end tc_error;
