/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


memo_upgrade_memo_segment_: proc (P_memo_segment_ptr);

/* *	This procedure is used (someday) to upgrade an old version memo segment
   *	to the current version. Currently, it does nothing.
   *
   *	June, 1980, W. Olin Sibert
   */

dcl  P_memo_segment_ptr pointer;

dcl (addr, null, substr, length, maxlength, max, min) builtin;

/*  */

	return;					/* do nothing.... for now */
	end;					/* external procedure memo_upgrade_memo_segment_ */
