/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

decode_oldesc_:	proc(old) returns(bit(36)aligned) options(support);

dcl	old bit(36) aligned;

dcl	1 old_descriptor	aligned,
	2 old_type	fixed bin(14) unal,
	2 old_junk	bit(3) unal,
	2 old_decimal	bit(1) unal,
	2 old_scale	fixed bin(7) unal,
	2 old_precision	fixed bin(8) unal;

dcl	(divide,unspec) builtin;

%include desc_types;
%include descriptor;

	unspec(old_descriptor) = old;

	unspec(desc_) = (36) "0"b;

	scale_ = old_scale;
	precision_ = old_precision;

	if old_decimal
	then do;
		type_ = D_fixed_real_desc + divide(old_type-1,2,17,0);
		goto ret;
	end;

	if old_type<=entry_desc
	then do;
		type_ = old_type;
		goto ret;
	end;

	if old_type>=518 & old_type<=522
	then do;
		type_ = old_type-500;

		if type_=v_bit_desc | type_=char_desc
		then	type_ = 41-type_;

		goto ret;
	end;

ret:
	return(unspec(desc_));

	end decode_oldesc_;
