/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

pl1_io_: proc;

	return;

	/* pl1_io_:  user-accessible interfaces to get PL/I I/O data */
	/* Bernard Greenberg 12/20/76 */

dcl 1 file_variable aligned based,			/* Declaration of any PL/I File Value */
    2 fab_ptr ptr,					/* Pointer to File Attribute Block (FAB) */
    2 fsb_ptr ptr;					/* Pointer to File State Block (FSB */

dcl  a_file file variable;				/* Argument File */

dcl 1 a_file_value like file_variable aligned based (addr (a_file)); /* Redeclaration of parameter. */

get_iocb_ptr: entry (a_file) returns (ptr);		/* Return pointer to IOCB */

	return (a_file_value.fsb_ptr -> fsb.iocb_p);

error_code: entry (a_file) returns (fixed bin (35));	/* Return last non-zero error code. */

	return (a_file_value.fsb_ptr -> fsb.lnzc);


dcl  fsbp ptr;					/* Satisfy include file */

%include plio2_fsb;
end;
