/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */

/* Written by J. Siwila  3/30/83 */

/* This procedure prints segments containing Tutorial information. */

/* Changed 3/30/84 by J. Siwila:  add condition handler for sub_error_ and check for error_table_$recoverable_error. */

/* format: style2 */
tut_get_seg_:
     proc (seg_name, menu_io, user_io_window_info, code);

/* Automatic */

	dcl     code		 fixed bin (35);
          dcl     error_table_$recoverable_error fixed bin (35) external;
	dcl     menu_io		 ptr;
	dcl     ME_SEG_NAME		 char (14) init ("tut_get_seg_");
	dcl     seg_name		 char (*);
	dcl     1 user_io_window_info	 like window_position_info;
	dcl     1 local_fdoc_options	 like format_document_options;

/* Builtin */

	dcl     addr		 builtin;
          dcl     sub_error_             condition;

/* Entries */

	dcl     format_document_$switch
				 entry (char (*), char (*), ptr, ptr, fixed bin (35));
	dcl     tut_quit_		 entry () options (variable);
	dcl     window_$clear_window	 entry (ptr, fixed bin (35));

/* Static */

	dcl     iox_$user_output	 ptr external static;

	format_document_options_ptr = addr (local_fdoc_options);
	local_fdoc_options.version_number = format_document_version_2;
	local_fdoc_options.indentation = 0;
	local_fdoc_options.line_length = user_io_window_info.extent.width;
	local_fdoc_options.pgno_sw = "0"b;
	local_fdoc_options.adj_sw = "0"b;
	local_fdoc_options.galley_sw = "1"b;
	local_fdoc_options.error_sw = "0"b;
	local_fdoc_options.literal_sw = "0"b;
	local_fdoc_options.dont_compress_sw = "1"b;
	local_fdoc_options.break_word_sw = "1"b;
	local_fdoc_options.max_line_length_sw = "1"b;
	local_fdoc_options.dont_break_indented_lines_sw = "1"b;
	local_fdoc_options.sub_err_sw = "1"b;
	local_fdoc_options.dont_fill_sw = "0"b;
	local_fdoc_options.hyphenation_sw = "1"b;
	local_fdoc_options.mbz = "0"b;
	local_fdoc_options.syllable_size = 2;

	on condition (sub_error_) code = 0;

	call window_$clear_window (iox_$user_output, code);
	if code ^= 0
	then do;
		call tut_quit_ (code, ME_SEG_NAME, "Unable to clear window.", menu_io, user_io_window_info);
		return;
	     end;
	call format_document_$switch (">doc>facilities_data_dir", seg_name, iox_$user_output,
	     format_document_options_ptr, code);
	if code ^= 0
	then 
	     if code = error_table_$recoverable_error 
	     then code = 0;
	     else call tut_quit_ (code, ME_SEG_NAME, "Unable to print option.", menu_io, user_io_window_info);

	return;

%page;
%include window_control_info;
%page;
%include format_document_options;

     end tut_get_seg_;
