/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   *********************************************************** */

/* ***************************************************************************
   ***************************************************************************
   *                                                                         *
   *                                                                         *
   *         mme geloop                                                      *
   *                                                                         *
   *                                                                         *
   * This mme is not implemented.  It is ignored.                            *
   *                                                                         *
   *                                                                         *
   *    Written by R. H. Morrison February 22, 1974                          *
   *    Modified by R.H. Morrison April 4, 1974                              *
   *    Modified by M. R. Jordan, October 1977
   *                                                                         *
   *                                                                         *
   ***************************************************************************
   *************************************************************************** */




gcos_mme_loop_: proc (faultp, increment);

dcl  faultp pointer;						/* unused input parameter */
dcl  increment fixed bin(24);						/* number of mme parameters */

	increment = 0;				/* one mme parameter */
	return;

%include gcos_ext_stat_;


     end gcos_mme_loop_;
