/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


gcos_mme_wake_: proc (mcp, increment);


/*	Handler for the gewake mme. It does nothing but return to the caller. */

dcl  mcp ptr;						/* Machine conditions ptr. */
dcl  increment fixed;						/* No. of args. passed to this mme. */

	increment = 0;				/* Indicate no args. passed to this mme. */

	return;

     end gcos_mme_wake_;
