/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */

/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */
/*									*/
/*      Written in June 1983 by Jeffrey D. Ives.					*/
/*									*/
/*  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  * */


/* format: style2,^inddcls,ifthendo,^indnoniterdo,thendo,^inditerdo,ind2,dclind5,idind32 */
%page;
trace_repeat_:
  proc (number_of_times_i, entry_to_return_elapsed_time_o, return_to_entry_elapsed_time_o);

    entry_to_return_elapsed_time = 0;
    return_to_entry_elapsed_time = 0;

    do number_of_times = 0 to number_of_times_i;
      entry_clock_reading = clock ();

      call trace_repeat_dummy_ (return_clock_reading);

      if number_of_times ^= 0 /* Waste the first entry reading.		*/
      then do;
        return_to_entry_elapsed_time = return_to_entry_elapsed_time + (entry_clock_reading - old_return_clock_reading);
        entry_to_return_elapsed_time = entry_to_return_elapsed_time + (return_clock_reading - entry_clock_reading);
      end;

      old_return_clock_reading = return_clock_reading;
    end;

    entry_to_return_elapsed_time_o = entry_to_return_elapsed_time;
    return_to_entry_elapsed_time_o = return_to_entry_elapsed_time;

    return;
%page;
/* START OF DECLARATIONS */
/* format: ^insnl,^delnl */

/* Parameters */
dcl  entry_to_return_elapsed_time_o  fixed bin (53) parm;
dcl  number_of_times_i	       fixed bin (34) parm;
dcl  return_to_entry_elapsed_time_o  fixed bin (53) parm;

/* Automatic */
dcl  entry_clock_reading	       fixed bin (53);
dcl  entry_to_return_elapsed_time    fixed bin (53);
dcl  number_of_times	       fixed bin;
dcl  old_return_clock_reading	       fixed bin (53);
dcl  return_clock_reading	       fixed bin (53);
dcl  return_to_entry_elapsed_time    fixed bin (53);

/* Static */

/* Conditions */

/* Based */

/* External Variables */

/* External Entries */
dcl  trace_repeat_dummy_	       entry (fixed bin (53));

/* format: insnl,delnl */
/* END OF DECLARATIONS */

  end trace_repeat_;
