/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        * Copyright (c) 1972 by Massachusetts Institute of        *
        * Technology and Honeywell Information Systems, Inc.      *
        *                                                         *
        *********************************************************** */


history_reg_save: proc;

/* history_reg_save - hardcore primitives for turning  on  or  off  the  ability  to  save
   history  regs,  either  per  process  (with  the  per_proc  entry) or per-system (with the
   per_system entry).

   Written 9/16/80 by J. A. Bush for the DPS8/70M CPU
*/

dcl (pp_state, ps_state) bit (1) aligned;		/* entry parameters */
dcl  pds$save_history_regs bit (1) aligned ext;
dcl  wired_hardcore_data$global_hregs bit (1) aligned ext;

/* entry to return the state of a process's ability to save history regs, called from hcs_$history_regs_get */

per_proc_get: entry (pp_state);			/* per-process get entry */

	pp_state = pds$save_history_regs;		/* return switch state */

	return;					/* thats it, return to caller */

/* entry to save a process's history regs, called from hcs_$history_regs_set */

per_proc_set: entry (pp_state);			/* per-process set entry */

	pds$save_history_regs = pp_state;		/* set the desired switch state */

	return;					/* thats it, return to caller */

/* entry to return the state of the systems ability to save history regs, called from hphcs_$history_regs_get */

per_system_get: entry (ps_state);			/* per-system get  entry */

	ps_state = wired_hardcore_data$global_hregs;	/* return switch state */

	     return;				/* thats it, return to caller */

/* entry to save everybodies history regs_set called from hphcs_$history_regs_set */

per_system_set: entry (ps_state);			/* per-system set  entry */

	wired_hardcore_data$global_hregs = ps_state;	/* set the desired switch state */

	return;					/* thats it, return to caller */

     end history_reg_save;
