/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   *********************************************************** */

/* format: style4,indattr,ifthenstmt,ifthen,^indcomtxt,idind33 */

bjm_adopt_transaction:
     procedure (p_tid, p_tix, p_code);

/* DESCRIPTION

	bjm_adopt_transaction - procedure to allow a process other than the
     one that started a transaction to complete the transaction.  from the
     point of before journal manager, adoption means the changing of some
     TXTE information for a transaction.  this change is local to before
     journal manager and there are no implicit effects to any other subsystem.
*/

/* HISTORY:
Written by M. Pandolf, 09/01/82.
Modified:
12/06/83 by L. A. Newcomb:  Renamed before_journal_manager_static_ to
            bjm_data_ and moved some cells from dm_data_ to bjm_data_.
06/07/84 by Lee Baldwin:  Fixed to call dm_error_$no_current_transaction
            instead of dm_error_$bj_no_txn.
03/19/85 by Steve Herbst: Fixed to initialize bjm_data_$bj_code.
*/
%page;
/* initialize parameters */

	tid = p_tid;
	tix = p_tix;
	p_code = 0;

/* set up addresses for unexpected error */

	bjm_data_$bj_exit_err = nonlocal_error_exit;
	bjm_data_$bj_code = 0;

	on cleanup call CLEANUP;

	if bjm_data_$bj_operation = ""
	then bjm_data_$bj_operation = ME;
	else do;
	     p_code = dm_error_$bj_recursive_invoc;
	     goto quick_exit;
	end;

/* check parameters */

	if tix < 1 | tix > dm_system_data_$max_n_transactions | tid = (36)"0"b
	then do;
	     p_code = dm_error_$no_current_transaction;
	     goto local_error_exit;
	end;

	bj_txte_ptr = addr (dm_data_$bj_txt_ptr -> bj_txt.entry (tix));

	if bj_txte.tid ^= tid
	then do;
	     p_code = dm_error_$bj_bad_tid;
	     goto local_error_exit;
	end;

/* the transaction seems valid, so invoke the primitive to adopt the transaciton */

	call bj_adopt_txn$adopt (tix);

std_exit:
	bjm_data_$bj_operation = "";
	bjm_data_$bj_exit_err = bjm_data_$bj_default_error_label;

quick_exit:
	return;

nonlocal_error_exit:
	p_code = bjm_data_$bj_code;

local_error_exit:
	call CLEANUP;
	goto quick_exit;


/* INTERNAL PROCEDURES */

CLEANUP:
     procedure ();

dcl  code			        fixed bin (35);

	call bj_cleanup_tables$handler (code);

	bjm_data_$bj_operation = "";
	bjm_data_$bj_exit_err = bjm_data_$bj_default_error_label;

	return;

     end CLEANUP;

/* DECLARATIONS */

/* Parameter */

dcl  p_tid		        bit (36) aligned parameter; /* transaction ID */
dcl  p_tix		        fixed bin parameter;	/* transaction index */
dcl  p_code		        fixed bin (35) parameter; /* standard system status code */

/* Automatic */

dcl  tid			        bit (36) aligned;	/* local copy of transaction ID */
dcl  tix			        fixed bin;		/* local copy of transaction index */

/* Static, External */

dcl  dm_error_$bj_recursive_invoc     fixed bin (35) external static;
dcl  dm_error_$no_current_transaction fixed bin (35) external static;
dcl  dm_error_$bj_bad_tid	        fixed bin (35) external static;
dcl  dm_data_$bj_txt_ptr	        pointer external static;

/* Constant */

dcl  ME			        char (32) internal static options (constant) init ("bjm_adopt_transaction");

/* Entry */

dcl  bj_adopt_txn$adopt	        entry (fixed bin);
dcl  bj_cleanup_tables$handler        entry (fixed bin (35));

/* Condition */

dcl  cleanup		        condition;

/* Include Files */

%page;
%include dm_bj_static;
%page;
%include dm_bj_txt;
%page;
%include dm_bj_global_error_info;
%page;

     end bjm_adopt_transaction;
