/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1984 *
        *                                                         *
        *********************************************************** */
bce_alert: proc (p_ss_info_ptr);

/* Write a message with alert on the operators console.
Keith Loepere, January 1984. */

/* format: style4,indattr,ifthenstmt,ifthen,idind33,^indcomtxt */

dcl  addr			        builtin;
dcl  arg			        char (arg_len) based (arg_ptr);
dcl  arg_count		        fixed bin;
dcl  arg_len		        fixed bin (21);
dcl  arg_num		        fixed bin;
dcl  arg_ptr		        ptr;
dcl  bce_data$console_alert_put_chars entry (ptr, ptr, fixed bin, fixed bin (35)) ext variable;
dcl  code			        fixed bin (35);
dcl  cu_$arg_count_rel	        entry (fixed bin, ptr, fixed bin (35));
dcl  cu_$arg_ptr_rel	        entry (fixed bin, ptr, fixed bin (21), fixed bin (35), ptr);
dcl  message		        char (256);
dcl  message_len		        fixed bin;
dcl  p_ss_info_ptr		        ptr parameter;
dcl  substr		        builtin;

	ss_info_ptr = p_ss_info_ptr;
	message_len = 0;
	call cu_$arg_count_rel (arg_count, ss_info.arg_list_ptr, code);
	if code = 0 then do arg_num = 1 to arg_count;
	     call cu_$arg_ptr_rel (arg_num, arg_ptr, arg_len, code, ss_info.arg_list_ptr);
	     substr (message, message_len + 1, arg_len) = arg;
	     substr (message, message_len + arg_len + 1, 1) = " ";
	     message_len = message_len + arg_len + 1;
	end;
	message_len = message_len + 1;
	substr (message, message_len, 1) = "
";
	call bce_data$console_alert_put_chars (addr (bce_data$console_alert_put_chars), addr (message), message_len, code);
	return;
%page; %include bce_subsystem_info_;
     end;
