/****^  ***********************************************************
        *                                                         *
        * Copyright, (C) Honeywell Bull Inc., 1987                *
        *                                                         *
        * Copyright, (C) Honeywell Information Systems Inc., 1982 *
        *                                                         *
        *********************************************************** */
%;
/* ******************************************************
   *                                                    *
   *                                                    *
   * Copyright (c) 1972 by Massachusetts Institute of   *
   * Technology and Honeywell Information Systems, Inc. *
   *                                                    *
   *                                                    *
   ****************************************************** */

/*
   Last Modified (Date and Reason):
   10/15/73 Steve Webber -- Initial coding.
   10/09/74 Lee Scheffler - Add auditing of bona fide illegal procedure faults.
   06/07/76 Bernard Greenberg- mc.resignal for truncation fault, incl. internal procedure for lth.
   85-01-15 EJ Sharpe - deleted all but set_pl1_machine entry since unused
   */

illegal_procedure$set_pl1_machine_mode: proc (new_mode, old_mode);

/* This entry will change the state of a process from a "pl1 machine" to a "bare machine".
   In the pl1 machine mode certain illegal procedure are ignored. In the bare
   machine mode these faults are signalled to the user. */

dcl (new_mode, old_mode) fixed bin;
dcl  pds$pl1_machine fixed bin ext;
dcl  i fixed bin;


	i = pds$pl1_machine;			/* return old value of the mode */
	pds$pl1_machine = new_mode;			/* change the mode for the process */
	old_mode = i;				/* return the copied old value */
	return;

     end illegal_procedure$set_pl1_machine_mode;
