/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1982 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


labl1: proc;

/* Write labels from "projfile" */

dcl (hp, pp) ptr,					/* pointers */
    (path, dn) char (168) aligned,			/* file system names */
     en char (32) aligned,				/* .. */
     wkp ptr,					/* pointer to readin buffer (dn) */
     nc fixed bin,					/* number of chars read in */
    (i, np, ec) fixed;				/* counters */

dcl  com_err_ entry options (variable),
     expand_path_ entry (ptr, fixed bin, ptr, ptr, fixed bin),
     hcs_$initiate entry (char (*) aligned, char (*) aligned, char (*) aligned,
     fixed bin (1), fixed bin (2), ptr, fixed bin),
     hcs_$terminate_noname entry (ptr, fixed bin),
     ioa_ entry options (variable),
     ios_$read_ptr entry (ptr, fixed bin, fixed bin);

dcl (addr, null, substr) builtin;


dcl  x1 char (50) int static aligned init		/* format statements */
    ("     xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"),
     x2 char (20) int static aligned init
    ("     x   ^32ax");

/* - - - - */

	wkp = addr (dn);				/* get ptr to buffer */
	path = "projfile";				/* Hunt up project file */
	call expand_path_ (addr (path), 8, addr (dn), addr (en), ec);
	if ec ^= 0 then do;
err:	     call com_err_ (ec, "labl1", path);
	     return;
	end;
	call hcs_$initiate (dn, en, "", 0, 1, pp, ec);	/* Get project file. */
	if pp = null then go to err;

test:	call ioa_ (x1);				/* Write out test box. */
	call ioa_ (x2, "");
	call ioa_ (x2, "Multics billing labels.");
	call ioa_ (x2, "");
	call ioa_ (x2, "This box should be centered.");
	call ioa_ (x2, "Type cr to go, x to repeat");
	call ioa_ (x1);
	call ioa_ ("");
	call ios_$read_ptr (wkp, 12, nc);		/* Read his answer. */
	if nc > 1 then go to test;			/* If he typed anything, repeat */

	np = pp -> projfile.nproj;			/* Ready to go. */

	do i = 1 to np;				/* Loop for all projects */
	     call ioa_ ("");			/* Drop down one line */
	     call ioa_ ("^-^a", projfile.projfiletab.sup (i)); /* Supervisor. */
	     call ioa_ ("");
	     call ioa_ ("^-^a", projfile.projfiletab.sup_addr (i));   /* Address. */
	     call ioa_ ("^/");
	     call ioa_ ("^-Supervisor, ^a", projfile.projfiletab.id (i));	/* Group. */
	     call ioa_ ("^/");
	end;
	call hcs_$terminate_noname (pp, ec);
%page;
%include projfile;


     end;

