/* ***********************************************************
   *                                                         *
   * Copyright, (C) Honeywell Information Systems Inc., 1983 *
   *                                                         *
   * Copyright (c) 1972 by Massachusetts Institute of        *
   * Technology and Honeywell Information Systems, Inc.      *
   *                                                         *
   *********************************************************** */


/**** format: ind3,ll80,initcol6,indattr,^inddcls,dclind4,idind16	       */
/**** format: struclvlind2,^ifthenstmt,^ifthendo,^ifthen,^indnoniterdo       */
/**** format: ^inditerdo,^indnoniterend,^indthenelse,case,^indproc,^indend   */
/**** format: ^delnl,^insnl,comcol41,^indcom,^indblkcom,linecom,^indcomtxt   */

mrpg_get_ln_: proc returns (fixed bin (18));

dcl line_no	fixed bin (18);

      call cu_$stack_frame_ptr (sf_ptr);
%include stack_frame;
dcl 1 sf		like stack_frame based (sf_ptr);
dcl sf_ptr	ptr;

      sf_ptr = sf.prev_sp;
      call stu_$get_runtime_block (sf_ptr, header_ptr, block_ptr,
         fixed (rel (sf.return_ptr), 18));
      line_no = 0;
      call stu_$get_line_no (block_ptr, fixed (rel (sf.return_ptr), 18),
         0, 0, line_no);

      return (line_no);

dcl header_ptr	ptr;
dcl block_ptr	ptr;
dcl stu_$get_runtime_block entry (ptr, ptr, ptr, fixed bin (18));
dcl stu_$get_line_no entry (ptr, fixed bin (18), fixed bin (18), fixed bin (18), fixed bin (18));
dcl cu_$stack_frame_ptr entry (ptr);
   end;
